{
  "slug": "2002-58",
  "type": "regulation",
  "legalType": "directive",
  "category": "referenced",
  "title": "DIRECTIVE 2002/58/EC OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL",
  "shortTitle": "ePrivacy Directive (Consolidated)",
  "sidebarTitle": "ePrivacy Directive",
  "description": "DIRECTIVE 2002/58/EC OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL",
  "celex": "02002L0058-20091219",
  "date": "12 July 2002",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:02002L0058-20091219",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "article-7",
      "title": "Article 7",
      "level": 3
    },
    {
      "id": "article-8",
      "title": "Article 8",
      "level": 3
    },
    {
      "id": "article-9",
      "title": "Article 9",
      "level": 3
    },
    {
      "id": "article-10",
      "title": "Article 10",
      "level": 3
    },
    {
      "id": "article-11",
      "title": "Article 11",
      "level": 3
    },
    {
      "id": "article-12",
      "title": "Article 12",
      "level": 3
    },
    {
      "id": "article-13",
      "title": "Article 13",
      "level": 3
    },
    {
      "id": "article-14",
      "title": "Article 14",
      "level": 3
    },
    {
      "id": "article-14a",
      "title": "Article 14a",
      "level": 3
    },
    {
      "id": "article-15",
      "title": "Article 15",
      "level": 3
    },
    {
      "id": "article-15a",
      "title": "Article 15a",
      "level": 3
    },
    {
      "id": "article-16",
      "title": "Article 16",
      "level": 3
    },
    {
      "id": "article-17",
      "title": "Article 17",
      "level": 3
    },
    {
      "id": "article-18",
      "title": "Article 18",
      "level": 3
    },
    {
      "id": "article-19",
      "title": "Article 19",
      "level": 3
    },
    {
      "id": "article-20",
      "title": "Article 20",
      "level": 3
    },
    {
      "id": "article-21",
      "title": "Article 21",
      "level": 3
    }
  ],
  "contentMarkdown": "*of 12 July 2002*\n\n*concerning the processing of personal data and the protection of privacy in the electronic communications sector (Directive on privacy and electronic communications)*\n\n## Preamble\n\nTHE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EUROPEAN UNION,\n\nHaving regard to the Treaty establishing the European Community, and in particular Article 95 thereof,\n\nHaving regard to the proposal from the Commission,\n\nHaving regard to the opinion of the Economic and Social Committee,\n\nHaving consulted the Committee of the Regions,\n\nActing in accordance with the procedure laid down in Article 251 of the Treaty,\n\nWhereas:\n\n## Recitals\n\n- (1) Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data requires Member States to ensure the rights and freedoms of natural persons with regard to the processing of personal data, and in particular their right to privacy, in order to ensure the free flow of personal data in the Community.\n\n- (2) This Directive seeks to respect the fundamental rights and observes the principles recognised in particular by the Charter of fundamental rights of the European Union. In particular, this Directive seeks to ensure full respect for the rights set out in Articles 7 and 8 of that Charter.\n\n- (3) Confidentiality of communications is guaranteed in accordance with the international instruments relating to human rights, in particular the European Convention for the Protection of Human Rights and Fundamental Freedoms, and the constitutions of the Member States.\n\n- (4) Directive 97/66/EC of the European Parliament and of the Council of 15 December 1997 concerning the processing of personal data and the protection of privacy in the telecommunications sector translated the principles set out in Directive 95/46/EC into specific rules for the telecommunications sector. Directive 97/66/EC has to be adapted to developments in the markets and technologies for electronic communications services in order to provide an equal level of protection of personal data and privacy for users of publicly available electronic communications services, regardless of the technologies used. That Directive should therefore be repealed and replaced by this Directive.\n\n- (5) New advanced digital technologies are currently being introduced in public communications networks in the Community, which give rise to specific requirements concerning the protection of personal data and privacy of the user. The development of the information society is characterised by the introduction of new electronic communications services. Access to digital mobile networks has become available and affordable for a large public. These digital networks have large capacities and possibilities for processing personal data. The successful cross-border development of these services is partly dependent on the confidence of users that their privacy will not be at risk.\n\n- (6) The Internet is overturning traditional market structures by providing a common, global infrastructure for the delivery of a wide range of electronic communications services. Publicly available electronic communications services over the Internet open new possibilities for users but also new risks for their personal data and privacy.\n\n- (7) In the case of public communications networks, specific legal, regulatory and technical provisions should be made in order to protect fundamental rights and freedoms of natural persons and legitimate interests of legal persons, in particular with regard to the increasing capacity for automated storage and processing of data relating to subscribers and users.\n\n- (8) Legal, regulatory and technical provisions adopted by the Member States concerning the protection of personal data, privacy and the legitimate interest of legal persons, in the electronic communication sector, should be harmonised in order to avoid obstacles to the internal market for electronic communication in accordance with Article 14 of the Treaty. Harmonisation should be limited to requirements necessary to guarantee that the promotion and development of new electronic communications services and networks between Member States are not hindered.\n\n- (9) The Member States, providers and users concerned, together with the competent Community bodies, should cooperate in introducing and developing the relevant technologies where this is necessary to apply the guarantees provided for by this Directive and taking particular account of the objectives of minimising the processing of personal data and of using anonymous or pseudonymous data where possible.\n\n- (10) In the electronic communications sector, Directive 95/46/EC applies in particular to all matters concerning protection of fundamental rights and freedoms, which are not specifically covered by the provisions of this Directive, including the obligations on the controller and the rights of individuals. Directive 95/46/EC applies to non-public communications services.\n\n- (11) Like Directive 95/46/EC, this Directive does not address issues of protection of fundamental rights and freedoms related to activities which are not governed by Community law. Therefore it does not alter the existing balance between the individual's right to privacy and the possibility for Member States to take the measures referred to in Article 15(1) of this Directive, necessary for the protection of public security, defence, State security (including the economic well-being of the State when the activities relate to State security matters) and the enforcement of criminal law. Consequently, this Directive does not affect the ability of Member States to carry out lawful interception of electronic communications, or take other measures, if necessary for any of these purposes and in accordance with the European Convention for the Protection of Human Rights and Fundamental Freedoms, as interpreted by the rulings of the European Court of Human Rights. Such measures must be appropriate, strictly proportionate to the intended purpose and necessary within a democratic society and should be subject to adequate safeguards in accordance with the European Convention for the Protection of Human Rights and Fundamental Freedoms.\n\n- (12) Subscribers to a publicly available electronic communications service may be natural or legal persons. By supplementing Directive 95/46/EC, this Directive is aimed at protecting the fundamental rights of natural persons and particularly their right to privacy, as well as the legitimate interests of legal persons. This Directive does not entail an obligation for Member States to extend the application of Directive 95/46/EC to the protection of the legitimate interests of legal persons, which is ensured within the framework of the applicable Community and national legislation.\n\n- (13) The contractual relation between a subscriber and a service provider may entail a periodic or a one-off payment for the service provided or to be provided. Prepaid cards are also considered as a contract.\n\n- (14) Location data may refer to the latitude, longitude and altitude of the user's terminal equipment, to the direction of travel, to the level of accuracy of the location information, to the identification of the network cell in which the terminal equipment is located at a certain point in time and to the time the location information was recorded.\n\n- (15) A communication may include any naming, numbering or addressing information provided by the sender of a communication or the user of a connection to carry out the communication. Traffic data may include any translation of this information by the network over which the communication is transmitted for the purpose of carrying out the transmission. Traffic data may, inter alia, consist of data referring to the routing, duration, time or volume of a communication, to the protocol used, to the location of the terminal equipment of the sender or recipient, to the network on which the communication originates or terminates, to the beginning, end or duration of a connection. They may also consist of the format in which the communication is conveyed by the network.\n\n- (16) Information that is part of a broadcasting service provided over a public communications network is intended for a potentially unlimited audience and does not constitute a communication in the sense of this Directive. However, in cases where the individual subscriber or user receiving such information can be identified, for example with video-on-demand services, the information conveyed is covered within the meaning of a communication for the purposes of this Directive.\n\n- (17) For the purposes of this Directive, consent of a user or subscriber, regardless of whether the latter is a natural or a legal person, should have the same meaning as the data subject's consent as defined and further specified in Directive 95/46/EC. Consent may be given by any appropriate method enabling a freely given specific and informed indication of the user's wishes, including by ticking a box when visiting an Internet website.\n\n- (18) Value added services may, for example, consist of advice on least expensive tariff packages, route guidance, traffic information, weather forecasts and tourist information.\n\n- (19) The application of certain requirements relating to presentation and restriction of calling and connected line identification and to automatic call forwarding to subscriber lines connected to analogue exchanges should not be made mandatory in specific cases where such application would prove to be technically impossible or would require a disproportionate economic effort. It is important for interested parties to be informed of such cases and the Member States should therefore notify them to the Commission.\n\n- (20) Service providers should take appropriate measures to safeguard the security of their services, if necessary in conjunction with the provider of the network, and inform subscribers of any special risks of a breach of the security of the network. Such risks may especially occur for electronic communications services over an open network such as the Internet or analogue mobile telephony. It is particularly important for subscribers and users of such services to be fully informed by their service provider of the existing security risks which lie outside the scope of possible remedies by the service provider. Service providers who offer publicly available electronic communications services over the Internet should inform users and subscribers of measures they can take to protect the security of their communications for instance by using specific types of software or encryption technologies. The requirement to inform subscribers of particular security risks does not discharge a service provider from the obligation to take, at its own costs, appropriate and immediate measures to remedy any new, unforeseen security risks and restore the normal security level of the service. The provision of information about security risks to the subscriber should be free of charge except for any nominal costs which the subscriber may incur while receiving or collecting the information, for instance by downloading an electronic mail message. Security is appraised in the light of Article 17 of Directive 95/46/EC.\n\n- (21) Measures should be taken to prevent unauthorised access to communications in order to protect the confidentiality of communications, including both the contents and any data related to such communications, by means of public communications networks and publicly available electronic communications services. National legislation in some Member States only prohibits intentional unauthorised access to communications.\n\n- (22) The prohibition of storage of communications and the related traffic data by persons other than the users or without their consent is not intended to prohibit any automatic, intermediate and transient storage of this information in so far as this takes place for the sole purpose of carrying out the transmission in the electronic communications network and provided that the information is not stored for any period longer than is necessary for the transmission and for traffic management purposes, and that during the period of storage the confidentiality remains guaranteed. Where this is necessary for making more efficient the onward transmission of any publicly accessible information to other recipients of the service upon their request, this Directive should not prevent such information from being further stored, provided that this information would in any case be accessible to the public without restriction and that any data referring to the individual subscribers or users requesting such information are erased.\n\n- (23) Confidentiality of communications should also be ensured in the course of lawful business practice. Where necessary and legally authorised, communications can be recorded for the purpose of providing evidence of a commercial transaction. Directive 95/46/EC applies to such processing. Parties to the communications should be informed prior to the recording about the recording, its purpose and the duration of its storage. The recorded communication should be erased as soon as possible and in any case at the latest by the end of the period during which the transaction can be lawfully challenged.\n\n- (24) Terminal equipment of users of electronic communications networks and any information stored on such equipment are part of the private sphere of the users requiring protection under the European Convention for the Protection of Human Rights and Fundamental Freedoms. So-called spyware, web bugs, hidden identifiers and other similar devices can enter the user's terminal without their knowledge in order to gain access to information, to store hidden information or to trace the activities of the user and may seriously intrude upon the privacy of these users. The use of such devices should be allowed only for legitimate purposes, with the knowledge of the users concerned.\n\n- (25) However, such devices, for instance so-called \"cookies\", can be a legitimate and useful tool, for example, in analysing the effectiveness of website design and advertising, and in verifying the identity of users engaged in on-line transactions. Where such devices, for instance cookies, are intended for a legitimate purpose, such as to facilitate the provision of information society services, their use should be allowed on condition that users are provided with clear and precise information in accordance with Directive 95/46/EC about the purposes of cookies or similar devices so as to ensure that users are made aware of information being placed on the terminal equipment they are using. Users should have the opportunity to refuse to have a cookie or similar device stored on their terminal equipment. This is particularly important where users other than the original user have access to the terminal equipment and thereby to any data containing privacy-sensitive information stored on such equipment. Information and the right to refuse may be offered once for the use of various devices to be installed on the user's terminal equipment during the same connection and also covering any further use that may be made of those devices during subsequent connections. The methods for giving information, offering a right to refuse or requesting consent should be made as user-friendly as possible. Access to specific website content may still be made conditional on the well-informed acceptance of a cookie or similar device, if it is used for a legitimate purpose.\n\n- (26) The data relating to subscribers processed within electronic communications networks to establish connections and to transmit information contain information on the private life of natural persons and concern the right to respect for their correspondence or concern the legitimate interests of legal persons. Such data may only be stored to the extent that is necessary for the provision of the service for the purpose of billing and for interconnection payments, and for a limited time. Any further processing of such data which the provider of the publicly available electronic communications services may want to perform, for the marketing of electronic communications services or for the provision of value added services, may only be allowed if the subscriber has agreed to this on the basis of accurate and full information given by the provider of the publicly available electronic communications services about the types of further processing it intends to perform and about the subscriber's right not to give or to withdraw his/her consent to such processing. Traffic data used for marketing communications services or for the provision of value added services should also be erased or made anonymous after the provision of the service. Service providers should always keep subscribers informed of the types of data they are processing and the purposes and duration for which this is done.\n\n- (27) The exact moment of the completion of the transmission of a communication, after which traffic data should be erased except for billing purposes, may depend on the type of electronic communications service that is provided. For instance for a voice telephony call the transmission will be completed as soon as either of the users terminates the connection. For electronic mail the transmission is completed as soon as the addressee collects the message, typically from the server of his service provider.\n\n- (28) The obligation to erase traffic data or to make such data anonymous when it is no longer needed for the purpose of the transmission of a communication does not conflict with such procedures on the Internet as the caching in the domain name system of IP addresses or the caching of IP addresses to physical address bindings or the use of log-in information to control the right of access to networks or services.\n\n- (29) The service provider may process traffic data relating to subscribers and users where necessary in individual cases in order to detect technical failure or errors in the transmission of communications. Traffic data necessary for billing purposes may also be processed by the provider in order to detect and stop fraud consisting of unpaid use of the electronic communications service.\n\n- (30) Systems for the provision of electronic communications networks and services should be designed to limit the amount of personal data necessary to a strict minimum. Any activities related to the provision of the electronic communications service that go beyond the transmission of a communication and the billing thereof should be based on aggregated, traffic data that cannot be related to subscribers or users. Where such activities cannot be based on aggregated data, they should be considered as value added services for which the consent of the subscriber is required.\n\n- (31) Whether the consent to be obtained for the processing of personal data with a view to providing a particular value added service should be that of the user or of the subscriber, will depend on the data to be processed and on the type of service to be provided and on whether it is technically, procedurally and contractually possible to distinguish the individual using an electronic communications service from the legal or natural person having subscribed to it.\n\n- (32) Where the provider of an electronic communications service or of a value added service subcontracts the processing of personal data necessary for the provision of these services to another entity, such subcontracting and subsequent data processing should be in full compliance with the requirements regarding controllers and processors of personal data as set out in Directive 95/46/EC. Where the provision of a value added service requires that traffic or location data are forwarded from an electronic communications service provider to a provider of value added services, the subscribers or users to whom the data are related should also be fully informed of this forwarding before giving their consent for the processing of the data.\n\n- (33) The introduction of itemised bills has improved the possibilities for the subscriber to check the accuracy of the fees charged by the service provider but, at the same time, it may jeopardise the privacy of the users of publicly available electronic communications services. Therefore, in order to preserve the privacy of the user, Member States should encourage the development of electronic communication service options such as alternative payment facilities which allow anonymous or strictly private access to publicly available electronic communications services, for example calling cards and facilities for payment by credit card. To the same end, Member States may ask the operators to offer their subscribers a different type of detailed bill in which a certain number of digits of the called number have been deleted.\n\n- (34) It is necessary, as regards calling line identification, to protect the right of the calling party to withhold the presentation of the identification of the line from which the call is being made and the right of the called party to reject calls from unidentified lines. There is justification for overriding the elimination of calling line identification presentation in specific cases. Certain subscribers, in particular help lines and similar organisations, have an interest in guaranteeing the anonymity of their callers. It is necessary, as regards connected line identification, to protect the right and the legitimate interest of the called party to withhold the presentation of the identification of the line to which the calling party is actually connected, in particular in the case of forwarded calls. The providers of publicly available electronic communications services should inform their subscribers of the existence of calling and connected line identification in the network and of all services which are offered on the basis of calling and connected line identification as well as the privacy options which are available. This will allow the subscribers to make an informed choice about the privacy facilities they may want to use. The privacy options which are offered on a per-line basis do not necessarily have to be available as an automatic network service but may be obtainable through a simple request to the provider of the publicly available electronic communications service.\n\n- (35) In digital mobile networks, location data giving the geographic position of the terminal equipment of the mobile user are processed to enable the transmission of communications. Such data are traffic data covered by Article 6 of this Directive. However, in addition, digital mobile networks may have the capacity to process location data which are more precise than is necessary for the transmission of communications and which are used for the provision of value added services such as services providing individualised traffic information and guidance to drivers. The processing of such data for value added services should only be allowed where subscribers have given their consent. Even in cases where subscribers have given their consent, they should have a simple means to temporarily deny the processing of location data, free of charge.\n\n- (36) Member States may restrict the users' and subscribers' rights to privacy with regard to calling line identification where this is necessary to trace nuisance calls and with regard to calling line identification and location data where this is necessary to allow emergency services to carry out their tasks as effectively as possible. For these purposes, Member States may adopt specific provisions to entitle providers of electronic communications services to provide access to calling line identification and location data without the prior consent of the users or subscribers concerned.\n\n- (37) Safeguards should be provided for subscribers against the nuisance which may be caused by automatic call forwarding by others. Moreover, in such cases, it must be possible for subscribers to stop the forwarded calls being passed on to their terminals by simple request to the provider of the publicly available electronic communications service.\n\n- (38) Directories of subscribers to electronic communications services are widely distributed and public. The right to privacy of natural persons and the legitimate interest of legal persons require that subscribers are able to determine whether their personal data are published in a directory and if so, which. Providers of public directories should inform the subscribers to be included in such directories of the purposes of the directory and of any particular usage which may be made of electronic versions of public directories especially through search functions embedded in the software, such as reverse search functions enabling users of the directory to discover the name and address of the subscriber on the basis of a telephone number only.\n\n- (39) The obligation to inform subscribers of the purpose(s) of public directories in which their personal data are to be included should be imposed on the party collecting the data for such inclusion. Where the data may be transmitted to one or more third parties, the subscriber should be informed of this possibility and of the recipient or the categories of possible recipients. Any transmission should be subject to the condition that the data may not be used for other purposes than those for which they were collected. If the party collecting the data from the subscriber or any third party to whom the data have been transmitted wishes to use the data for an additional purpose, the renewed consent of the subscriber is to be obtained either by the initial party collecting the data or by the third party to whom the data have been transmitted.\n\n- (40) Safeguards should be provided for subscribers against intrusion of their privacy by unsolicited communications for direct marketing purposes in particular by means of automated calling machines, telefaxes, and e-mails, including SMS messages. These forms of unsolicited commercial communications may on the one hand be relatively easy and cheap to send and on the other may impose a burden and/or cost on the recipient. Moreover, in some cases their volume may also cause difficulties for electronic communications networks and terminal equipment. For such forms of unsolicited communications for direct marketing, it is justified to require that prior explicit consent of the recipients is obtained before such communications are addressed to them. The single market requires a harmonised approach to ensure simple, Community-wide rules for businesses and users.\n\n- (41) Within the context of an existing customer relationship, it is reasonable to allow the use of electronic contact details for the offering of similar products or services, but only by the same company that has obtained the electronic contact details in accordance with Directive 95/46/EC. When electronic contact details are obtained, the customer should be informed about their further use for direct marketing in a clear and distinct manner, and be given the opportunity to refuse such usage. This opportunity should continue to be offered with each subsequent direct marketing message, free of charge, except for any costs for the transmission of this refusal.\n\n- (42) Other forms of direct marketing that are more costly for the sender and impose no financial costs on subscribers and users, such as person-to-person voice telephony calls, may justify the maintenance of a system giving subscribers or users the possibility to indicate that they do not want to receive such calls. Nevertheless, in order not to decrease existing levels of privacy protection, Member States should be entitled to uphold national systems, only allowing such calls to subscribers and users who have given their prior consent.\n\n- (43) To facilitate effective enforcement of Community rules on unsolicited messages for direct marketing, it is necessary to prohibit the use of false identities or false return addresses or numbers while sending unsolicited messages for direct marketing purposes.\n\n- (44) Certain electronic mail systems allow subscribers to view the sender and subject line of an electronic mail, and also to delete the message, without having to download the rest of the electronic mail's content or any attachments, thereby reducing costs which could arise from downloading unsolicited electronic mails or attachments. These arrangements may continue to be useful in certain cases as an additional tool to the general obligations established in this Directive.\n\n- (45) This Directive is without prejudice to the arrangements which Member States make to protect the legitimate interests of legal persons with regard to unsolicited communications for direct marketing purposes. Where Member States establish an opt-out register for such communications to legal persons, mostly business users, the provisions of Article 7 of Directive 2000/31/EC of the European Parliament and of the Council of 8 June 2000 on certain legal aspects of information society services, in particular electronic commerce, in the internal market (Directive on electronic commerce) are fully applicable.\n\n- (46) The functionalities for the provision of electronic communications services may be integrated in the network or in any part of the terminal equipment of the user, including the software. The protection of the personal data and the privacy of the user of publicly available electronic communications services should be independent of the configuration of the various components necessary to provide the service and of the distribution of the necessary functionalities between these components. Directive 95/46/EC covers any form of processing of personal data regardless of the technology used. The existence of specific rules for electronic communications services alongside general rules for other components necessary for the provision of such services may not facilitate the protection of personal data and privacy in a technologically neutral way. It may therefore be necessary to adopt measures requiring manufacturers of certain types of equipment used for electronic communications services to construct their product in such a way as to incorporate safeguards to ensure that the personal data and privacy of the user and subscriber are protected. The adoption of such measures in accordance with Directive 1999/5/EC of the European Parliament and of the Council of 9 March 1999 on radio equipment and telecommunications terminal equipment and the mutual recognition of their conformity will ensure that the introduction of technical features of electronic communication equipment including software for data protection purposes is harmonised in order to be compatible with the implementation of the internal market.\n\n- (47) Where the rights of the users and subscribers are not respected, national legislation should provide for judicial remedies. Penalties should be imposed on any person, whether governed by private or public law, who fails to comply with the national measures taken under this Directive.\n\n- (48) It is useful, in the field of application of this Directive, to draw on the experience of the Working Party on the Protection of Individuals with regard to the Processing of Personal Data composed of representatives of the supervisory authorities of the Member States, set up by Article 29 of Directive 95/46/EC.\n\n- (49) To facilitate compliance with the provisions of this Directive, certain specific arrangements are needed for processing of data already under way on the date that national implementing legislation pursuant to this Directive enters into force,\n\nHAVE ADOPTED THIS DIRECTIVE:\n\n## Enacting Terms\n\n### Article 1\n\n**Scope and aim**\n\n1. This Directive provides for the harmonisation of the national provisions required to ensure an equivalent level of protection of fundamental rights and freedoms, and in particular the right to privacy and confidentiality, with respect to the processing of personal data in the electronic communication sector and to ensure the free movement of such data and of electronic communication equipment and services in the Community.\n\n2. The provisions of this Directive particularise and complement Directive 95/46/EC for the purposes mentioned in paragraph 1. Moreover, they provide for protection of the legitimate interests of subscribers who are legal persons.\n\n3. This Directive shall not apply to activities which fall outside the scope of the Treaty establishing the European Community, such as those covered by Titles V and VI of the Treaty on European Union, and in any case to activities concerning public security, defence, State security (including the economic well-being of the State when the activities relate to State security matters) and the activities of the State in areas of criminal law.\n\n\n### Article 2\n\n**Definitions**\n\nSave as otherwise provided, the definitions in Directive 95/46/EC and in Directive 2002/21/EC of the European Parliament and of the Council of 7 March 2002 on a common regulatory framework for electronic communications networks and services (Framework Directive) ( 8 ) shall apply.\n\nThe following definitions shall also apply:\n\n- (a) ‘user’ means any natural person using a publicly available electronic communications service, for private or business purposes, without necessarily having subscribed to this service;\n- (b) ‘traffic data’ means any data processed for the purpose of the conveyance of a communication on an electronic communications network or for the billing thereof;\n- (c) ‘location data’ means any data processed in an electronic communications network or by an electronic communications service, indicating the geographic position of the terminal equipment of a user of a publicly available electronic communications service;\n- (d) ‘communication’ means any information exchanged or conveyed between a finite number of parties by means of a publicly available electronic communications service. This does not include any information conveyed as part of a broadcasting service to the public over an electronic communications network except to the extent that the information can be related to the identifiable subscriber or user receiving the information;\n- (f) ‘consent’ by a user or subscriber corresponds to the data subject's consent in Directive 95/46/EC;\n- (g) ‘value added service’ means any service which requires the processing of traffic data or location data other than traffic data beyond what is necessary for the transmission of a communication or the billing thereof;\n- (h) ‘electronic mail’ means any text, voice, sound or image message sent over a public communications network which can be stored in the network or in the recipient's terminal equipment until it is collected by the recipient;\n- (i) ‘personal data breach’ means a breach of security leading to the accidental or unlawful destruction, loss, alteration, unauthorised disclosure of, or access to, personal data transmitted, stored or otherwise processed in connection with the provision of a publicly available electronic communications service in the Community.\n\n### Article 3\n\n**Services concerned**\n\nThis Directive shall apply to the processing of personal data in connection with the provision of publicly available electronic communications services in public communications networks in the Community, including public communications networks supporting data collection and identification devices.\n\n\n### Article 4\n\n**Security of processing**\n\n1. The provider of a publicly available electronic communications service must take appropriate technical and organisational measures to safeguard security of its services, if necessary in conjunction with the provider of the public communications network with respect to network security. Having regard to the state of the art and the cost of their implementation, these measures shall ensure a level of security appropriate to the risk presented.\n\n- (1a) Without prejudice to Directive 95/46/EC, the measures referred to in paragraph 1 shall at least:\n   - — ensure that personal data can be accessed only by authorised personnel for legally authorised purposes,\n   - — protect personal data stored or transmitted against accidental or unlawful destruction, accidental loss or alteration, and unauthorised or unlawful storage, processing, access or disclosure, and,\n   - — ensure the implementation of a security policy with respect to the processing of personal data,\n\n   Relevant national authorities shall be able to audit the measures taken by providers of publicly available electronic communication services and to issue recommendations about best practices concerning the level of security which those measures should achieve.\n\n2. In case of a particular risk of a breach of the security of the network, the provider of a publicly available electronic communications service must inform the subscribers concerning such risk and, where the risk lies outside the scope of the measures to be taken by the service provider, of any possible remedies, including an indication of the likely costs involved.\n\n3. In the case of a personal data breach, the provider of publicly available electronic communications services shall, without undue delay, notify the personal data breach to the competent national authority. When the personal data breach is likely to adversely affect the personal data or privacy of a subscriber or individual, the provider shall also notify the subscriber or individual of the breach without undue delay. Notification of a personal data breach to a subscriber or individual concerned shall not be required if the provider has demonstrated to the satisfaction of the competent authority that it has implemented appropriate technological protection measures, and that those measures were applied to the data concerned by the security breach. Such technological protection measures shall render the data unintelligible to any person who is not authorised to access it. Without prejudice to the provider's obligation to notify subscribers and individuals concerned, if the provider has not already notified the subscriber or individual of the personal data breach, the competent national authority, having considered the likely adverse effects of the breach, may require it to do so. The notification to the subscriber or individual shall at least describe the nature of the personal data breach and the contact points where more information can be obtained, and shall recommend measures to mitigate the possible adverse effects of the personal data breach. The notification to the competent national authority shall, in addition, describe the consequences of, and the measures proposed or taken by the provider to address, the personal data breach.\n\n4. Subject to any technical implementing measures adopted under paragraph 5, the competent national authorities may adopt guidelines and, where necessary, issue instructions concerning the circumstances in which providers are required to notify personal data breaches, the format of such notification and the manner in which the notification is to be made. They shall also be able to audit whether providers have complied with their notification obligations under this paragraph, and shall impose appropriate sanctions in the event of a failure to do so. Providers shall maintain an inventory of personal data breaches comprising the facts surrounding the breach, its effects and the remedial action taken which shall be sufficient to enable the competent national authorities to verify compliance with the provisions of paragraph 3. The inventory shall only include the information necessary for this purpose.\n\n5. In order to ensure consistency in implementation of the measures referred to in paragraphs 2, 3 and 4, the Commission may, following consultation with the European Network and Information Security Agency (ENISA), the Working Party on the Protection of Individuals with regard to the Processing of Personal Data established by Article 29 of Directive 95/46/EC and the European Data Protection Supervisor, adopt technical implementing measures concerning the circumstances, format and procedures applicable to the information and notification requirements referred to in this Article. When adopting such measures, the Commission shall involve all relevant stakeholders particularly in order to be informed of the best available technical and economic means of implementation of this Article. Those measures, designed to amend non-essential elements of this Directive by supplementing it, shall be adopted in accordance with the regulatory procedure with scrutiny referred to in Article 14a(2).\n\n\n### Article 5\n\n**Confidentiality of the communications**\n\n1. Member States shall ensure the confidentiality of communications and the related traffic data by means of a public communications network and publicly available electronic communications services, through national legislation. In particular, they shall prohibit listening, tapping, storage or other kinds of interception or surveillance of communications and the related traffic data by persons other than users, without the consent of the users concerned, except when legally authorised to do so in accordance with Article 15(1). This paragraph shall not prevent technical storage which is necessary for the conveyance of a communication without prejudice to the principle of confidentiality.\n\n2. Paragraph 1 shall not affect any legally authorised recording of communications and the related traffic data when carried out in the course of lawful business practice for the purpose of providing evidence of a commercial transaction or of any other business communication.\n\n3. Member States shall ensure that the storing of information, or the gaining of access to information already stored, in the terminal equipment of a subscriber or user is only allowed on condition that the subscriber or user concerned has given his or her consent, having been provided with clear and comprehensive information, in accordance with Directive 95/46/EC, inter alia, about the purposes of the processing. This shall not prevent any technical storage or access for the sole purpose of carrying out the transmission of a communication over an electronic communications network, or as strictly necessary in order for the provider of an information society service explicitly requested by the subscriber or user to provide the service.\n\n\n### Article 6\n\n**Traffic data**\n\n1. Traffic data relating to subscribers and users processed and stored by the provider of a public communications network or publicly available electronic communications service must be erased or made anonymous when it is no longer needed for the purpose of the transmission of a communication without prejudice to paragraphs 2, 3 and 5 of this Article and Article 15(1).\n\n2. Traffic data necessary for the purposes of subscriber billing and interconnection payments may be processed. Such processing is permissible only up to the end of the period during which the bill may lawfully be challenged or payment pursued.\n\n3. For the purpose of marketing electronic communications services or for the provision of value added services, the provider of a publicly available electronic communications service may process the data referred to in paragraph 1 to the extent and for the duration necessary for such services or marketing, if the subscriber or user to whom the data relate has given his or her prior consent. Users or subscribers shall be given the possibility to withdraw their consent for the processing of traffic data at any time.\n\n4. The service provider must inform the subscriber or user of the types of traffic data which are processed and of the duration of such processing for the purposes mentioned in paragraph 2 and, prior to obtaining consent, for the purposes mentioned in paragraph 3.\n\n5. Processing of traffic data, in accordance with paragraphs 1, 2, 3 and 4, must be restricted to persons acting under the authority of providers of the public communications networks and publicly available electronic communications services handling billing or traffic management, customer enquiries, fraud detection, marketing electronic communications services or providing a value added service, and must be restricted to what is necessary for the purposes of such activities.\n\n6. Paragraphs 1, 2, 3 and 5 shall apply without prejudice to the possibility for competent bodies to be informed of traffic data in conformity with applicable legislation with a view to settling disputes, in particular interconnection or billing disputes.\n\n\n### Article 7\n\n**Itemised billing**\n\n1. Subscribers shall have the right to receive non-itemised bills.\n\n2. Member States shall apply national provisions in order to reconcile the rights of subscribers receiving itemised bills with the right to privacy of calling users and called subscribers, for example by ensuring that sufficient alternative privacy enhancing methods of communications or payments are available to such users and subscribers.\n\n\n### Article 8\n\n**Presentation and restriction of calling and connected line identification**\n\n1. Where presentation of calling line identification is offered, the service provider must offer the calling user the possibility, using a simple means and free of charge, of preventing the presentation of the calling line identification on a per-call basis. The calling subscriber must have this possibility on a per-line basis.\n\n2. Where presentation of calling line identification is offered, the service provider must offer the called subscriber the possibility, using a simple means and free of charge for reasonable use of this function, of preventing the presentation of the calling line identification of incoming calls.\n\n3. Where presentation of calling line identification is offered and where the calling line identification is presented prior to the call being established, the service provider must offer the called subscriber the possibility, using a simple means, of rejecting incoming calls where the presentation of the calling line identification has been prevented by the calling user or subscriber.\n\n4. Where presentation of connected line identification is offered, the service provider must offer the called subscriber the possibility, using a simple means and free of charge, of preventing the presentation of the connected line identification to the calling user.\n\n5. Paragraph 1 shall also apply with regard to calls to third countries originating in the Community. Paragraphs 2, 3 and 4 shall also apply to incoming calls originating in third countries.\n\n6. Member States shall ensure that where presentation of calling and/or connected line identification is offered, the providers of publicly available electronic communications services inform the public thereof and of the possibilities set out in paragraphs 1, 2, 3 and 4.\n\n\n### Article 9\n\n**Location data other than traffic data**\n\n1. Where location data other than traffic data, relating to users or subscribers of public communications networks or publicly available electronic communications services, can be processed, such data may only be processed when they are made anonymous, or with the consent of the users or subscribers to the extent and for the duration necessary for the provision of a value added service. The service provider must inform the users or subscribers, prior to obtaining their consent, of the type of location data other than traffic data which will be processed, of the purposes and duration of the processing and whether the data will be transmitted to a third party for the purpose of providing the value added service. Users or subscribers shall be given the possibility to withdraw their consent for the processing of location data other than traffic data at any time.\n\n2. Where consent of the users or subscribers has been obtained for the processing of location data other than traffic data, the user or subscriber must continue to have the possibility, using a simple means and free of charge, of temporarily refusing the processing of such data for each connection to the network or for each transmission of a communication.\n\n3. Processing of location data other than traffic data in accordance with paragraphs 1 and 2 must be restricted to persons acting under the authority of the provider of the public communications network or publicly available communications service or of the third party providing the value added service, and must be restricted to what is necessary for the purposes of providing the value added service.\n\n\n### Article 10\n\n**Exceptions**\n\nMember States shall ensure that there are transparent procedures governing the way in which a provider of a public communications network and/or a publicly available electronic communications service may override:\n\n- (a) the elimination of the presentation of calling line identification, on a temporary basis, upon application of a subscriber requesting the tracing of malicious or nuisance calls. In this case, in accordance with national law, the data containing the identification of the calling subscriber will be stored and be made available by the provider of a public communications network and/or publicly available electronic communications service;\n- (b) the elimination of the presentation of calling line identification and the temporary denial or absence of consent of a subscriber or user for the processing of location data, on a per-line basis for organisations dealing with emergency calls and recognised as such by a Member State, including law enforcement agencies, ambulance services and fire brigades, for the purpose of responding to such calls.\n\n### Article 11\n\n**Automatic call forwarding**\n\nMember States shall ensure that any subscriber has the possibility, using a simple means and free of charge, of stopping automatic call forwarding by a third party to the subscriber's terminal.\n\n\n### Article 12\n\n**Directories of subscribers**\n\n1. Member States shall ensure that subscribers are informed, free of charge and before they are included in the directory, about the purpose(s) of a printed or electronic directory of subscribers available to the public or obtainable through directory enquiry services, in which their personal data can be included and of any further usage possibilities based on search functions embedded in electronic versions of the directory.\n\n2. Member States shall ensure that subscribers are given the opportunity to determine whether their personal data are included in a public directory, and if so, which, to the extent that such data are relevant for the purpose of the directory as determined by the provider of the directory, and to verify, correct or withdraw such data. Not being included in a public subscriber directory, verifying, correcting or withdrawing personal data from it shall be free of charge.\n\n3. Member States may require that for any purpose of a public directory other than the search of contact details of persons on the basis of their name and, where necessary, a minimum of other identifiers, additional consent be asked of the subscribers.\n\n4. Paragraphs 1 and 2 shall apply to subscribers who are natural persons. Member States shall also ensure, in the framework of Community law and applicable national legislation, that the legitimate interests of subscribers other than natural persons with regard to their entry in public directories are sufficiently protected.\n\n\n### Article 13\n\n**Unsolicited communications**\n\n1. The use of automated calling and communication systems without human intervention (automatic calling machines), facsimile machines (fax) or electronic mail for the purposes of direct marketing may be allowed only in respect of subscribers or users who have given their prior consent.\n\n2. Notwithstanding paragraph 1, where a natural or legal person obtains from its customers their electronic contact details for electronic mail, in the context of the sale of a product or a service, in accordance with Directive 95/46/EC, the same natural or legal person may use these electronic contact details for direct marketing of its own similar products or services provided that customers clearly and distinctly are given the opportunity to object, free of charge and in an easy manner, to such use of electronic contact details at the time of their collection and on the occasion of each message in case the customer has not initially refused such use.\n\n3. Member States shall take appropriate measures to ensure that unsolicited communications for the purposes of direct marketing, in cases other than those referred to in paragraphs 1 and 2, are not allowed either without the consent of the subscribers or users concerned or in respect of subscribers or users who do not wish to receive these communications, the choice between these options to be determined by national legislation, taking into account that both options must be free of charge for the subscriber or user.\n\n4. In any event, the practice of sending electronic mail for the purposes of direct marketing which disguise or conceal the identity of the sender on whose behalf the communication is made, which contravene Article 6 of Directive 2000/31/EC, which do not have a valid address to which the recipient may send a request that such communications cease or which encourage recipients to visit websites that contravene that Article shall be prohibited.\n\n5. Paragraphs 1 and 3 shall apply to subscribers who are natural persons. Member States shall also ensure, in the framework of Community law and applicable national legislation, that the legitimate interests of subscribers other than natural persons with regard to unsolicited communications are sufficiently protected.\n\n6. Without prejudice to any administrative remedy for which provision may be made, inter alia, under Article 15a(2), Member States shall ensure that any natural or legal person adversely affected by infringements of national provisions adopted pursuant to this Article and therefore having a legitimate interest in the cessation or prohibition of such infringements, including an electronic communications service provider protecting its legitimate business interests, may bring legal proceedings in respect of such infringements. Member States may also lay down specific rules on penalties applicable to providers of electronic communications services which by their negligence contribute to infringements of national provisions adopted pursuant to this Article.\n\n\n### Article 14\n\n**Technical features and standardisation**\n\n1. In implementing the provisions of this Directive, Member States shall ensure, subject to paragraphs 2 and 3, that no mandatory requirements for specific technical features are imposed on terminal or other electronic communication equipment which could impede the placing of equipment on the market and the free circulation of such equipment in and between Member States.\n\n2. Where provisions of this Directive can be implemented only by requiring specific technical features in electronic communications networks, Member States shall inform the Commission in accordance with the procedure provided for by Directive 98/34/EC of the European Parliament and of the Council of 22 June 1998 laying down a procedure for the provision of information in the field of technical standards and regulations and of rules on information society services ( 9 ).\n\n3. Where required, measures may be adopted to ensure that terminal equipment is constructed in a way that is compatible with the right of users to protect and control the use of their personal data, in accordance with Directive 1999/5/EC and Council Decision 87/95/EEC of 22 December 1986 on standardisation in the field of information technology and communications ( 10 ).\n\n\n### Article 14a\n\n**Committee procedure**\n\n1. The Commission shall be assisted by the Communications Committee established by Article 22 of Directive 2002/21/EC (Framework Directive).\n\n2. Where reference is made to this paragraph, Article 5a(1) to (4) and Article 7 of Decision 1999/468/EC shall apply, having regard to the provisions of Article 8 thereof.\n\n3. Where reference is made to this paragraph, Article 5a(1), (2), (4) and (6) and Article 7 of Decision 1999/468/EC shall apply, having regard to the provisions of Article 8 thereof.\n\n\n### Article 15\n\n**Application of certain provisions of Directive 95/46/EC**\n\n1. Member States may adopt legislative measures to restrict the scope of the rights and obligations provided for in Article 5, Article 6, Article 8(1), (2), (3) and (4), and Article 9 of this Directive when such restriction constitutes a necessary, appropriate and proportionate measure within a democratic society to safeguard national security (i.e. State security), defence, public security, and the prevention, investigation, detection and prosecution of criminal offences or of unauthorised use of the electronic communication system, as referred to in Article 13(1) of Directive 95/46/EC. To this end, Member States may, inter alia, adopt legislative measures providing for the retention of data for a limited period justified on the grounds laid down in this paragraph. All the measures referred to in this paragraph shall be in accordance with the general principles of Community law, including those referred to in Article 6(1) and (2) of the Treaty on European Union.\n\n- (1a) Paragraph 1 shall not apply to data specifically required by Directive 2006/24/EC of the European Parliament and of the Council of 15 March 2006 on the retention of data generated or processed in connection with the provision of publicly available electronic communications services or of public communications networks ( 11 ) to be retained for the purposes referred to in Article 1(1) of that Directive.\n\n- (1b) Providers shall establish internal procedures for responding to requests for access to users' personal data based on national provisions adopted pursuant to paragraph 1. They shall provide the competent national authority, on demand, with information about those procedures, the number of requests received, the legal justification invoked and their response.\n\n2. The provisions of Chapter III on judicial remedies, liability and sanctions of Directive 95/46/EC shall apply with regard to national provisions adopted pursuant to this Directive and with regard to the individual rights derived from this Directive.\n\n3. The Working Party on the Protection of Individuals with regard to the Processing of Personal Data instituted by Article 29 of Directive 95/46/EC shall also carry out the tasks laid down in Article 30 of that Directive with regard to matters covered by this Directive, namely the protection of fundamental rights and freedoms and of legitimate interests in the electronic communications sector.\n\n\n### Article 15a\n\n**Implementation and enforcement**\n\n1. Member States shall lay down the rules on penalties, including criminal sanctions where appropriate, applicable to infringements of the national provisions adopted pursuant to this Directive and shall take all measures necessary to ensure that they are implemented. The penalties provided for must be effective, proportionate and dissuasive and may be applied to cover the period of any breach, even where the breach has subsequently been rectified. The Member States shall notify those provisions to the Commission by 25 May 2011, and shall notify it without delay of any subsequent amendment affecting them.\n\n2. Without prejudice to any judicial remedy which might be available, Member States shall ensure that the competent national authority and, where relevant, other national bodies have the power to order the cessation of the infringements referred to in paragraph 1.\n\n3. Member States shall ensure that the competent national authority and, where relevant, other national bodies have the necessary investigative powers and resources, including the power to obtain any relevant information they might need to monitor and enforce national provisions adopted pursuant to this Directive.\n\n4. The relevant national regulatory authorities may adopt measures to ensure effective cross-border cooperation in the enforcement of the national laws adopted pursuant to this Directive and to create harmonised conditions for the provision of services involving cross-border data flows. The national regulatory authorities shall provide the Commission, in good time before adopting any such measures, with a summary of the grounds for action, the envisaged measures and the proposed course of action. The Commission may, having examined such information and consulted ENISA and the Working Party on the Protection of Individuals with regard to the Processing of Personal Data established by Article 29 of Directive 95/46/EC, make comments or recommendations thereupon, in particular to ensure that the envisaged measures do not adversely affect the functioning of the internal market. National regulatory authorities shall take the utmost account of the Commission's comments or recommendations when deciding on the measures.\n\n\n### Article 16\n\n**Transitional arrangements**\n\n1. Article 12 shall not apply to editions of directories already produced or placed on the market in printed or off-line electronic form before the national provisions adopted pursuant to this Directive enter into force.\n\n2. Where the personal data of subscribers to fixed or mobile public voice telephony services have been included in a public subscriber directory in conformity with the provisions of Directive 95/46/EC and of Article 11 of Directive 97/66/EC before the national provisions adopted in pursuance of this Directive enter into force, the personal data of such subscribers may remain included in this public directory in its printed or electronic versions, including versions with reverse search functions, unless subscribers indicate otherwise, after having received complete information about purposes and options in accordance with Article 12 of this Directive.\n\n\n### Article 17\n\n**Transposition**\n\n1. Before 31 October 2003 Member States shall bring into force the provisions necessary to comply with this Directive. They shall forthwith inform the Commission thereof.\n\n   When Member States adopt those provisions, they shall contain a reference to this Directive or be accompanied by such a reference on the occasion of their official publication. The methods of making such reference shall be laid down by the Member States.\n\n2. Member States shall communicate to the Commission the text of the provisions of national law which they adopt in the field governed by this Directive and of any subsequent amendments to those provisions.\n\n\n### Article 18\n\n**Review**\n\nThe Commission shall submit to the European Parliament and the Council, not later than three years after the date referred to in Article 17(1), a report on the application of this Directive and its impact on economic operators and consumers, in particular as regards the provisions on unsolicited communications, taking into account the international environment. For this purpose, the Commission may request information from the Member States, which shall be supplied without undue delay. Where appropriate, the Commission shall submit proposals to amend this Directive, taking account of the results of that report, any changes in the sector and any other proposal it may deem necessary in order to improve the effectiveness of this Directive.\n\n\n### Article 19\n\n**Repeal**\n\nDirective 97/66/EC is hereby repealed with effect from the date referred to in Article 17(1).\n\nReferences made to the repealed Directive shall be construed as being made to this Directive.\n\n\n### Article 20\n\n**Entry into force**\n\nThis Directive shall enter into force on the day of its publication in the Official Journal of the European Communities.\n\n\n### Article 21\n\n**Addressees**\n\nThis Directive is addressed to the Member States.\n\n",
  "contentHtml": "<p><em>of 12 July 2002</em></p>\n<p><em>concerning the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and the protection of privacy in the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> sector (Directive on privacy and electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>)</em></p>\n<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EUROPEAN UNION,</p>\n<p>Having regard to the Treaty establishing the European Community, and in particular Article 95 thereof,</p>\n<p>Having regard to the proposal from the Commission,</p>\n<p>Having regard to the opinion of the Economic and Social Committee,</p>\n<p>Having consulted the Committee of the Regions,</p>\n<p>Acting in accordance with the procedure laid down in Article 251 of the Treaty,</p>\n<p>Whereas:</p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and on the free movement of such data requires Member States to ensure the rights and freedoms of natural persons with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span>, and in particular their right to privacy, in order to ensure the free flow of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> in the Community.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) This Directive seeks to respect the fundamental rights and observes the principles recognised in particular by the Charter of fundamental rights of the European Union. In particular, this Directive seeks to ensure full respect for the rights set out in Articles 7 and 8 of that Charter.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) Confidentiality of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> is guaranteed in accordance with the international instruments relating to human rights, in particular the European Convention for the Protection of Human Rights and Fundamental Freedoms, and the constitutions of the Member States.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) Directive 97/66/EC of the European Parliament and of the Council of 15 December 1997 concerning the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and the protection of privacy in the telecommunications sector translated the principles set out in Directive 95/46/EC into specific rules for the telecommunications sector. Directive 97/66/EC has to be adapted to developments in the markets and technologies for <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> in order to provide an equal level of protection of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and privacy for <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>, regardless of the technologies used. That Directive should therefore be repealed and replaced by this Directive.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) New advanced digital technologies are currently being introduced in public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks in the Community, which give rise to specific requirements concerning the protection of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and privacy of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>. The development of the information society is characterised by the introduction of new <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>. Access to digital mobile networks has become available and affordable for a large public. These digital networks have large capacities and possibilities for <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span>. The successful cross-border development of these services is partly dependent on the confidence of <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> that their privacy will not be at <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span>.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) The Internet is overturning traditional market structures by providing a common, global infrastructure for the delivery of a wide range of <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>. Publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> over the Internet open new possibilities for <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> but also new <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> for their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and privacy.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) In the case of public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks, specific legal, regulatory and technical provisions should be made in order to protect fundamental rights and freedoms of natural persons and legitimate interests of legal persons, in particular with regard to the increasing capacity for automated storage and <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of data relating to subscribers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) Legal, regulatory and technical provisions adopted by the Member States concerning the protection of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span>, privacy and the legitimate interest of legal persons, in the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> sector, should be harmonised in order to avoid obstacles to the internal market for electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> in accordance with Article 14 of the Treaty. Harmonisation should be limited to requirements necessary to guarantee that the promotion and development of new <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> and networks between Member States are not hindered.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) The Member States, providers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> concerned, together with the competent Community bodies, should cooperate in introducing and developing the relevant technologies where this is necessary to apply the guarantees provided for by this Directive and taking particular account of the objectives of minimising the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and of using anonymous or pseudonymous data where possible.</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) In the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> sector, Directive 95/46/EC applies in particular to all matters concerning protection of fundamental rights and freedoms, which are not specifically covered by the provisions of this Directive, including the obligations on the <span class=\"term-link\" data-term-id=\"controller\" tabindex=\"0\">controller</span> and the rights of individuals. Directive 95/46/EC applies to non-public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> services.</p>\n</li>\n<li id=\"recital-11\" data-recital=\"11\" class=\"linkable-recital\">\n<p>(11) Like Directive 95/46/EC, this Directive does not address issues of protection of fundamental rights and freedoms related to activities which are not governed by Community law. Therefore it does not alter the existing balance between the individual's right to privacy and the possibility for Member States to take the measures referred to in Article 15(1) of this Directive, necessary for the protection of public security, defence, State security (including the economic well-being of the State when the activities relate to State security matters) and the enforcement of criminal law. Consequently, this Directive does not affect the ability of Member States to carry out lawful interception of electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>, or take other measures, if necessary for any of these purposes and in accordance with the European Convention for the Protection of Human Rights and Fundamental Freedoms, as interpreted by the rulings of the European Court of Human Rights. Such measures must be appropriate, strictly proportionate to the intended purpose and necessary within a democratic society and should be subject to adequate safeguards in accordance with the European Convention for the Protection of Human Rights and Fundamental Freedoms.</p>\n</li>\n<li id=\"recital-12\" data-recital=\"12\" class=\"linkable-recital\">\n<p>(12) Subscribers to a publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> may be natural or legal persons. By supplementing Directive 95/46/EC, this Directive is aimed at protecting the fundamental rights of natural persons and particularly their right to privacy, as well as the legitimate interests of legal persons. This Directive does not entail an obligation for Member States to extend the application of Directive 95/46/EC to the protection of the legitimate interests of legal persons, which is ensured within the framework of the applicable Community and national legislation.</p>\n</li>\n<li id=\"recital-13\" data-recital=\"13\" class=\"linkable-recital\">\n<p>(13) The contractual relation between a subscriber and a service provider may entail a periodic or a one-off payment for the service provided or to be provided. Prepaid cards are also considered as a contract.</p>\n</li>\n<li id=\"recital-14\" data-recital=\"14\" class=\"linkable-recital\">\n<p>(14) <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">Location data</span> may refer to the latitude, longitude and altitude of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>'s terminal equipment, to the direction of travel, to the level of accuracy of the location information, to the identification of the network cell in which the terminal equipment is located at a certain point in time and to the time the location information was recorded.</p>\n</li>\n<li id=\"recital-15\" data-recital=\"15\" class=\"linkable-recital\">\n<p>(15) A <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> may include any naming, numbering or addressing information provided by the sender of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> or the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> of a connection to carry out the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>. <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span> may include any translation of this information by the network over which the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> is transmitted for the purpose of carrying out the transmission. <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span> may, inter alia, consist of data referring to the routing, duration, time or volume of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>, to the protocol used, to the location of the terminal equipment of the sender or <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span>, to the network on which the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> originates or terminates, to the beginning, end or duration of a connection. They may also consist of the format in which the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> is conveyed by the network.</p>\n</li>\n<li id=\"recital-16\" data-recital=\"16\" class=\"linkable-recital\">\n<p>(16) Information that is part of a broadcasting service provided over a public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network is intended for a potentially unlimited audience and does not constitute a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> in the sense of this Directive. However, in cases where the individual subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> receiving such information can be identified, for example with video-on-demand services, the information conveyed is covered within the meaning of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> for the purposes of this Directive.</p>\n</li>\n<li id=\"recital-17\" data-recital=\"17\" class=\"linkable-recital\">\n<p>(17) For the purposes of this Directive, consent of a <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> or subscriber, regardless of whether the latter is a natural or a legal person, should have the same meaning as the data subject's consent as defined and further specified in Directive 95/46/EC. Consent may be given by any appropriate method enabling a freely given specific and informed indication of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>'s wishes, including by ticking a box when visiting an Internet website.</p>\n</li>\n<li id=\"recital-18\" data-recital=\"18\" class=\"linkable-recital\">\n<p>(18) <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">Value added services</span> may, for example, consist of advice on least expensive tariff packages, route guidance, traffic information, weather forecasts and tourist information.</p>\n</li>\n<li id=\"recital-19\" data-recital=\"19\" class=\"linkable-recital\">\n<p>(19) The application of certain requirements relating to presentation and restriction of calling and connected line identification and to automatic call forwarding to subscriber lines connected to analogue exchanges should not be made mandatory in specific cases where such application would prove to be technically impossible or would require a disproportionate economic effort. It is important for interested parties to be informed of such cases and the Member States should therefore notify them to the Commission.</p>\n</li>\n<li id=\"recital-20\" data-recital=\"20\" class=\"linkable-recital\">\n<p>(20) Service providers should take appropriate measures to safeguard the security of their services, if necessary in conjunction with the provider of the network, and inform subscribers of any special <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> of a breach of the security of the network. Such <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> may especially occur for <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> over an open network such as the Internet or analogue mobile telephony. It is particularly important for subscribers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> of such services to be fully informed by their service provider of the existing security <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> which lie outside the scope of possible remedies by the service provider. Service providers who offer publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> over the Internet should inform <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> and subscribers of measures they can take to protect the security of their <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> for instance by using specific types of software or encryption technologies. The requirement to inform subscribers of particular security <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> does not discharge a service provider from the obligation to take, at its own costs, appropriate and immediate measures to remedy any new, unforeseen security <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> and restore the normal security level of the service. The provision of information about security <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> to the subscriber should be free of charge except for any nominal costs which the subscriber may incur while receiving or collecting the information, for instance by downloading an <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span> message. Security is appraised in the light of Article 17 of Directive 95/46/EC.</p>\n</li>\n<li id=\"recital-21\" data-recital=\"21\" class=\"linkable-recital\">\n<p>(21) Measures should be taken to prevent unauthorised access to <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> in order to protect the confidentiality of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>, including both the contents and any data related to such <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>, by means of public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks and publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>. National legislation in some Member States only prohibits intentional unauthorised access to <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>.</p>\n</li>\n<li id=\"recital-22\" data-recital=\"22\" class=\"linkable-recital\">\n<p>(22) The prohibition of storage of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> and the related <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> by persons other than the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> or without their consent is not intended to prohibit any automatic, intermediate and transient storage of this information in so far as this takes place for the sole purpose of carrying out the transmission in the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network and provided that the information is not stored for any period longer than is necessary for the transmission and for traffic management purposes, and that during the period of storage the confidentiality remains guaranteed. Where this is necessary for making more efficient the onward transmission of any publicly accessible information to other <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipients</span> of the service upon their request, this Directive should not prevent such information from being further stored, provided that this information would in any case be accessible to the public without restriction and that any data referring to the individual subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> requesting such information are erased.</p>\n</li>\n<li id=\"recital-23\" data-recital=\"23\" class=\"linkable-recital\">\n<p>(23) Confidentiality of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> should also be ensured in the course of lawful business practice. Where necessary and legally authorised, <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> can be recorded for the purpose of providing evidence of a commercial transaction. Directive 95/46/EC applies to such <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span>. Parties to the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> should be informed prior to the recording about the recording, its purpose and the duration of its storage. The recorded <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> should be erased as soon as possible and in any case at the latest by the end of the period during which the transaction can be lawfully challenged.</p>\n</li>\n<li id=\"recital-24\" data-recital=\"24\" class=\"linkable-recital\">\n<p>(24) Terminal equipment of <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> of electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks and any information stored on such equipment are part of the private sphere of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> requiring protection under the European Convention for the Protection of Human Rights and Fundamental Freedoms. So-called spyware, web bugs, hidden identifiers and other similar devices can enter the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>'s terminal without their knowledge in order to gain access to information, to store hidden information or to trace the activities of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> and may seriously intrude upon the privacy of these <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>. The use of such devices should be allowed only for legitimate purposes, with the knowledge of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> concerned.</p>\n</li>\n<li id=\"recital-25\" data-recital=\"25\" class=\"linkable-recital\">\n<p>(25) However, such devices, for instance so-called \"cookies\", can be a legitimate and useful tool, for example, in analysing the effectiveness of website design and advertising, and in verifying the identity of <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> engaged in on-line transactions. Where such devices, for instance cookies, are intended for a legitimate purpose, such as to facilitate the provision of <span class=\"term-link\" data-term-id=\"information-society-service\" tabindex=\"0\">information society services</span>, their use should be allowed on condition that <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> are provided with clear and precise information in accordance with Directive 95/46/EC about the purposes of cookies or similar devices so as to ensure that <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> are made aware of information being placed on the terminal equipment they are using. <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">Users</span> should have the opportunity to refuse to have a cookie or similar device stored on their terminal equipment. This is particularly important where <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> other than the original <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> have access to the terminal equipment and thereby to any data containing privacy-sensitive information stored on such equipment. Information and the right to refuse may be offered once for the use of various devices to be installed on the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>'s terminal equipment during the same connection and also covering any further use that may be made of those devices during subsequent connections. The methods for giving information, offering a right to refuse or requesting consent should be made as <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly as possible. Access to specific website content may still be made conditional on the well-informed acceptance of a cookie or similar device, if it is used for a legitimate purpose.</p>\n</li>\n<li id=\"recital-26\" data-recital=\"26\" class=\"linkable-recital\">\n<p>(26) The data relating to subscribers processed within electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks to establish connections and to transmit information contain information on the private life of natural persons and concern the right to respect for their correspondence or concern the legitimate interests of legal persons. Such data may only be stored to the extent that is necessary for the provision of the service for the purpose of billing and for interconnection payments, and for a limited time. Any further <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of such data which the provider of the publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> may want to perform, for the marketing of <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> or for the provision of <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span>, may only be allowed if the subscriber has agreed to this on the basis of accurate and full information given by the provider of the publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> about the types of further <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> it intends to perform and about the subscriber's right not to give or to withdraw his/her consent to such <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span>. <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span> used for marketing <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> services or for the provision of <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span> should also be erased or made anonymous after the provision of the service. Service providers should always keep subscribers informed of the types of data they are <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> and the purposes and duration for which this is done.</p>\n</li>\n<li id=\"recital-27\" data-recital=\"27\" class=\"linkable-recital\">\n<p>(27) The exact moment of the completion of the transmission of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>, after which <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> should be erased except for billing purposes, may depend on the type of <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> that is provided. For instance for a voice telephony call the transmission will be completed as soon as either of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> terminates the connection. For <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span> the transmission is completed as soon as the addressee collects the message, typically from the server of his service provider.</p>\n</li>\n<li id=\"recital-28\" data-recital=\"28\" class=\"linkable-recital\">\n<p>(28) The obligation to erase <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> or to make such data anonymous when it is no longer needed for the purpose of the transmission of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> does not conflict with such procedures on the Internet as the caching in the domain name system of IP addresses or the caching of IP addresses to physical address bindings or the use of log-in information to control the right of access to networks or services.</p>\n</li>\n<li id=\"recital-29\" data-recital=\"29\" class=\"linkable-recital\">\n<p>(29) The service provider may process <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> relating to subscribers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> where necessary in individual cases in order to detect technical failure or errors in the transmission of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>. <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span> necessary for billing purposes may also be processed by the provider in order to detect and stop fraud consisting of unpaid use of the <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span>.</p>\n</li>\n<li id=\"recital-30\" data-recital=\"30\" class=\"linkable-recital\">\n<p>(30) Systems for the provision of electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks and services should be designed to limit the amount of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> necessary to a strict minimum. Any activities related to the provision of the <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> that go beyond the transmission of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> and the billing thereof should be based on aggregated, <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> that cannot be related to subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>. Where such activities cannot be based on aggregated data, they should be considered as <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span> for which the consent of the subscriber is required.</p>\n</li>\n<li id=\"recital-31\" data-recital=\"31\" class=\"linkable-recital\">\n<p>(31) Whether the consent to be obtained for the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> with a view to providing a particular <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span> should be that of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> or of the subscriber, will depend on the data to be processed and on the type of service to be provided and on whether it is technically, procedurally and contractually possible to distinguish the individual using an <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> from the legal or natural person having subscribed to it.</p>\n</li>\n<li id=\"recital-32\" data-recital=\"32\" class=\"linkable-recital\">\n<p>(32) Where the provider of an <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> or of a <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span> subcontracts the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> necessary for the provision of these services to another <span class=\"term-link\" data-term-id=\"entity\" tabindex=\"0\">entity</span>, such subcontracting and subsequent data <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> should be in full compliance with the requirements regarding <span class=\"term-link\" data-term-id=\"controller\" tabindex=\"0\">controllers</span> and <span class=\"term-link\" data-term-id=\"processor\" tabindex=\"0\">processors</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> as set out in Directive 95/46/EC. Where the provision of a <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span> requires that traffic or <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> are forwarded from an <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> provider to a provider of <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span>, the subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> to whom the data are related should also be fully informed of this forwarding before giving their consent for the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of the data.</p>\n</li>\n<li id=\"recital-33\" data-recital=\"33\" class=\"linkable-recital\">\n<p>(33) The introduction of itemised bills has improved the possibilities for the subscriber to check the accuracy of the fees charged by the service provider but, at the same time, it may jeopardise the privacy of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>. Therefore, in order to preserve the privacy of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>, Member States should encourage the development of electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> service options such as alternative payment facilities which allow anonymous or strictly private access to publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>, for example calling cards and facilities for payment by credit card. To the same end, Member States may ask the operators to offer their subscribers a different type of detailed bill in which a certain number of digits of the called number have been deleted.</p>\n</li>\n<li id=\"recital-34\" data-recital=\"34\" class=\"linkable-recital\">\n<p>(34) It is necessary, as regards calling line identification, to protect the right of the calling party to withhold the presentation of the identification of the line from which the call is being made and the right of the called party to reject calls from unidentified lines. There is justification for overriding the elimination of calling line identification presentation in specific cases. Certain subscribers, in particular help lines and similar organisations, have an interest in guaranteeing the anonymity of their callers. It is necessary, as regards connected line identification, to protect the right and the legitimate interest of the called party to withhold the presentation of the identification of the line to which the calling party is actually connected, in particular in the case of forwarded calls. The providers of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> should inform their subscribers of the existence of calling and connected line identification in the network and of all services which are offered on the basis of calling and connected line identification as well as the privacy options which are available. This will allow the subscribers to make an informed choice about the privacy facilities they may want to use. The privacy options which are offered on a per-line basis do not necessarily have to be available as an automatic network service but may be obtainable through a simple request to the provider of the publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span>.</p>\n</li>\n<li id=\"recital-35\" data-recital=\"35\" class=\"linkable-recital\">\n<p>(35) In digital mobile networks, <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> giving the geographic position of the terminal equipment of the mobile <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> are processed to enable the transmission of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>. Such data are <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> covered by Article 6 of this Directive. However, in addition, digital mobile networks may have the capacity to process <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> which are more precise than is necessary for the transmission of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> and which are used for the provision of <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span> such as services providing individualised traffic information and guidance to drivers. The <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of such data for <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span> should only be allowed where subscribers have given their consent. Even in cases where subscribers have given their consent, they should have a simple means to temporarily deny the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span>, free of charge.</p>\n</li>\n<li id=\"recital-36\" data-recital=\"36\" class=\"linkable-recital\">\n<p>(36) Member States may restrict the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>' and subscribers' rights to privacy with regard to calling line identification where this is necessary to trace nuisance calls and with regard to calling line identification and <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> where this is necessary to allow emergency services to carry out their tasks as effectively as possible. For these purposes, Member States may adopt specific provisions to entitle providers of <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> to provide access to calling line identification and <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> without the prior consent of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> or subscribers concerned.</p>\n</li>\n<li id=\"recital-37\" data-recital=\"37\" class=\"linkable-recital\">\n<p>(37) Safeguards should be provided for subscribers against the nuisance which may be caused by automatic call forwarding by others. Moreover, in such cases, it must be possible for subscribers to stop the forwarded calls being passed on to their terminals by simple request to the provider of the publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span>.</p>\n</li>\n<li id=\"recital-38\" data-recital=\"38\" class=\"linkable-recital\">\n<p>(38) Directories of subscribers to <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> are widely distributed and public. The right to privacy of natural persons and the legitimate interest of legal persons require that subscribers are able to determine whether their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> are published in a directory and if so, which. Providers of public directories should inform the subscribers to be included in such directories of the purposes of the directory and of any particular usage which may be made of electronic versions of public directories especially through search functions embedded in the software, such as reverse search functions enabling <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> of the directory to discover the name and address of the subscriber on the basis of a telephone number only.</p>\n</li>\n<li id=\"recital-39\" data-recital=\"39\" class=\"linkable-recital\">\n<p>(39) The obligation to inform subscribers of the purpose(s) of public directories in which their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> are to be included should be imposed on the party collecting the data for such inclusion. Where the data may be transmitted to one or more <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third parties</span>, the subscriber should be informed of this possibility and of the <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span> or the categories of possible <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipients</span>. Any transmission should be subject to the condition that the data may not be used for other purposes than those for which they were collected. If the party collecting the data from the subscriber or any <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third party</span> to whom the data have been transmitted wishes to use the data for an additional purpose, the renewed consent of the subscriber is to be obtained either by the initial party collecting the data or by the <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third party</span> to whom the data have been transmitted.</p>\n</li>\n<li id=\"recital-40\" data-recital=\"40\" class=\"linkable-recital\">\n<p>(40) Safeguards should be provided for subscribers against intrusion of their privacy by unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> for direct marketing purposes in particular by means of automated calling machines, telefaxes, and e-mails, including SMS messages. These forms of unsolicited commercial <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> may on the one hand be relatively easy and cheap to send and on the other may impose a burden and/or cost on the <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span>. Moreover, in some cases their volume may also cause difficulties for electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks and terminal equipment. For such forms of unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> for direct marketing, it is justified to require that prior explicit consent of the <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipients</span> is obtained before such <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> are addressed to them. The single market requires a harmonised approach to ensure simple, Community-wide rules for businesses and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>.</p>\n</li>\n<li id=\"recital-41\" data-recital=\"41\" class=\"linkable-recital\">\n<p>(41) Within the context of an existing customer relationship, it is reasonable to allow the use of electronic contact details for the offering of similar <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> or services, but only by the same company that has obtained the electronic contact details in accordance with Directive 95/46/EC. When electronic contact details are obtained, the customer should be informed about their further use for direct marketing in a clear and distinct manner, and be given the opportunity to refuse such usage. This opportunity should continue to be offered with each subsequent direct marketing message, free of charge, except for any costs for the transmission of this refusal.</p>\n</li>\n<li id=\"recital-42\" data-recital=\"42\" class=\"linkable-recital\">\n<p>(42) Other forms of direct marketing that are more costly for the sender and impose no financial costs on subscribers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>, such as person-to-person voice telephony calls, may justify the maintenance of a system giving subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> the possibility to indicate that they do not want to receive such calls. Nevertheless, in order not to decrease existing levels of privacy protection, Member States should be entitled to uphold national systems, only allowing such calls to subscribers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> who have given their prior consent.</p>\n</li>\n<li id=\"recital-43\" data-recital=\"43\" class=\"linkable-recital\">\n<p>(43) To facilitate effective enforcement of Community rules on unsolicited messages for direct marketing, it is necessary to prohibit the use of false identities or false return addresses or numbers while sending unsolicited messages for direct marketing purposes.</p>\n</li>\n<li id=\"recital-44\" data-recital=\"44\" class=\"linkable-recital\">\n<p>(44) Certain <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span> systems allow subscribers to view the sender and subject line of an <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span>, and also to delete the message, without having to download the rest of the <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span>'s content or any attachments, thereby reducing costs which could arise from downloading unsolicited <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mails</span> or attachments. These arrangements may continue to be useful in certain cases as an additional tool to the general obligations established in this Directive.</p>\n</li>\n<li id=\"recital-45\" data-recital=\"45\" class=\"linkable-recital\">\n<p>(45) This Directive is without prejudice to the arrangements which Member States make to protect the legitimate interests of legal persons with regard to unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> for direct marketing purposes. Where Member States establish an opt-out register for such <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> to legal persons, mostly business <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>, the provisions of Article 7 of Directive 2000/31/EC of the European Parliament and of the Council of 8 June 2000 on certain legal aspects of <span class=\"term-link\" data-term-id=\"information-society-service\" tabindex=\"0\">information society services</span>, in particular electronic commerce, in the internal market (Directive on electronic commerce) are fully applicable.</p>\n</li>\n<li id=\"recital-46\" data-recital=\"46\" class=\"linkable-recital\">\n<p>(46) The functionalities for the provision of <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> may be integrated in the network or in any part of the terminal equipment of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>, including the software. The protection of the <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and the privacy of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> should be independent of the configuration of the various components necessary to provide the service and of the distribution of the necessary functionalities between these components. Directive 95/46/EC covers any form of <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> regardless of the technology used. The existence of specific rules for <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> alongside general rules for other components necessary for the provision of such services may not facilitate the protection of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and privacy in a technologically neutral way. It may therefore be necessary to adopt measures requiring <span class=\"term-link\" data-term-id=\"manufacturer\" tabindex=\"0\">manufacturers</span> of certain types of equipment used for <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> to construct their <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> in such a way as to incorporate safeguards to ensure that the <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and privacy of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> and subscriber are protected. The adoption of such measures in accordance with Directive 1999/5/EC of the European Parliament and of the Council of 9 March 1999 on radio equipment and telecommunications terminal equipment and the mutual recognition of their conformity will ensure that the introduction of technical features of electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> equipment including software for data protection purposes is harmonised in order to be compatible with the implementation of the internal market.</p>\n</li>\n<li id=\"recital-47\" data-recital=\"47\" class=\"linkable-recital\">\n<p>(47) Where the rights of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> and subscribers are not respected, national legislation should provide for judicial remedies. Penalties should be imposed on any person, whether governed by private or public law, who fails to comply with the national measures taken under this Directive.</p>\n</li>\n<li id=\"recital-48\" data-recital=\"48\" class=\"linkable-recital\">\n<p>(48) It is useful, in the field of application of this Directive, to draw on the experience of the Working Party on the Protection of Individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">Processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">Personal Data</span> composed of <span class=\"term-link\" data-term-id=\"representative\" tabindex=\"0\">representatives</span> of the <span class=\"term-link\" data-term-id=\"supervisory-authority\" tabindex=\"0\">supervisory authorities</span> of the Member States, set up by Article 29 of Directive 95/46/EC.</p>\n</li>\n<li id=\"recital-49\" data-recital=\"49\" class=\"linkable-recital\">\n<p>(49) To facilitate compliance with the provisions of this Directive, certain specific arrangements are needed for <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of data already under way on the date that national implementing legislation pursuant to this Directive enters into force,</p>\n</li>\n</ul>\n<p>HAVE ADOPTED THIS DIRECTIVE:</p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Scope and aim</strong></p>\n<ol>\n<li id=\"article-1-para-1\" data-para=\"1\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>This Directive provides for the harmonisation of the national provisions required to ensure an equivalent level of protection of fundamental rights and freedoms, and in particular the right to privacy and confidentiality, with respect to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> in the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> sector and to ensure the free movement of such data and of electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> equipment and services in the Community.</p>\n</li>\n<li id=\"article-1-para-2\" data-para=\"2\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>The provisions of this Directive particularise and complement Directive 95/46/EC for the purposes mentioned in paragraph 1. Moreover, they provide for protection of the legitimate interests of subscribers who are legal persons.</p>\n</li>\n<li id=\"article-1-para-3\" data-para=\"3\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>This Directive shall not apply to activities which fall outside the scope of the Treaty establishing the European Community, such as those covered by Titles V and VI of the Treaty on European Union, and in any case to activities concerning public security, defence, State security (including the economic well-being of the State when the activities relate to State security matters) and the activities of the State in areas of criminal law.</p>\n</li>\n</ol>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>Save as otherwise provided, the definitions in Directive 95/46/EC and in Directive 2002/21/EC of the European Parliament and of the Council of 7 March 2002 on a common regulatory framework for electronic communications networks and services (Framework Directive) ( 8 ) shall apply.</p>\n<p>The following definitions shall also apply:</p>\n<ul>\n<li id=\"article-2-para-1\" data-para=\"1\" data-context=\"article-2\" class=\"linkable-paragraph\">(a) ‘user’ means any natural person using a publicly available electronic communications service, for private or business purposes, without necessarily having subscribed to this service;</li>\n<li id=\"article-2-para-2\" data-para=\"2\" data-context=\"article-2\" class=\"linkable-paragraph\">(b) ‘traffic data’ means any data processed for the purpose of the conveyance of a communication on an electronic communications network or for the billing thereof;</li>\n<li id=\"article-2-para-3\" data-para=\"3\" data-context=\"article-2\" class=\"linkable-paragraph\">(c) ‘location data’ means any data processed in an electronic communications network or by an electronic communications service, indicating the geographic position of the terminal equipment of a user of a publicly available electronic communications service;</li>\n<li id=\"article-2-para-4\" data-para=\"4\" data-context=\"article-2\" class=\"linkable-paragraph\">(d) ‘communication’ means any information exchanged or conveyed between a finite number of parties by means of a publicly available electronic communications service. This does not include any information conveyed as part of a broadcasting service to the public over an electronic communications network except to the extent that the information can be related to the identifiable subscriber or user receiving the information;</li>\n<li id=\"article-2-para-5\" data-para=\"5\" data-context=\"article-2\" class=\"linkable-paragraph\">(f) ‘consent’ by a user or subscriber corresponds to the data subject's consent in Directive 95/46/EC;</li>\n<li id=\"article-2-para-6\" data-para=\"6\" data-context=\"article-2\" class=\"linkable-paragraph\">(g) ‘value added service’ means any service which requires the processing of traffic data or location data other than traffic data beyond what is necessary for the transmission of a communication or the billing thereof;</li>\n<li id=\"article-2-para-7\" data-para=\"7\" data-context=\"article-2\" class=\"linkable-paragraph\">(h) ‘electronic mail’ means any text, voice, sound or image message sent over a public communications network which can be stored in the network or in the recipient's terminal equipment until it is collected by the recipient;</li>\n<li id=\"article-2-para-8\" data-para=\"8\" data-context=\"article-2\" class=\"linkable-paragraph\">(i) ‘personal data breach’ means a breach of security leading to the accidental or unlawful destruction, loss, alteration, unauthorised disclosure of, or access to, personal data transmitted, stored or otherwise processed in connection with the provision of a publicly available electronic communications service in the Community.</li>\n</ul>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Services concerned</strong></p>\n<p>This Directive shall apply to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> in connection with the provision of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> in public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks in the Community, including public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks supporting data collection and identification devices.</p>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>Security of <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span></strong></p>\n<ol>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">The provider of a publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> must take appropriate technical and organisational measures to safeguard security of its services, if necessary in conjunction with the provider of the public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network with respect to network security. Having regard to the state of the art and the cost of their implementation, these measures shall ensure a level of security appropriate to the <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> presented.</li>\n</ol>\n<ul>\n<li>\n<p>(1a) Without prejudice to Directive 95/46/EC, the measures referred to in paragraph 1 shall at least:</p>\n<ul>\n<li>— ensure that <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> can be accessed only by authorised personnel for legally authorised purposes,</li>\n<li>— protect <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> stored or transmitted against accidental or unlawful destruction, accidental loss or alteration, and unauthorised or unlawful storage, <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span>, access or disclosure, and,</li>\n<li>— ensure the implementation of a security policy with respect to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span>,</li>\n</ul>\n<p>Relevant national authorities shall be able to audit the measures taken by providers of publicly available electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> services and to issue recommendations about best practices concerning the level of security which those measures should achieve.</p>\n</li>\n</ul>\n<ol start=\"2\">\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>In case of a particular <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> of a breach of the security of the network, the provider of a publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> must inform the subscribers concerning such <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> and, where the <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> lies outside the scope of the measures to be taken by the service provider, of any possible remedies, including an indication of the likely costs involved.</p>\n</li>\n<li id=\"article-4-para-3\" data-para=\"3\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>In the case of a <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span>, the provider of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> shall, without undue delay, notify the <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span> to the competent national authority. When the <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span> is likely to adversely affect the <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> or privacy of a subscriber or individual, the provider shall also notify the subscriber or individual of the breach without undue delay. Notification of a <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span> to a subscriber or individual concerned shall not be required if the provider has demonstrated to the satisfaction of the competent authority that it has implemented appropriate technological protection measures, and that those measures were applied to the data concerned by the security breach. Such technological protection measures shall render the data unintelligible to any person who is not authorised to access it. Without prejudice to the provider's obligation to notify subscribers and individuals concerned, if the provider has not already notified the subscriber or individual of the <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span>, the competent national authority, having considered the likely adverse effects of the breach, may require it to do so. The notification to the subscriber or individual shall at least describe the nature of the <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span> and the contact points where more information can be obtained, and shall recommend measures to mitigate the possible adverse effects of the <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span>. The notification to the competent national authority shall, in addition, describe the consequences of, and the measures proposed or taken by the provider to address, the <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breach</span>.</p>\n</li>\n<li id=\"article-4-para-4\" data-para=\"4\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Subject to any technical implementing measures adopted under paragraph 5, the competent national authorities may adopt guidelines and, where necessary, issue instructions concerning the circumstances in which providers are required to notify <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breaches</span>, the format of such notification and the manner in which the notification is to be made. They shall also be able to audit whether providers have complied with their notification obligations under this paragraph, and shall impose appropriate sanctions in the event of a failure to do so. Providers shall maintain an inventory of <span class=\"term-link\" data-term-id=\"personal-data-breach\" tabindex=\"0\">personal data breaches</span> comprising the facts surrounding the breach, its effects and the remedial action taken which shall be sufficient to enable the competent national authorities to verify compliance with the provisions of paragraph 3. The inventory shall only include the information necessary for this purpose.</p>\n</li>\n<li id=\"article-4-para-5\" data-para=\"5\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>In order to ensure consistency in implementation of the measures referred to in paragraphs 2, 3 and 4, the Commission may, following consultation with the European Network and Information Security Agency (ENISA), the Working Party on the Protection of Individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">Processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">Personal Data</span> established by Article 29 of Directive 95/46/EC and the European Data Protection Supervisor, adopt technical implementing measures concerning the circumstances, format and procedures applicable to the information and notification requirements referred to in this Article. When adopting such measures, the Commission shall involve all relevant stakeholders particularly in order to be informed of the best available technical and economic means of implementation of this Article. Those measures, designed to amend non-essential elements of this Directive by supplementing it, shall be adopted in accordance with the regulatory procedure with scrutiny referred to in Article 14a(2).</p>\n</li>\n</ol>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Confidentiality of the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span></strong></p>\n<ol>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Member States shall ensure the confidentiality of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> and the related <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> by means of a public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network and publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>, through national legislation. In particular, they shall prohibit listening, tapping, storage or other kinds of interception or surveillance of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> and the related <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> by persons other than <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>, without the consent of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> concerned, except when legally authorised to do so in accordance with Article 15(1). This paragraph shall not prevent technical storage which is necessary for the conveyance of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> without prejudice to the principle of confidentiality.</p>\n</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Paragraph 1 shall not affect any legally authorised recording of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> and the related <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> when carried out in the course of lawful business practice for the purpose of providing evidence of a commercial transaction or of any other business <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>.</p>\n</li>\n<li id=\"article-5-para-3\" data-para=\"3\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that the storing of information, or the gaining of access to information already stored, in the terminal equipment of a subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> is only allowed on condition that the subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> concerned has given his or her consent, having been provided with clear and comprehensive information, in accordance with Directive 95/46/EC, inter alia, about the purposes of the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span>. This shall not prevent any technical storage or access for the sole purpose of carrying out the transmission of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> over an electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network, or as strictly necessary in order for the provider of an <span class=\"term-link\" data-term-id=\"information-society-service\" tabindex=\"0\">information society service</span> explicitly requested by the subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> to provide the service.</p>\n</li>\n</ol>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong><span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span></strong></p>\n<ol>\n<li id=\"article-6-para-1\" data-para=\"1\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span> relating to subscribers and <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> processed and stored by the provider of a public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network or publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> must be erased or made anonymous when it is no longer needed for the purpose of the transmission of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> without prejudice to paragraphs 2, 3 and 5 of this Article and Article 15(1).</p>\n</li>\n<li id=\"article-6-para-2\" data-para=\"2\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">Traffic data</span> necessary for the purposes of subscriber billing and interconnection payments may be processed. Such <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> is permissible only up to the end of the period during which the bill may lawfully be challenged or payment pursued.</p>\n</li>\n<li id=\"article-6-para-3\" data-para=\"3\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p>For the purpose of marketing <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> or for the provision of <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added services</span>, the provider of a publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> may process the data referred to in paragraph 1 to the extent and for the duration necessary for such services or marketing, if the subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> to whom the data relate has given his or her prior consent. <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">Users</span> or subscribers shall be given the possibility to withdraw their consent for the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> at any time.</p>\n</li>\n<li id=\"article-6-para-4\" data-para=\"4\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p>The service provider must inform the subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> of the types of <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> which are processed and of the duration of such <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> for the purposes mentioned in paragraph 2 and, prior to obtaining consent, for the purposes mentioned in paragraph 3.</p>\n</li>\n<li id=\"article-6-para-5\" data-para=\"5\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">Processing</span> of <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span>, in accordance with paragraphs 1, 2, 3 and 4, must be restricted to persons acting under the authority of providers of the public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks and publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> handling billing or traffic management, customer enquiries, fraud detection, marketing <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> or providing a <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span>, and must be restricted to what is necessary for the purposes of such activities.</p>\n</li>\n<li id=\"article-6-para-6\" data-para=\"6\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p>Paragraphs 1, 2, 3 and 5 shall apply without prejudice to the possibility for competent bodies to be informed of <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> in conformity with applicable legislation with a view to settling disputes, in particular interconnection or billing disputes.</p>\n</li>\n</ol>\n<h3 id=\"article-7\">Article 7</h3>\n<p><strong>Itemised billing</strong></p>\n<ol>\n<li id=\"article-7-para-1\" data-para=\"1\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Subscribers shall have the right to receive non-itemised bills.</p>\n</li>\n<li id=\"article-7-para-2\" data-para=\"2\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Member States shall apply national provisions in order to reconcile the rights of subscribers receiving itemised bills with the right to privacy of calling <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> and called subscribers, for example by ensuring that sufficient alternative privacy enhancing methods of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> or payments are available to such <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> and subscribers.</p>\n</li>\n</ol>\n<h3 id=\"article-8\">Article 8</h3>\n<p><strong>Presentation and restriction of calling and connected line identification</strong></p>\n<ol>\n<li id=\"article-8-para-1\" data-para=\"1\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>Where presentation of calling line identification is offered, the service provider must offer the calling <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> the possibility, using a simple means and free of charge, of preventing the presentation of the calling line identification on a per-call basis. The calling subscriber must have this possibility on a per-line basis.</p>\n</li>\n<li id=\"article-8-para-2\" data-para=\"2\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>Where presentation of calling line identification is offered, the service provider must offer the called subscriber the possibility, using a simple means and free of charge for reasonable use of this function, of preventing the presentation of the calling line identification of incoming calls.</p>\n</li>\n<li id=\"article-8-para-3\" data-para=\"3\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>Where presentation of calling line identification is offered and where the calling line identification is presented prior to the call being established, the service provider must offer the called subscriber the possibility, using a simple means, of rejecting incoming calls where the presentation of the calling line identification has been prevented by the calling <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> or subscriber.</p>\n</li>\n<li id=\"article-8-para-4\" data-para=\"4\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>Where presentation of connected line identification is offered, the service provider must offer the called subscriber the possibility, using a simple means and free of charge, of preventing the presentation of the connected line identification to the calling <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>.</p>\n</li>\n<li id=\"article-8-para-5\" data-para=\"5\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>Paragraph 1 shall also apply with regard to calls to third countries originating in the Community. Paragraphs 2, 3 and 4 shall also apply to incoming calls originating in third countries.</p>\n</li>\n<li id=\"article-8-para-6\" data-para=\"6\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that where presentation of calling and/or connected line identification is offered, the providers of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> inform the public thereof and of the possibilities set out in paragraphs 1, 2, 3 and 4.</p>\n</li>\n</ol>\n<h3 id=\"article-9\">Article 9</h3>\n<p><strong><span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">Location data</span> other than <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span></strong></p>\n<ol>\n<li id=\"article-9-para-1\" data-para=\"1\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Where <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> other than <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span>, relating to <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> or subscribers of public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks or publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span>, can be processed, such data may only be processed when they are made anonymous, or with the consent of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> or subscribers to the extent and for the duration necessary for the provision of a <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span>. The service provider must inform the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> or subscribers, prior to obtaining their consent, of the type of <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> other than <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> which will be processed, of the purposes and duration of the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> and whether the data will be transmitted to a <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third party</span> for the purpose of providing the <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span>. <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">Users</span> or subscribers shall be given the possibility to withdraw their consent for the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> other than <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> at any time.</p>\n</li>\n<li id=\"article-9-para-2\" data-para=\"2\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Where consent of the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> or subscribers has been obtained for the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> other than <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span>, the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> or subscriber must continue to have the possibility, using a simple means and free of charge, of temporarily refusing the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of such data for each connection to the network or for each transmission of a <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>.</p>\n</li>\n<li id=\"article-9-para-3\" data-para=\"3\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">Processing</span> of <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span> other than <span class=\"term-link\" data-term-id=\"traffic-data\" tabindex=\"0\">traffic data</span> in accordance with paragraphs 1 and 2 must be restricted to persons acting under the authority of the provider of the public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network or publicly available <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> service or of the <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third party</span> providing the <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span>, and must be restricted to what is necessary for the purposes of providing the <span class=\"term-link\" data-term-id=\"value-added-service\" tabindex=\"0\">value added service</span>.</p>\n</li>\n</ol>\n<h3 id=\"article-10\">Article 10</h3>\n<p><strong>Exceptions</strong></p>\n<p>Member States shall ensure that there are transparent procedures governing the way in which a provider of a public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network and/or a publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> may override:</p>\n<ul>\n<li id=\"article-10-para-1\" data-para=\"1\" data-context=\"article-10\" class=\"linkable-paragraph\">(a) the elimination of the presentation of calling line identification, on a temporary basis, upon application of a subscriber requesting the tracing of malicious or nuisance calls. In this case, in accordance with national law, the data containing the identification of the calling subscriber will be stored and be made available by the provider of a public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> network and/or publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span>;</li>\n<li id=\"article-10-para-2\" data-para=\"2\" data-context=\"article-10\" class=\"linkable-paragraph\">(b) the elimination of the presentation of calling line identification and the temporary denial or absence of consent of a subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> for the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"location-data\" tabindex=\"0\">location data</span>, on a per-line basis for organisations dealing with emergency calls and recognised as such by a Member State, including law enforcement agencies, ambulance services and fire brigades, for the purpose of responding to such calls.</li>\n</ul>\n<h3 id=\"article-11\">Article 11</h3>\n<p><strong>Automatic call forwarding</strong></p>\n<p>Member States shall ensure that any subscriber has the possibility, using a simple means and free of charge, of stopping automatic call forwarding by a <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third party</span> to the subscriber's terminal.</p>\n<h3 id=\"article-12\">Article 12</h3>\n<p><strong>Directories of subscribers</strong></p>\n<ol>\n<li id=\"article-12-para-1\" data-para=\"1\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that subscribers are informed, free of charge and before they are included in the directory, about the purpose(s) of a printed or electronic directory of subscribers available to the public or obtainable through directory enquiry services, in which their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> can be included and of any further usage possibilities based on search functions embedded in electronic versions of the directory.</p>\n</li>\n<li id=\"article-12-para-2\" data-para=\"2\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that subscribers are given the opportunity to determine whether their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> are included in a public directory, and if so, which, to the extent that such data are relevant for the purpose of the directory as determined by the provider of the directory, and to verify, correct or withdraw such data. Not being included in a public subscriber directory, verifying, correcting or withdrawing <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> from it shall be free of charge.</p>\n</li>\n<li id=\"article-12-para-3\" data-para=\"3\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Member States may require that for any purpose of a public directory other than the search of contact details of persons on the basis of their name and, where necessary, a minimum of other identifiers, additional consent be asked of the subscribers.</p>\n</li>\n<li id=\"article-12-para-4\" data-para=\"4\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Paragraphs 1 and 2 shall apply to subscribers who are natural persons. Member States shall also ensure, in the framework of Community law and applicable national legislation, that the legitimate interests of subscribers other than natural persons with regard to their entry in public directories are sufficiently protected.</p>\n</li>\n</ol>\n<h3 id=\"article-13\">Article 13</h3>\n<p><strong>Unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span></strong></p>\n<ol>\n<li id=\"article-13-para-1\" data-para=\"1\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>The use of automated calling and <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> systems without human intervention (automatic calling machines), facsimile machines (fax) or <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span> for the purposes of direct marketing may be allowed only in respect of subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> who have given their prior consent.</p>\n</li>\n<li id=\"article-13-para-2\" data-para=\"2\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>Notwithstanding paragraph 1, where a natural or legal person obtains from its customers their electronic contact details for <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span>, in the context of the sale of a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> or a service, in accordance with Directive 95/46/EC, the same natural or legal person may use these electronic contact details for direct marketing of its own similar <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> or services provided that customers clearly and distinctly are given the opportunity to object, free of charge and in an easy manner, to such use of electronic contact details at the time of their collection and on the occasion of each message in case the customer has not initially refused such use.</p>\n</li>\n<li id=\"article-13-para-3\" data-para=\"3\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>Member States shall take appropriate measures to ensure that unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> for the purposes of direct marketing, in cases other than those referred to in paragraphs 1 and 2, are not allowed either without the consent of the subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> concerned or in respect of subscribers or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> who do not wish to receive these <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>, the choice between these options to be determined by national legislation, taking into account that both options must be free of charge for the subscriber or <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>.</p>\n</li>\n<li id=\"article-13-para-4\" data-para=\"4\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>In any event, the practice of sending <span class=\"term-link\" data-term-id=\"electronic-mail\" tabindex=\"0\">electronic mail</span> for the purposes of direct marketing which disguise or conceal the identity of the sender on whose behalf the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> is made, which contravene Article 6 of Directive 2000/31/EC, which do not have a valid address to which the <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span> may send a request that such <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> cease or which encourage <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipients</span> to visit websites that contravene that Article shall be prohibited.</p>\n</li>\n<li id=\"article-13-para-5\" data-para=\"5\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>Paragraphs 1 and 3 shall apply to subscribers who are natural persons. Member States shall also ensure, in the framework of Community law and applicable national legislation, that the legitimate interests of subscribers other than natural persons with regard to unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> are sufficiently protected.</p>\n</li>\n<li id=\"article-13-para-6\" data-para=\"6\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>Without prejudice to any administrative remedy for which provision may be made, inter alia, under Article 15a(2), Member States shall ensure that any natural or legal person adversely affected by infringements of national provisions adopted pursuant to this Article and therefore having a legitimate interest in the cessation or prohibition of such infringements, including an <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications service</span> provider protecting its legitimate business interests, may bring legal proceedings in respect of such infringements. Member States may also lay down specific rules on penalties applicable to providers of <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> which by their negligence contribute to infringements of national provisions adopted pursuant to this Article.</p>\n</li>\n</ol>\n<h3 id=\"article-14\">Article 14</h3>\n<p><strong>Technical features and standardisation</strong></p>\n<ol>\n<li id=\"article-14-para-1\" data-para=\"1\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>In implementing the provisions of this Directive, Member States shall ensure, subject to paragraphs 2 and 3, that no mandatory requirements for specific technical features are imposed on terminal or other electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> equipment which could impede the placing of equipment on the market and the free circulation of such equipment in and between Member States.</p>\n</li>\n<li id=\"article-14-para-2\" data-para=\"2\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>Where provisions of this Directive can be implemented only by requiring specific technical features in electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks, Member States shall inform the Commission in accordance with the procedure provided for by Directive 98/34/EC of the European Parliament and of the Council of 22 June 1998 laying down a procedure for the provision of information in the field of technical <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and regulations and of rules on <span class=\"term-link\" data-term-id=\"information-society-service\" tabindex=\"0\">information society services</span> ( 9 ).</p>\n</li>\n<li id=\"article-14-para-3\" data-para=\"3\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>Where required, measures may be adopted to ensure that terminal equipment is constructed in a way that is compatible with the right of <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> to protect and control the use of their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span>, in accordance with Directive 1999/5/EC and Council Decision 87/95/EEC of 22 December 1986 on standardisation in the field of information technology and <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> ( 10 ).</p>\n</li>\n</ol>\n<h3 id=\"article-14a\">Article 14a</h3>\n<p><strong>Committee procedure</strong></p>\n<ol>\n<li id=\"article-14a-para-1\" data-para=\"1\" data-context=\"article-14a\" class=\"linkable-paragraph\">\n<p>The Commission shall be assisted by the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">Communications</span> Committee established by Article 22 of Directive 2002/21/EC (Framework Directive).</p>\n</li>\n<li id=\"article-14a-para-2\" data-para=\"2\" data-context=\"article-14a\" class=\"linkable-paragraph\">\n<p>Where reference is made to this paragraph, Article 5a(1) to (4) and Article 7 of Decision 1999/468/EC shall apply, having regard to the provisions of Article 8 thereof.</p>\n</li>\n<li id=\"article-14a-para-3\" data-para=\"3\" data-context=\"article-14a\" class=\"linkable-paragraph\">\n<p>Where reference is made to this paragraph, Article 5a(1), (2), (4) and (6) and Article 7 of Decision 1999/468/EC shall apply, having regard to the provisions of Article 8 thereof.</p>\n</li>\n</ol>\n<h3 id=\"article-15\">Article 15</h3>\n<p><strong>Application of certain provisions of Directive 95/46/EC</strong></p>\n<ol>\n<li id=\"article-15-para-1\" data-para=\"1\" data-context=\"article-15\" class=\"linkable-paragraph\">Member States may adopt legislative measures to restrict the scope of the rights and obligations provided for in Article 5, Article 6, Article 8(1), (2), (3) and (4), and Article 9 of this Directive when such restriction constitutes a necessary, appropriate and proportionate measure within a democratic society to safeguard national security (i.e. State security), defence, public security, and the prevention, investigation, detection and prosecution of criminal offences or of unauthorised use of the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> system, as referred to in Article 13(1) of Directive 95/46/EC. To this end, Member States may, inter alia, adopt legislative measures providing for the retention of data for a limited period justified on the grounds laid down in this paragraph. All the measures referred to in this paragraph shall be in accordance with the general principles of Community law, including those referred to in Article 6(1) and (2) of the Treaty on European Union.</li>\n</ol>\n<ul>\n<li id=\"article-15-para-1a\" data-para=\"1a\" data-context=\"article-15\" class=\"linkable-paragraph\">\n<p>(1a) Paragraph 1 shall not apply to data specifically required by Directive 2006/24/EC of the European Parliament and of the Council of 15 March 2006 on the retention of data generated or processed in connection with the provision of publicly available <span class=\"term-link\" data-term-id=\"electronic-communications-service\" tabindex=\"0\">electronic communications services</span> or of public <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks ( 11 ) to be retained for the purposes referred to in Article 1(1) of that Directive.</p>\n</li>\n<li id=\"article-15-para-1b\" data-para=\"1b\" data-context=\"article-15\" class=\"linkable-paragraph\">\n<p>(1b) Providers shall establish internal procedures for responding to requests for access to <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>' <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> based on national provisions adopted pursuant to paragraph 1. They shall provide the competent national authority, on demand, with information about those procedures, the number of requests received, the legal justification invoked and their response.</p>\n</li>\n</ul>\n<ol start=\"2\">\n<li id=\"article-15-para-2\" data-para=\"2\" data-context=\"article-15\" class=\"linkable-paragraph\">\n<p>The provisions of Chapter III on judicial remedies, liability and sanctions of Directive 95/46/EC shall apply with regard to national provisions adopted pursuant to this Directive and with regard to the individual rights derived from this Directive.</p>\n</li>\n<li id=\"article-15-para-3\" data-para=\"3\" data-context=\"article-15\" class=\"linkable-paragraph\">\n<p>The Working Party on the Protection of Individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">Processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">Personal Data</span> instituted by Article 29 of Directive 95/46/EC shall also carry out the tasks laid down in Article 30 of that Directive with regard to matters covered by this Directive, namely the protection of fundamental rights and freedoms and of legitimate interests in the electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> sector.</p>\n</li>\n</ol>\n<h3 id=\"article-15a\">Article 15a</h3>\n<p><strong>Implementation and enforcement</strong></p>\n<ol>\n<li id=\"article-15a-para-1\" data-para=\"1\" data-context=\"article-15a\" class=\"linkable-paragraph\">\n<p>Member States shall lay down the rules on penalties, including criminal sanctions where appropriate, applicable to infringements of the national provisions adopted pursuant to this Directive and shall take all measures necessary to ensure that they are implemented. The penalties provided for must be effective, proportionate and dissuasive and may be applied to cover the period of any breach, even where the breach has subsequently been rectified. The Member States shall notify those provisions to the Commission by 25 May 2011, and shall notify it without delay of any subsequent amendment affecting them.</p>\n</li>\n<li id=\"article-15a-para-2\" data-para=\"2\" data-context=\"article-15a\" class=\"linkable-paragraph\">\n<p>Without prejudice to any judicial remedy which might be available, Member States shall ensure that the competent national authority and, where relevant, other national bodies have the power to order the cessation of the infringements referred to in paragraph 1.</p>\n</li>\n<li id=\"article-15a-para-3\" data-para=\"3\" data-context=\"article-15a\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that the competent national authority and, where relevant, other national bodies have the necessary investigative powers and resources, including the power to obtain any relevant information they might need to monitor and enforce national provisions adopted pursuant to this Directive.</p>\n</li>\n<li id=\"article-15a-para-4\" data-para=\"4\" data-context=\"article-15a\" class=\"linkable-paragraph\">\n<p>The relevant national regulatory authorities may adopt measures to ensure effective cross-border cooperation in the enforcement of the national laws adopted pursuant to this Directive and to create harmonised conditions for the provision of services involving cross-border data flows. The national regulatory authorities shall provide the Commission, in good time before adopting any such measures, with a summary of the grounds for action, the envisaged measures and the proposed course of action. The Commission may, having examined such information and consulted ENISA and the Working Party on the Protection of Individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">Processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">Personal Data</span> established by Article 29 of Directive 95/46/EC, make comments or recommendations thereupon, in particular to ensure that the envisaged measures do not adversely affect the functioning of the internal market. National regulatory authorities shall take the utmost account of the Commission's comments or recommendations when deciding on the measures.</p>\n</li>\n</ol>\n<h3 id=\"article-16\">Article 16</h3>\n<p><strong>Transitional arrangements</strong></p>\n<ol>\n<li id=\"article-16-para-1\" data-para=\"1\" data-context=\"article-16\" class=\"linkable-paragraph\">\n<p>Article 12 shall not apply to editions of directories already produced or placed on the market in printed or off-line electronic form before the national provisions adopted pursuant to this Directive enter into force.</p>\n</li>\n<li id=\"article-16-para-2\" data-para=\"2\" data-context=\"article-16\" class=\"linkable-paragraph\">\n<p>Where the <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> of subscribers to fixed or mobile public voice telephony services have been included in a public subscriber directory in conformity with the provisions of Directive 95/46/EC and of Article 11 of Directive 97/66/EC before the national provisions adopted in pursuance of this Directive enter into force, the <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> of such subscribers may remain included in this public directory in its printed or electronic versions, including versions with reverse search functions, unless subscribers indicate otherwise, after having received complete information about purposes and options in accordance with Article 12 of this Directive.</p>\n</li>\n</ol>\n<h3 id=\"article-17\">Article 17</h3>\n<p><strong>Transposition</strong></p>\n<ol>\n<li id=\"article-17-para-1\" data-para=\"1\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>Before 31 October 2003 Member States shall bring into force the provisions necessary to comply with this Directive. They shall forthwith inform the Commission thereof.</p>\n<p>When Member States adopt those provisions, they shall contain a reference to this Directive or be accompanied by such a reference on the occasion of their official publication. The methods of making such reference shall be laid down by the Member States.</p>\n</li>\n<li id=\"article-17-para-2\" data-para=\"2\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>Member States shall communicate to the Commission the text of the provisions of national law which they adopt in the field governed by this Directive and of any subsequent amendments to those provisions.</p>\n</li>\n</ol>\n<h3 id=\"article-18\">Article 18</h3>\n<p><strong>Review</strong></p>\n<p>The Commission shall submit to the European Parliament and the Council, not later than three years after the date referred to in Article 17(1), a report on the application of this Directive and its impact on economic operators and consumers, in particular as regards the provisions on unsolicited <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>, taking into account the international environment. For this purpose, the Commission may request information from the Member States, which shall be supplied without undue delay. Where appropriate, the Commission shall submit proposals to amend this Directive, taking account of the results of that report, any changes in the sector and any other proposal it may deem necessary in order to improve the effectiveness of this Directive.</p>\n<h3 id=\"article-19\">Article 19</h3>\n<p><strong>Repeal</strong></p>\n<p>Directive 97/66/EC is hereby repealed with effect from the date referred to in Article 17(1).</p>\n<p>References made to the repealed Directive shall be construed as being made to this Directive.</p>\n<h3 id=\"article-20\">Article 20</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Directive shall enter into force on the day of its publication in the Official Journal of the European Communities.</p>\n<h3 id=\"article-21\">Article 21</h3>\n<p><strong>Addressees</strong></p>\n<p>This Directive is addressed to the Member States.</p>",
  "wordCount": 9867,
  "lastProcessed": "2026-01-21T16:50:35.162Z",
  "preambleInjected": false
}