{
  "slug": "2008-765",
  "type": "regulation",
  "legalType": "regulation",
  "category": "referenced",
  "title": "Regulation (EC) No 765/2008 of the European Parliament and of the Council of 9 July 2008 setting out the requirements for accreditation and repealing Regulation (EEC) No 339/93",
  "shortTitle": "Accreditation Regulation (Consolidated)",
  "sidebarTitle": "Accreditation Regulation",
  "description": "Regulation (EC) No 765/2008 of the European Parliament and of the Council of 9 July 2008 setting out the requirements for accreditation and repealing Regulation (EEC) No 339/93",
  "celex": "02008R0765-20210716",
  "date": "9 July 2008",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A02008R0765-20210716",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "i-general-provisions",
      "title": "I. General Provisions",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "ii-accreditation",
      "title": "II. Accreditation",
      "level": 2
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "article-7",
      "title": "Article 7",
      "level": 3
    },
    {
      "id": "article-8",
      "title": "Article 8",
      "level": 3
    },
    {
      "id": "article-9",
      "title": "Article 9",
      "level": 3
    },
    {
      "id": "article-10",
      "title": "Article 10",
      "level": 3
    },
    {
      "id": "article-11",
      "title": "Article 11",
      "level": 3
    },
    {
      "id": "article-12",
      "title": "Article 12",
      "level": 3
    },
    {
      "id": "article-13",
      "title": "Article 13",
      "level": 3
    },
    {
      "id": "article-14",
      "title": "Article 14",
      "level": 3
    },
    {
      "id": "iv-ce-marking",
      "title": "IV. CE Marking",
      "level": 2
    },
    {
      "id": "article-30",
      "title": "Article 30",
      "level": 3
    },
    {
      "id": "v-community-financing",
      "title": "V. Community Financing",
      "level": 2
    },
    {
      "id": "article-31",
      "title": "Article 31",
      "level": 3
    },
    {
      "id": "article-32",
      "title": "Article 32",
      "level": 3
    },
    {
      "id": "article-33",
      "title": "Article 33",
      "level": 3
    },
    {
      "id": "article-34",
      "title": "Article 34",
      "level": 3
    },
    {
      "id": "article-35",
      "title": "Article 35",
      "level": 3
    },
    {
      "id": "article-36",
      "title": "Article 36",
      "level": 3
    },
    {
      "id": "article-37",
      "title": "Article 37",
      "level": 3
    },
    {
      "id": "vi-final-provisions",
      "title": "VI. Final Provisions",
      "level": 2
    },
    {
      "id": "article-38",
      "title": "Article 38",
      "level": 3
    },
    {
      "id": "article-39",
      "title": "Article 39",
      "level": 3
    },
    {
      "id": "article-40",
      "title": "Article 40",
      "level": 3
    },
    {
      "id": "article-41",
      "title": "Article 41",
      "level": 3
    },
    {
      "id": "article-42",
      "title": "Article 42",
      "level": 3
    },
    {
      "id": "article-43",
      "title": "Article 43",
      "level": 3
    },
    {
      "id": "article-44",
      "title": "Article 44",
      "level": 3
    },
    {
      "id": "annex-i",
      "title": "ANNEX I",
      "level": 2
    },
    {
      "id": "requirements-applicable-to-the-body-to-be-recognised-under-article-14",
      "title": "Requirements applicable to the body to be recognised under Article 14",
      "level": 3
    },
    {
      "id": "annex-ii",
      "title": "ANNEX II",
      "level": 2
    },
    {
      "id": "ce-marking",
      "title": "CE marking",
      "level": 3
    }
  ],
  "contentMarkdown": "> **⚠️ Consolidation Note:** This is the consolidated version as of 16 July 2021. Chapter III (Articles 15-29) on Market Surveillance was **repealed** by [Regulation (EU) 2019/1020](https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32019R1020) and has been removed from this document.\n\n## Preamble\n\nTHE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EUROPEAN UNION,\n\n*Having regard to the Treaty establishing the European Community, and in particular Articles 95 and 133 thereof,*\n\n*Having regard to the proposal from the Commission,*\n\n*Having regard to the opinion of the European Economic and Social Committee,*\n\n*After consulting the Committee of the Regions,*\n\n*Acting in accordance with the procedure laid down in Article 251 of the Treaty,*\n\nWhereas:\n\n## Recitals\n\n- (1) It is necessary to ensure that products benefiting from the free movement of goods within the Community fulfil requirements providing a high level of protection of public interests such as health and safety in general, health and safety at the workplace, protection of consumers, protection of the environment and security, while ensuring that the free movement of products is not restricted to any extent greater than that which is allowed under Community harmonisation legislation or any other relevant Community rules. Provision should, therefore, be made for rules on accreditation, market surveillance, controls of products from third countries and the CE marking.\n\n- (2) It is necessary to establish an overall framework of rules and principles in relation to accreditation and market surveillance. That framework should not affect the substantive rules of existing legislation setting out the provisions to be observed for the purpose of protecting public interests such as health, safety and protection of consumers and of the environment, but should aim at enhancing their operation.\n\n- (3) This Regulation should be seen as complementary to Decision No 768/2008/EC of the European Parliament and of the Council of 9 July 2008 on a common framework for the marketing of products.\n\n- (4) It is very difficult to adopt Community legislation for every product which exists or which may be developed; there is a need for a broad-based, legislative framework of a horizontal nature to deal with such products, to cover lacunae, in particular pending revision of existing specific legislation, and to complement provisions in existing or future specific legislation, in particular with a view to ensuring a high level of protection of health, safety, the environment and consumers, as required by Article 95 of the Treaty.\n\n- (5) The framework for market surveillance established by this Regulation should complement and strengthen existing provisions in Community harmonisation legislation relating to market surveillance and the enforcement of such provisions. However, in accordance with the principle of lex specialis, this Regulation should apply only in so far as there are no specific provisions with the same objective, nature or effect in other existing or future rules of Community harmonisation legislation. Examples can be found in the following sectors: drug precursors, medical devices, medicinal products for human and veterinary use, motor vehicles and aviation. The corresponding provisions of this Regulation should not therefore apply in the areas covered by such specific provisions.\n\n- (6) Directive 2001/95/EC of the European Parliament and of the Council of 3 December 2001 on general product safety established rules to ensure the safety of consumer products. Market surveillance authorities should have the possibility of taking the more specific measures available to them under that Directive.\n\n- (7) However, in order to achieve a higher level of safety for consumer products, the market surveillance mechanisms provided for in Directive 2001/95/EC should be reinforced as regards products presenting a serious risk, in accordance with the principles established by this Regulation. Directive 2001/95/EC should therefore be amended accordingly.\n\n- (8) Accreditation is part of an overall system, including conformity assessment and market surveillance, designed to assess and ensure conformity with the applicable requirements.\n\n- (9) The particular value of accreditation lies in the fact that it provides an authoritative statement of the technical competence of bodies whose task is to ensure conformity with the applicable requirements.\n\n- (10) Accreditation, though so far not regulated at Community level, is carried out in all Member States. The lack of common rules for that activity has resulted in different approaches and differing systems throughout the Community, with the result that the degree of rigour applied in the performance of accreditation has varied between Member States. It is therefore necessary to develop a comprehensive framework for accreditation and to lay down at Community level the principles for its operation and organisation.\n\n- (11) The establishment of a uniform national accreditation body should be without prejudice to the allocation of functions within Member States.\n\n- (12) Where Community harmonisation legislation provides for the selection of conformity assessment bodies for its implementation, transparent accreditation, as provided for in this Regulation, ensuring the necessary level of confidence in conformity certificates, should be considered by the national public authorities throughout the Community the preferred means of demonstrating the technical competence of those bodies. However, national authorities may consider that they possess the appropriate means of carrying out this evaluation themselves. In such cases, in order to ensure the appropriate level of credibility of evaluations carried out by other national authorities, they should provide the Commission and the other Member States with the necessary documentary evidence demonstrating the compliance of the conformity assessment bodies evaluated with the relevant regulatory requirements.\n\n- (13) A system of accreditation which functions by reference to binding rules helps to strengthen mutual confidence between Member States as regards the competence of conformity assessment bodies and consequently the certificates and test reports issued by them. It thereby enhances the principle of mutual recognition and therefore the provisions of this Regulation on accreditation should apply in relation to bodies carrying out conformity assessments in both the regulated and the non-regulated areas. The issue at stake is the quality of certificates and test reports irrespective of whether they fall within the regulated or the non-regulated area, and no distinction should therefore be made between those areas.\n\n- (14) For the purposes of this Regulation, not-for-profit operation by a national accreditation body should be understood as an activity that is not intended to add any gain to the resources of the body's owners or members. While national accreditation bodies do not have the objective of maximising or distributing profits, they may provide services in return for payment, or receive income. Any excess revenue that results from such services may be used for investment to develop their activities further, as long as it is in line with their main activities. It should accordingly be emphasised that the primary objective of national accreditation bodies should be to support or engage actively in activities that are not intended to produce any gain.\n\n- (15) Since the purpose of accreditation is to provide an authoritative statement of the competence of a body to perform conformity assessment activities, Member States should not maintain more than one national accreditation body and should ensure that that body is organised in such a way as to safeguard the objectivity and impartiality of its activities. Such national accreditation bodies should operate independently of commercial conformity assessment activities. It is therefore appropriate to provide that Member States ensure that, in the performance of their tasks, national accreditation bodies are deemed to exercise public authority, irrespective of their legal status.\n\n- (16) For the assessment and continued monitoring of the competence of a conformity assessment body, it is essential to determine its technological knowledge and experience and its ability to carry out assessment. It is therefore necessary that the national accreditation body possess the relevant knowledge, competence and means for the proper performance of its tasks.\n\n- (17) Accreditation should in principle be operated as a self-supporting activity. Member States should ensure that financial support exists for the fulfilment of special tasks.\n\n- (18) In those cases where it is not economically meaningful or sustainable for a Member State to establish a national accreditation body, that Member State should have recourse to the national accreditation body of another Member State and should be encouraged to have such recourse to the fullest extent possible.\n\n- (19) Competition between national accreditation bodies could lead to the commercialisation of their activity, which would be incompatible with their role as the last level of control in the conformity assessment chain. The objective of this Regulation is to ensure that, within the European Union, one accreditation certificate is sufficient for the whole territory of the Union, and to avoid multiple accreditation, which is added cost without added value. National accreditation bodies may find themselves in competition on the markets of third countries, but that must have no effect on their activities inside the Community, or on the cooperation and peer evaluation activities organised by the body recognised under this Regulation.\n\n- (20) In order to avoid multiple accreditation, to enhance acceptance and recognition of accreditation certificates and to carry out effective monitoring of accredited conformity assessment bodies, conformity assessment bodies should request accreditation by the national accreditation body of the Member State in which they are established. Nevertheless, it is necessary to ensure that a conformity assessment body is able to request accreditation in another Member State in the event that there is no national accreditation body in its own Member State or where the national accreditation body is not competent to provide the accreditation services requested. In such cases, appropriate cooperation and exchange of information between national accreditation bodies should be established.\n\n- (21) In order to ensure that national accreditation bodies fulfil the requirements and obligations provided for in this Regulation, it is important that Member States support the proper functioning of the accreditation system, monitor their national accreditation bodies regularly and take appropriate corrective measures within a reasonable timeframe where necessary.\n\n- (22) In order to ensure the equivalence of the level of competence of conformity assessment bodies, to facilitate mutual recognition and to promote the overall acceptance of accreditation certificates and conformity assessment results issued by accredited bodies, it is necessary that national accreditation bodies operate a rigorous and transparent peer evaluation system and regularly undergo such evaluation.\n\n- (23) This Regulation should provide for the recognition of a single organisation at European level in respect of certain functions in the field of accreditation. The European cooperation for Accreditation (the EA), whose main mission is to promote a transparent and quality-led system for the evaluation of the competence of conformity assessment bodies throughout Europe, manages a peer evaluation system among national accreditation bodies from the Member States and other European countries. That system has proved to be efficient and to provide mutual confidence. The EA should, therefore, be the first body recognised under this Regulation and Member States should ensure that their national accreditation bodies seek and maintain membership of the EA for as long as it is so recognised. At the same time, the possibility of changing the relevant body recognised under this Regulation should be provided for, in case there is a need for it in the future.\n\n- (24) Effective cooperation among national accreditation bodies is essential for the proper implementation of peer evaluation and with regard to cross-border accreditation. In the interests of transparency, it is, therefore, necessary to provide for an obligation on national accreditation bodies to exchange information among themselves and to provide the national authorities and the Commission with relevant information. Updated and accurate information concerning the availability of accreditation activities operated by national accreditation bodies should also be made public and, therefore, accessible, in particular to conformity assessment bodies.\n\n- (25) Sectoral accreditation schemes should cover the fields of activity where general requirements for the competence of conformity assessment bodies are not sufficient to ensure the necessary level of protection where specific detailed technology or health and safety-related requirements are imposed. Given the fact that the EA has at its disposal a broad range of technical expertise, it should be requested to develop such schemes, especially for areas covered by Community legislation.\n\n- (26) For the purpose of ensuring the equivalent and consistent enforcement of Community harmonisation legislation, this Regulation introduces a Community market surveillance framework, defining minimum requirements against the background of the objectives to be achieved by Member States and a framework for administrative cooperation including the exchange of information among Member States.\n\n- (27) In the case of economic operators in possession of test reports or certificates attesting conformity issued by an accredited conformity assessment body, where the relevant Community harmonisation legislation does not require such reports or certificates, market surveillance authorities should take due account of them when performing checks on product characteristics.\n\n- (28) Cooperation between competent authorities at national level and across borders in exchanging information, investigating infringements and taking action to bring about their cessation, even before the placing on the market of dangerous products, by reinforcing measures to identify them, mainly in seaports, is essential to the protection of health and safety and to guaranteeing the smooth functioning of the internal market. National consumer protection authorities should cooperate, at national level, with national market surveillance authorities and should exchange information with them relating to products which they suspect present a risk.\n\n- (29) Risk assessment should take all relevant data into account, including, where available, data on risks that have materialised with respect to the product in question. Account should also be taken of any measures that may have been taken by the economic operators concerned to alleviate the risks.\n\n- (30) Situations of serious risk posed by a product require rapid intervention, which may entail the withdrawal of the product, its recall or the prohibition of its being made available on the market. In those situations it is necessary to have access to a system of rapid exchange of information between Member States and the Commission. The system provided for in Article 12 of Directive 2001/95/EC has proved its effectiveness and efficiency in the field of consumer products. To avoid unnecessary duplication, that system should be used for the purposes of this Regulation. Moreover, coherent market surveillance throughout the Community requires a comprehensive exchange of information on national activities in this context which goes beyond this system.\n\n- (31) Information exchanged between competent authorities should be subject to the strictest guarantees of confidentiality and professional secrecy and be handled in accordance with rules on confidentiality pursuant to the applicable national law or, as regards the Commission, Regulation (EC) No 1049/2001 of the European Parliament and of the Council of 30 May 2001 regarding public access to European Parliament, Council and Commission documents, in order to ensure that investigations are not compromised and that the reputations of economic operators are not prejudiced. Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data and Regulation (EC) No 45/2001 of the European Parliament and of the Council of 18 December 2000 on the protection of individuals with regard to the processing of personal data by the Community institutions and bodies and on the free movement of such data apply in the context of this Regulation.\n\n- (32) Community harmonisation legislation provides for specific procedures establishing whether or not a national measure restricting the free movement of a product is justified (safeguard clause procedures). Those procedures apply following a rapid exchange of information on products presenting a serious risk.\n\n- (33) Points of entry at the external borders are well placed to detect unsafe non-conforming products or products to which the CE marking has been affixed falsely or in a misleading manner even before they are placed on the market. An obligation on authorities in charge of the control of products entering the Community market to execute checks on an adequate scale can therefore contribute to a safer market place. In order to increase the effectiveness of such checks, those authorities should receive all the necessary information concerning dangerous non-conforming products from the market surveillance authorities well in advance.\n\n- (34) Council Regulation (EEC) No 339/93 of 8 February 1993 on checks for conformity with the rules on product safety in the case of products imported from third countries lays down rules regarding the suspension of the release of products by customs authorities and provides for further measures including the involvement of market surveillance authorities. It is therefore appropriate that those provisions, including the involvement of market surveillance authorities, be incorporated in this Regulation.\n\n- (35) Experience has shown that products which are not released are often re-exported and subsequently enter the Community market at other points of entry, thus undermining the customs authorities' efforts. Market surveillance authorities should therefore be given the means of proceeding with the destruction of products if they deem it appropriate.\n\n- (36) Within one year of the publication of this Regulation in the Official Journal of the European Union, the Commission should present an in-depth analysis in the realm of consumer safety markings, followed by legislative proposals where necessary.\n\n- (37) The CE marking, indicating the conformity of a product, is the visible consequence of a whole process comprising conformity assessment in a broad sense. General principles governing the CE marking should be set out in this Regulation so as to make them immediately applicable and to simplify future legislation.\n\n- (38) The CE marking should be the only marking of conformity indicating that a product is in conformity with Community harmonisation legislation. However, other markings may be used as long as they contribute to the improvement of consumer protection and are not covered by Community harmonisation legislation.\n\n- (39) It is necessary for Member States to provide for appropriate means of redress in the competent courts and tribunals in respect of measures taken by the competent authorities which restrict the placing on the market of a product or which require its withdrawal or recall.\n\n- (40) Member States may find it useful to establish cooperation with the stakeholders concerned, including sectoral professional organisations and consumer organisations, in order to take advantage of available market intelligence when establishing, implementing and updating market surveillance programmes.\n\n- (41) The Member States should lay down rules on penalties applicable to infringements of the provisions of this Regulation and ensure that they are implemented. Those penalties should be effective, proportionate and dissuasive and could be increased if the relevant economic operator has previously committed a similar infringement of the provisions of this Regulation.\n\n- (42) In order to achieve the objectives of this Regulation, it is necessary for the Community to contribute to the financing of activities required to implement policies in the field of accreditation and market surveillance. Financing should be provided in the form of grants to the body recognised under this Regulation without a call for proposals, in the form of grants after a call for proposals, or by the award of contracts to that or to other bodies, depending on the nature of the activity to be financed and in accordance with Council Regulation (EC, Euratom) No 1605/2002 of 25 June 2002 on the Financial Regulation applicable to the general budget of the European Communities (the Financial Regulation).\n\n- (43) For some specialised tasks, such as the production and revision of sectoral accreditation schemes, and for other tasks related to the verification of the technical competence and the facilities of laboratories and certification or inspection bodies, the EA should initially be eligible for Community financing, since it is well adapted to providing the necessary technical expertise in this respect.\n\n- (44) Given the role of the body recognised under this Regulation in the peer evaluation of accreditation bodies and its ability to assist the Member States with the management of that peer evaluation, the Commission should be in a position to provide grants for the functioning of the secretariat of the body recognised under this Regulation, which should provide ongoing support for accreditation activities at Community level.\n\n- (45) A partnership agreement should be signed, in accordance with the provisions of the Financial Regulation, between the Commission and the body recognised under this Regulation in order to fix the administrative and financial rules on the financing of accreditation activities.\n\n- (46) In addition, financing should also be available to bodies other than the body recognised under this Regulation for other activities in the field of conformity assessment, metrology, accreditation and market surveillance, such as the drawing-up and updating of guidelines, inter-comparison activities linked to the operation of safeguard clauses, preliminary or ancillary activities in connection with the implementation of Community legislation in those areas and programmes of technical assistance and cooperation with third countries as well as the enhancement of policies in those areas at Community and international level.\n\n- (47) This Regulation respects the fundamental rights and observes the principles reflected in the Charter of Fundamental Rights of the European Union.\n\n- (48) Since the objective of this Regulation, namely to ensure that products on the market covered by Community legislation fulfil requirements providing a high level of protection of health and safety and other public interests while guaranteeing the functioning of the internal market by providing a framework for accreditation and market surveillance, cannot be sufficiently achieved by the Member States and can therefore, by reason of its scale and effects, be better achieved at Community level, the Community may adopt measures, in accordance with the principle of subsidiarity as set out in Article 5 of the Treaty. In accordance with the principle of proportionality, as set out in that Article, this Regulation does not go beyond what is necessary in order to achieve that objective,\n\nHAVE ADOPTED THIS REGULATION:\n\n## Enacting Terms\n\n## I. General Provisions\n\n### Article 1\n\n**Subject matter and scope**\n\nThis Regulation lays down rules on the organisation and operation of accreditation of conformity assessment bodies performing conformity assessment activities.\n\n### Article 2\n\n**Definitions**\n\nFor the purposes of this Regulation the following definitions shall apply:\n\n<!-- ⚠️ LEGAL FIDELITY WARNING (Rule 19, DEC-057):\n     This section uses raw HTML to preserve the exact EUR-Lex notation.\n     The \"N. 'term'\" format (e.g., \"3. 'manufacturer'\") must NOT be changed.\n     Standard markdown would renumber the list items (3,4,8,9 → 3,4,5,6).\n     IDs are explicit to enable deep linking from the Terminology page. -->\n<ul class=\"legal-definitions\">\n<li id=\"article-2-para-3\" class=\"linkable-paragraph\" data-para=\"3\" data-article=\"article-2\">3. 'manufacturer' means any natural or legal person who manufactures a product or has a product designed or manufactured, and markets that product under his name or trademark;</li>\n\n<li id=\"article-2-para-4\" class=\"linkable-paragraph\" data-para=\"4\" data-article=\"article-2\">4. 'authorised representative' means any natural or legal person established within the Community who has received a written mandate from a manufacturer to act on his behalf in relation to specified tasks with regard to the latter's obligations under the relevant Community legislation;</li>\n\n<li id=\"article-2-para-8\" class=\"linkable-paragraph\" data-para=\"8\" data-article=\"article-2\">8. 'technical specification' means a document that prescribes technical requirements to be fulfilled by a product, process or service;</li>\n\n<li id=\"article-2-para-9\" class=\"linkable-paragraph\" data-para=\"9\" data-article=\"article-2\">9. 'harmonised standard' means a standard adopted by one of the European standardisation bodies listed in Annex I to Directive 98/34/EC of the European Parliament and of the Council of 22 June 1998 laying down a procedure for the provision of information in the field of technical standards and regulations and of rules on Information Society services on the basis of a request made by the Commission in accordance with Article 6 of that Directive;</li>\n\n<li id=\"article-2-para-10\" class=\"linkable-paragraph\" data-para=\"10\" data-article=\"article-2\">10. 'accreditation' means an attestation by a national accreditation body that a conformity assessment body meets the requirements set by harmonised standards and, where applicable, any additional requirements including those set out in relevant sectoral schemes, to carry out a specific conformity assessment activity;</li>\n\n<li id=\"article-2-para-11\" class=\"linkable-paragraph\" data-para=\"11\" data-article=\"article-2\">11. 'national accreditation body' means the sole body in a Member State that performs accreditation with authority derived from the State;</li>\n\n<li id=\"article-2-para-12\" class=\"linkable-paragraph\" data-para=\"12\" data-article=\"article-2\">12. 'conformity assessment' means the process demonstrating whether specified requirements relating to a product, process, service, system, person or body have been fulfilled;</li>\n\n<li id=\"article-2-para-13\" class=\"linkable-paragraph\" data-para=\"13\" data-article=\"article-2\">13. 'conformity assessment body' means a body that performs conformity assessment activities including calibration, testing, certification and inspection;</li>\n\n<li id=\"article-2-para-16\" class=\"linkable-paragraph\" data-para=\"16\" data-article=\"article-2\">16. 'peer evaluation' means a process for the assessment of a national accreditation body by other national accreditation bodies, carried out in accordance with the requirements of this Regulation, and, where applicable, additional sectoral technical specifications;</li>\n\n<li id=\"article-2-para-19\" class=\"linkable-paragraph\" data-para=\"19\" data-article=\"article-2\">19. 'release for free circulation' means the procedure laid down in Article 79 of Council Regulation (EEC) No 2913/92 of 12 October 1992 establishing the Community Customs Code;</li>\n\n<li id=\"article-2-para-20\" class=\"linkable-paragraph\" data-para=\"20\" data-article=\"article-2\">20. 'CE marking' means a marking by which the manufacturer indicates that the product is in conformity with the applicable requirements set out in Community harmonisation legislation providing for its affixing;</li>\n\n<li id=\"article-2-para-21\" class=\"linkable-paragraph\" data-para=\"21\" data-article=\"article-2\">21. 'Community harmonisation legislation' means any Community legislation harmonising the conditions for the marketing of products.</li>\n</ul>\n\n## II. Accreditation\n\n### Article 3\n\n**Scope**\n\nThis Chapter shall apply to accreditation, used on a compulsory or voluntary basis, relating to conformity assessment, whether that assessment is compulsory or not, and irrespective of the legal status of the body performing the accreditation.\n\n### Article 4\n\n**General principles**\n\n1. Each Member State shall appoint a single national accreditation body.\n\n2. Where a Member State considers that it is not economically meaningful or sustainable to have a national accreditation body or to provide certain accreditation services, it shall, as far as possible, have recourse to the national accreditation body of another Member State.\n\n3. A Member State shall inform the Commission and the other Member States where, in accordance with paragraph 2, recourse is had to the national accreditation body of another Member State.\n\n4. On the basis of the information referred to in paragraph 3 and Article 12, the Commission shall draw up and update a list of national accreditation bodies which it shall make publicly available.\n\n5. Where accreditation is not operated directly by the public authorities themselves, a Member State shall entrust its national accreditation body with the operation of accreditation as a public authority activity and grant it formal recognition.\n\n6. The responsibilities and tasks of the national accreditation body shall be clearly distinguished from those of other national authorities.\n\n7. The national accreditation body shall operate on a not-for-profit basis.\n\n8. The national accreditation body shall not offer or provide any activities or services that conformity assessment bodies provide, nor shall it provide consultancy services, own shares in or otherwise have a financial or managerial interest in a conformity assessment body.\n\n9. Each Member State shall ensure that its national accreditation body has the appropriate financial and personnel resources for the proper performance of its tasks, including the fulfilment of special tasks, such as activities for European and international accreditation cooperation and activities that are required to support public policy and which are not self-financing.\n\n10. The national accreditation body shall be a member of the body recognised under Article 14.\n\n11. National accreditation bodies shall establish and maintain appropriate structures to ensure the effective and balanced involvement of all interested parties within both their organisations and the body recognised under Article 14.\n\n### Article 5\n\n**Operation of accreditation**\n\n1. A national accreditation body shall, when requested by a conformity assessment body, evaluate whether that conformity assessment body is competent to carry out a specific conformity assessment activity. Where it is found to be competent, the national accreditation body shall issue an accreditation certificate to that effect.\n\n2. When a Member State decides not to use accreditation, it shall provide the Commission and the other Member States with all the documentary evidence necessary for the verification of the competence of the conformity assessment bodies it selects for the implementation of the Community harmonisation legislation in question.\n\n3. National accreditation bodies shall monitor the conformity assessment bodies to which they have issued an accreditation certificate.\n\n4. Where a national accreditation body ascertains that a conformity assessment body which has received an accreditation certificate is no longer competent to carry out a specific conformity assessment activity or has committed a serious breach of its obligations, that accreditation body shall take all appropriate measures within a reasonable timeframe to restrict, suspend or withdraw the accreditation certificate.\n\n5. Member States shall establish procedures for the resolution of appeals, including, where appropriate, legal remedies against accreditation decisions or the absence thereof.\n\n### Article 6\n\n**Principle of non-competition**\n\n1. National accreditation bodies shall not compete with conformity assessment bodies.\n\n2. National accreditation bodies shall not compete with other national accreditation bodies.\n\n3. National accreditation bodies shall be permitted to operate across national borders, within the territory of another Member State, either at the request of a conformity assessment body in the circumstances set out in Article 7(1), or, if they are asked to do so by a national accreditation body in accordance with Article 7(3), in cooperation with the national accreditation body of that Member State.\n\n### Article 7\n\n**Cross-border accreditation**\n\n1. Where a conformity assessment body requests accreditation it shall do so with the national accreditation body of the Member State in which it is established or with the national accreditation body to which that Member State has had recourse in accordance with Article 4(2).\n\n   However, a conformity assessment body may request accreditation by a national accreditation body other than those referred to in the first subparagraph in any one of the following situations:\n\n   (a) where the Member State in which it is established has decided not to establish a national accreditation body and has not had recourse to the national accreditation body of another Member State in accordance with Article 4(2);\n\n   (b) where the national accreditation bodies referred to in the first subparagraph do not perform accreditation in respect of the conformity assessment activities for which accreditation is sought;\n\n   (c) where the national accreditation bodies referred to in the first subparagraph have not successfully undergone peer evaluation under Article 10 in respect of the conformity assessment activities for which accreditation is sought.\n\n2. Where a national accreditation body receives a request pursuant to paragraph 1(b) or (c), it shall inform the national accreditation body of the Member State in which the requesting conformity assessment body is established. In such cases, the national accreditation body of the Member State in which the requesting conformity assessment body is established may participate as an observer.\n\n3. A national accreditation body may request another national accreditation body to carry out part of the assessment activity. In such a case, the accreditation certificate shall be issued by the requesting body.\n\n### Article 8\n\n**Requirements for national accreditation bodies**\n\nA national accreditation body shall fulfil the following requirements:\n\n1. it shall be organised in such a manner as to make it independent of the conformity assessment bodies it assesses and of commercial pressures, and to ensure that no conflicts of interest with conformity assessment bodies occur;\n\n2. it shall be organised and operated so as to safeguard the objectivity and impartiality of its activities;\n\n3. it shall ensure that each decision relating to the attestation of competence is taken by competent persons different from those who carried out the assessment;\n\n4. it shall have adequate arrangements to safeguard the confidentiality of the information obtained;\n\n5. it shall identify the conformity assessment activities for which it is competent to perform accreditation, referring, where appropriate, to relevant Community or national legislation and standards;\n\n6. it shall set up the procedures necessary to ensure efficient management and appropriate internal controls;\n\n7. it shall have a number of competent personnel at its disposal sufficient for the proper performance of its tasks;\n\n8. it shall document the duties, responsibilities and authorities of personnel who could affect the quality of the assessment and of the attestation of competence;\n\n9. it shall establish, implement and maintain procedures for monitoring the performance and competence of the personnel involved;\n\n10. it shall verify that conformity assessments are carried out in an appropriate manner, meaning that unnecessary burdens are not imposed on undertakings and that due account is taken of the size of an undertaking, the sector in which it operates, its structure, the degree of complexity of the product technology in question and the mass or serial nature of the production process;\n\n11. it shall publish audited annual accounts prepared in accordance with generally accepted accounting principles.\n\n### Article 9\n\n**Compliance with requirements**\n\n1. Where a national accreditation body does not meet the requirements of this Regulation or fails to fulfil its obligations hereunder, the Member State concerned shall take appropriate corrective action or shall ensure that such corrective action is taken, and shall inform the Commission thereof.\n\n2. Member States shall monitor their national accreditation bodies at regular intervals in order to ensure that they fulfil the requirements laid down in Article 8 on a continuing basis.\n\n3. Member States shall take the utmost account of the results of peer evaluation under Article 10 when carrying out the monitoring referred to in paragraph 2 of this Article.\n\n4. National accreditation bodies shall have in place the necessary procedures to deal with complaints against the conformity assessment bodies they have accredited.\n\n### Article 10\n\n**Peer evaluation**\n\n1. National accreditation bodies shall subject themselves to peer evaluation organised by the body recognised under Article 14.\n\n2. Stakeholders shall have the right to participate in the system set up for the supervision of peer evaluation activities, but not in individual peer evaluation procedures.\n\n3. Member States shall ensure that their national accreditation bodies regularly undergo peer evaluation as required by paragraph 1.\n\n4. Peer evaluation shall be operated on the basis of sound and transparent evaluation criteria and procedures, in particular concerning structural, human resource and process requirements, confidentiality and complaints. Appropriate appeal procedures against decisions taken as a result of such evaluation shall be provided for.\n\n5. Peer evaluation shall ascertain whether the national accreditation bodies meet the requirements laid down in Article 8, taking into account the relevant harmonised standards referred to in Article 11.\n\n6. The outcome of peer evaluation shall be published and communicated by the body recognised under Article 14 to all Member States and the Commission.\n\n7. The Commission shall, in cooperation with the Member States, oversee the rules and the proper functioning of the peer evaluation system.\n\n### Article 11\n\n**Presumption of conformity for national accreditation bodies**\n\n1. National accreditation bodies that demonstrate conformity with the criteria laid down in the relevant harmonised standard, the reference of which has been published in the Official Journal of the European Union, by having successfully undergone peer evaluation under Article 10 shall be presumed to fulfil the requirements laid down in Article 8.\n\n2. National authorities shall recognise the equivalence of the services delivered by those accreditation bodies which have successfully undergone peer evaluation under Article 10, and thereby accept, on the basis of the presumption referred to in paragraph 1 of this Article, the accreditation certificates of those bodies and the attestations issued by the conformity assessment bodies accredited by them.\n\n### Article 12\n\n**Information obligation**\n\n1. Each national accreditation body shall inform the other national accreditation bodies of the conformity assessment activities in respect of which it operates accreditation and of any changes thereto.\n\n2. Each Member State shall inform the Commission and the body recognised under Article 14 of the identity of its national accreditation body and of all conformity assessment activities in respect of which that body operates accreditation in support of Community harmonisation legislation, and of any changes thereto.\n\n3. Each national accreditation body shall regularly make publicly available information concerning the results of its peer evaluation, the conformity assessment activities in respect of which it operates accreditation and any changes thereto.\n\n### Article 13\n\n**Requests to the body recognised under Article 14**\n\n1. The Commission may, after consulting the Committee set up by Article 5 of Directive 98/34/EC, request the body recognised under Article 14 to contribute to the development, maintenance and implementation of accreditation in the Community.\n\n2. The Commission may also, following the procedure laid down in paragraph 1:\n\n   (a) request the body recognised under Article 14 to lay down evaluation criteria and procedures for peer evaluation and to develop sectoral accreditation schemes;\n\n   (b) accept any existing scheme that already lays down evaluation criteria and procedures for peer evaluation.\n\n3. The Commission shall ensure that sectoral schemes identify the technical specifications necessary to meet the level of competence required by Community harmonisation legislation in fields with specific requirements relating to technology, health and safety or environment related requirements or any other aspect of public interest protection.\n\n### Article 14\n\n**European accreditation infrastructure**\n\n1. The Commission shall, after consulting the Member States, recognise a body which satisfies the requirements set out in Annex I to this Regulation.\n\n2. A body which is to be recognised pursuant to paragraph 1 shall conclude an agreement with the Commission. That agreement shall specify, inter alia, the detailed tasks of the body, funding provisions and provisions for its supervision. Both the Commission and the body shall be able to terminate the agreement without cause at the expiry of a reasonable period of notice to be defined therein.\n\n3. The Commission and the body shall make the agreement public.\n\n4. The Commission shall communicate the recognition of a body pursuant to paragraph 1 to the Member States and to national accreditation bodies.\n\n5. The Commission may not recognise more than one body at a time.\n\n6. The first body recognised under this Regulation shall be the European cooperation for accreditation, provided that it has concluded an agreement as specified in paragraph 2.\n\n## IV. CE Marking\n\n### Article 30\n\n**General principles of the CE marking**\n\n1. The CE marking shall be affixed only by the manufacturer or his authorised representative.\n\n2. The CE marking as presented in Annex II shall be affixed only to products to which its affixing is provided for by specific Community harmonisation legislation, and shall not be affixed to any other product.\n\n3. By affixing or having affixed the CE marking, the manufacturer indicates that he takes responsibility for the conformity of the product with all applicable requirements set out in the relevant Community harmonisation legislation providing for its affixing.\n\n4. The CE marking shall be the only marking which attests the conformity of the product with the applicable requirements of the relevant Community harmonisation legislation providing for its affixing.\n\n5. The affixing to a product of markings, signs or inscriptions which are likely to mislead third parties regarding the meaning or form of the CE marking shall be prohibited. Any other marking may be affixed to the product provided that the visibility, legibility and meaning of the CE marking is not thereby impaired.\n\n6. Without prejudice to Article 41, Member States shall ensure the correct implementation of the regime governing the CE marking and take appropriate action in the event of improper use of the marking. Member States shall also provide for penalties for infringements, which may include criminal sanctions for serious infringements. Those penalties shall be proportionate to the seriousness of the offence and constitute an effective deterrent against improper use.\n\n## V. Community Financing\n\n### Article 31\n\n**Body pursuing an aim of general European interest**\n\nThe body recognised under Article 14 shall be considered a body pursuing an aim of general European interest within the meaning of Article 162 of Commission Regulation (EC, Euratom) No 2342/2002 of 23 December 2002 laying down detailed rules for the implementation of Regulation (EC, Euratom) No 1605/2002.\n\n### Article 32\n\n**Activities eligible for Community financing**\n\n1. The Community may finance the following activities in connection with the application of this Regulation:\n\n   (a) the production and revision of sectoral accreditation schemes referred to in Article 13(3);\n\n   (b) the activities of the secretariat of the body recognised under Article 14, such as the coordination of accreditation activities, the processing of technical work linked to the operation of the peer evaluation system, the provision of interested parties with information and the participation of the body in the activities of international organisations in the field of accreditation;\n\n   (c) the drawing up and updating of contributions to guidelines in the fields of accreditation, notification to the Commission of conformity assessment bodies and conformity assessment;\n\n   > **[As amended by Regulation (EU) 2019/1020]** — Point (d) deleted (previously covered market surveillance guidelines)\n\n   (e) the performance of preliminary or ancillary work in connection with the implementation of the conformity assessment, metrology and accreditation activities linked to the implementation of Community legislation, such as studies, programmes, evaluations, guidelines, comparative analyses, mutual joint visits, research work, the development and maintenance of databases, training activities, laboratory work, proficiency testing, inter-laboratory tests and conformity assessment work;\n\n   (f) activities carried out under programmes of technical assistance, cooperation with third countries and the promotion and enhancement of European conformity assessment and accreditation policies and systems among interested parties in the Community and at international level.\n\n2. The activities referred to in paragraph 1(a) shall be eligible for Community financing only if the Committee set up by Article 5 of Directive 98/34/EC has been consulted on the requests to be submitted to the body recognised under Article 14 of this Regulation.\n\n### Article 33\n\n**Bodies eligible for Community financing**\n\nCommunity financing may be granted to the body recognised under Article 14 for the implementation of the activities set out in Article 32.\n\nHowever, Community financing may also be granted to other bodies for the carrying out of the activities set out in Article 32, except those set out in paragraph 1(a) and (b) of that Article.\n\n### Article 34\n\n**Financing**\n\nThe appropriations allocated to the activities referred to in this Regulation shall be determined each year by the budgetary authority within the limits of the financial framework in force.\n\n### Article 35\n\n**Financing arrangements**\n\n1. Community financing shall be provided:\n\n   (a) without a call for proposals, to the body recognised under Article 14 to carry out those activities referred to in Article 32(1)(a) to (g) for which grants can be awarded in accordance with the Financial Regulation;\n\n   (b) in the form of grants after a call for proposals, or by public procurement procedures, to other bodies to carry out the activities referred to in Article 32(1)(c) to (g).\n\n2. The activities of the secretariat of the body recognised under Article 14 referred to in Article 32(1)(b) may be financed on the basis of operating grants. In the event of renewal, the operating grants shall not be decreased automatically.\n\n3. Grant agreements may authorise flat-rate cover of the beneficiary's overheads up to a maximum of 10 % of total eligible direct costs for actions, except where the beneficiary's indirect costs are covered through an operating grant financed from the Community budget.\n\n4. The common cooperation objectives and the administrative and financial conditions relating to the grants awarded to the body recognised under Article 14 may be defined in a framework partnership agreement signed by the Commission and that body, in accordance with the Financial Regulation and Regulation (EC, Euratom) No 2342/2002. The European Parliament and the Council shall be informed of the conclusion of any such agreement.\n\n### Article 36\n\n**Management and monitoring**\n\n1. The appropriations determined by the budgetary authority for the financing of conformity assessment, accreditation and market surveillance activities may also cover administrative expenses relating to preparation, monitoring, inspection, auditing and evaluation which are directly necessary for the achievement of the objectives of this Regulation, and in particular studies, meetings, information and publication activities, expenses relating to informatics networks for the exchange of information and any other expenditure on administrative and technical assistance which the Commission may use for conformity assessment and accreditation activities.\n\n2. The Commission shall evaluate the relevance of the conformity assessment, accreditation and market surveillance activities that receive Community financing in the light of the requirements of Community policies and legislation, and inform the European Parliament and the Council of the outcome of that evaluation by 1 January 2013 and every five years thereafter.\n\n### Article 37\n\n**Protection of the Community's financial interests**\n\n1. The Commission shall ensure that, when the activities financed under this Regulation are implemented, the Community's financial interests are protected by the application of preventive measures against fraud, corruption and other illegal activities, by effective checks and by the recovery of amounts unduly paid and, if irregularities are detected, by effective, proportionate and dissuasive penalties, in accordance with Council Regulation (EC, Euratom) No 2988/95 of 18 December 1995 on the protection of the European Communities financial interests, Council Regulation (Euratom, EC) No 2185/96 of 11 November 1996 concerning on-the-spot checks and inspections carried out by the Commission in order to protect the European Communities' financial interests against fraud and other irregularities and Regulation (EC) No 1073/1999 of the European Parliament and of the Council of 25 May 1999 concerning investigations conducted by the European Anti-Fraud Office (OLAF).\n\n2. For the purposes of the Community activities financed under this Regulation, the notion of irregularity referred to in Article 1(2) of Regulation (EC, Euratom) No 2988/95 shall mean any infringement of a provision of Community law or any breach of a contractual obligation resulting from an act or omission by an economic operator which has, or would have, the effect of prejudicing the general budget of the European Union or budgets managed by it by an unjustified item of expenditure.\n\n3. Any agreements and contracts resulting from this Regulation shall provide for monitoring and financial control by the Commission or any representative which it authorises and for audits by the Court of Auditors, which may be conducted on the spot if necessary.\n\n## VI. Final Provisions\n\n### Article 38\n\n**Technical guidelines**\n\nIn order to facilitate the implementation of this Regulation, the Commission shall draw up non-binding guidelines in consultation with stakeholders.\n\n### Article 39\n\n**Transitional provision**\n\nAccreditation certificates issued before 1 January 2010 may remain valid until the date of their expiry, but no later than 31 December 2014. This Regulation shall, however, apply in the case of their extension or renewal.\n\n### Article 40\n\n**Review and reporting**\n\nBy 2 September 2013, the Commission shall submit to the European Parliament and to the Council a report on the application of this Regulation, of Directive 2001/95/EC and of any other relevant Community instrument addressing market surveillance. That report shall, in particular, analyse the consistency of Community rules in the field of market surveillance. If appropriate, it shall be accompanied by proposals to amend and/or consolidate the instruments concerned, in the interests of better regulation and simplification. It shall include an evaluation of the extension of the scope of Chapter III of this Regulation to all products.\n\nBy 1 January 2013, and every five years thereafter, the Commission, in cooperation with the Member States, shall produce and submit to the European Parliament and to the Council a report on the implementation of this Regulation.\n\n### Article 41\n\n**Penalties**\n\nThe Member States shall lay down rules on penalties for economic operators, which may include criminal sanctions for serious infringements, applicable to infringements of the provisions of this Regulation and shall take all measures necessary to ensure that they are implemented. The penalties provided for shall be effective, proportionate and dissuasive and may be increased if the relevant economic operator has previously committed a similar infringement of the provisions of this Regulation. The Member States shall notify the Commission of those provisions by 1 January 2010 and shall notify it without delay of any subsequent amendment affecting them.\n\n### Article 42\n\n**Amendment to Directive 2001/95/EC**\n\nArticle 8(3) of Directive 2001/95/EC shall be replaced by the following:\n\n'3. In the case of products posing a serious risk, the competent authorities shall with due dispatch take the appropriate measures referred to in paragraph 1(b) to (f). The existence of a serious risk shall be determined by the Member States, assessing each individual case on its merits and taking into account the guidelines referred to in point 8 of Annex II.'.\n\n### Article 43\n\n**Repeal**\n\nRegulation (EEC) No 339/93 is hereby repealed with effect from 1 January 2010.\n\nReferences to the repealed Regulation shall be construed as references to this Regulation.\n\n### Article 44\n\n**Entry into force**\n\nThis Regulation shall enter into force on the 20th day after its publication in the Official Journal of the European Union.\n\nIt shall apply from 1 January 2010.\n\nThis Regulation shall be binding in its entirety and directly applicable in all Member States.\n\nDone at Strasbourg, 9 July 2008.\n\n*For the European Parliament*\nThe President\n**H.-G. PÖTTERING**\n\n*For the Council*\nThe President\n**J.-P. JOUYET**\n\n---\n\n## ANNEX I\n\n### Requirements applicable to the body to be recognised under Article 14\n\n1. The body recognised under Article 14 of the Regulation (the body), shall be established within the Community.\n\n2. Under the body's constitution, national accreditation bodies from within the Community shall be entitled to be members of it, provided that they comply with the rules and objectives of the body and with the other conditions set out herein and as agreed with the Commission in the framework agreement.\n\n3. The body shall consult all relevant stakeholders.\n\n4. The body shall provide its members with peer evaluation services satisfying the requirements of Articles 10 and 11.\n\n5. The body shall cooperate with the Commission in accordance with this Regulation.\n\n---\n\n## ANNEX II\n\n### CE marking\n\n1. The CE marking shall consist of the initials 'CE' taking the following form:\n\n   *(The CE marking graphic consists of two stylised letters \"C\" and \"E\" with specific proportions as defined in official EU documentation)*\n\n2. If the CE marking is reduced or enlarged, the proportions given in the graduated drawing in paragraph 1 shall be respected.\n\n3. Where specific legislation does not impose specific dimensions, the CE marking shall be at least 5 mm high.\n",
  "contentHtml": "<blockquote>\n<p><strong>⚠️ Consolidation Note:</strong> This is the consolidated version as of 16 July 2021. Chapter III (Articles 15-29) on Market Surveillance was <strong>repealed</strong> by <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32019R1020\">Regulation (EU) 2019/1020</a> and has been removed from this document.</p>\n</blockquote>\n<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EUROPEAN UNION,</p>\n<p><em>Having regard to the Treaty establishing the European Community, and in particular Articles 95 and 133 thereof,</em></p>\n<p><em>Having regard to the proposal from the Commission,</em></p>\n<p><em>Having regard to the opinion of the European Economic and Social Committee,</em></p>\n<p><em>After consulting the Committee of the Regions,</em></p>\n<p><em>Acting in accordance with the procedure laid down in Article 251 of the Treaty,</em></p>\n<p>Whereas:</p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) It is necessary to ensure that <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> benefiting from the free movement of goods within the Community fulfil requirements providing a high level of protection of public interests such as health and safety in general, health and safety at the workplace, protection of consumers, protection of the environment and security, while ensuring that the free movement of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> is not restricted to any extent greater than that which is allowed under <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> or any other relevant Community rules. Provision should, therefore, be made for rules on <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, market surveillance, controls of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> from third countries and the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span>.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) It is necessary to establish an overall framework of rules and principles in relation to <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and market surveillance. That framework should not affect the substantive rules of existing legislation setting out the provisions to be observed for the purpose of protecting public interests such as health, safety and protection of consumers and of the environment, but should aim at enhancing their operation.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) This Regulation should be seen as complementary to Decision No 768/2008/EC of the European Parliament and of the Council of 9 July 2008 on a common framework for the marketing of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) It is very difficult to adopt Community legislation for every <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> which exists or which may be developed; there is a need for a broad-based, legislative framework of a horizontal nature to deal with such <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>, to cover lacunae, in particular pending revision of existing specific legislation, and to complement provisions in existing or future specific legislation, in particular with a view to ensuring a high level of protection of health, safety, the environment and consumers, as required by Article 95 of the Treaty.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) The framework for market surveillance established by this Regulation should complement and strengthen existing provisions in <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> relating to market surveillance and the enforcement of such provisions. However, in accordance with the principle of lex specialis, this Regulation should apply only in so far as there are no specific provisions with the same objective, nature or effect in other existing or future rules of <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span>. Examples can be found in the following sectors: drug precursors, medical devices, medicinal <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> for human and veterinary use, motor vehicles and aviation. The corresponding provisions of this Regulation should not therefore apply in the areas covered by such specific provisions.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) Directive 2001/95/EC of the European Parliament and of the Council of 3 December 2001 on general <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> safety established rules to ensure the safety of consumer <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>. Market surveillance authorities should have the possibility of taking the more specific measures available to them under that Directive.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) However, in order to achieve a higher level of safety for consumer <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>, the market surveillance mechanisms provided for in Directive 2001/95/EC should be reinforced as regards <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> presenting a serious <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span>, in accordance with the principles established by this Regulation. Directive 2001/95/EC should therefore be amended accordingly.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">Accreditation</span> is part of an overall system, including <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> and market surveillance, designed to assess and ensure conformity with the applicable requirements.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) The particular value of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> lies in the fact that it provides an authoritative statement of the technical competence of bodies whose task is to ensure conformity with the applicable requirements.</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">Accreditation</span>, though so far not regulated at Community level, is carried out in all Member States. The lack of common rules for that activity has resulted in different approaches and differing systems throughout the Community, with the result that the degree of rigour applied in the performance of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> has varied between Member States. It is therefore necessary to develop a comprehensive framework for <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and to lay down at Community level the principles for its operation and organisation.</p>\n</li>\n<li id=\"recital-11\" data-recital=\"11\" class=\"linkable-recital\">\n<p>(11) The establishment of a uniform <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> should be without prejudice to the allocation of functions within Member States.</p>\n</li>\n<li id=\"recital-12\" data-recital=\"12\" class=\"linkable-recital\">\n<p>(12) Where <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> provides for the selection of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> for its implementation, transparent <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, as provided for in this Regulation, ensuring the necessary level of confidence in conformity certificates, should be considered by the national <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span> throughout the Community the preferred means of demonstrating the technical competence of those bodies. However, national authorities may consider that they possess the appropriate means of carrying out this evaluation themselves. In such cases, in order to ensure the appropriate level of credibility of evaluations carried out by other national authorities, they should provide the Commission and the other Member States with the necessary documentary evidence demonstrating the compliance of the <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> evaluated with the relevant regulatory requirements.</p>\n</li>\n<li id=\"recital-13\" data-recital=\"13\" class=\"linkable-recital\">\n<p>(13) A system of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> which functions by reference to binding rules helps to strengthen mutual confidence between Member States as regards the competence of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> and consequently the certificates and test reports issued by them. It thereby enhances the principle of mutual recognition and therefore the provisions of this Regulation on <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> should apply in relation to bodies carrying out <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessments</span> in both the regulated and the non-regulated areas. The issue at stake is the quality of certificates and test reports irrespective of whether they fall within the regulated or the non-regulated area, and no distinction should therefore be made between those areas.</p>\n</li>\n<li id=\"recital-14\" data-recital=\"14\" class=\"linkable-recital\">\n<p>(14) For the purposes of this Regulation, not-for-profit operation by a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> should be understood as an activity that is not intended to add any gain to the resources of the body's owners or members. While <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> do not have the objective of maximising or distributing profits, they may provide <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> in return for payment, or receive income. Any excess revenue that results from such <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> may be used for investment to develop their activities further, as long as it is in line with their main activities. It should accordingly be emphasised that the primary objective of <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> should be to support or engage actively in activities that are not intended to produce any gain.</p>\n</li>\n<li id=\"recital-15\" data-recital=\"15\" class=\"linkable-recital\">\n<p>(15) Since the purpose of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> is to provide an authoritative statement of the competence of a body to perform <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities, Member States should not maintain more than one <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> and should ensure that that body is organised in such a way as to safeguard the objectivity and impartiality of its activities. Such <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> should operate independently of commercial <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities. It is therefore appropriate to provide that Member States ensure that, in the performance of their tasks, <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> are deemed to exercise <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authority</span>, irrespective of their legal status.</p>\n</li>\n<li id=\"recital-16\" data-recital=\"16\" class=\"linkable-recital\">\n<p>(16) For the assessment and continued monitoring of the competence of a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span>, it is essential to determine its technological knowledge and experience and its ability to carry out assessment. It is therefore necessary that the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> possess the relevant knowledge, competence and means for the proper performance of its tasks.</p>\n</li>\n<li id=\"recital-17\" data-recital=\"17\" class=\"linkable-recital\">\n<p>(17) <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">Accreditation</span> should in principle be operated as a self-supporting activity. Member States should ensure that financial support exists for the fulfilment of special tasks.</p>\n</li>\n<li id=\"recital-18\" data-recital=\"18\" class=\"linkable-recital\">\n<p>(18) In those cases where it is not economically meaningful or sustainable for a Member State to establish a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span>, that Member State should have recourse to the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of another Member State and should be encouraged to have such recourse to the fullest extent possible.</p>\n</li>\n<li id=\"recital-19\" data-recital=\"19\" class=\"linkable-recital\">\n<p>(19) Competition between <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> could lead to the commercialisation of their activity, which would be incompatible with their role as the last level of control in the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> chain. The objective of this Regulation is to ensure that, within the European Union, one <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificate is sufficient for the whole territory of the Union, and to avoid multiple <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, which is added cost without added value. <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> may find themselves in competition on the markets of third countries, but that must have no effect on their activities inside the Community, or on the cooperation and <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> activities organised by the body recognised under this Regulation.</p>\n</li>\n<li id=\"recital-20\" data-recital=\"20\" class=\"linkable-recital\">\n<p>(20) In order to avoid multiple <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, to enhance acceptance and recognition of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificates and to carry out effective monitoring of accredited <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span>, <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> should request <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> by the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of the Member State in which they are established. Nevertheless, it is necessary to ensure that a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> is able to request <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> in another Member State in the event that there is no <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> in its own Member State or where the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> is not competent to provide the <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> requested. In such cases, appropriate cooperation and exchange of information between <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> should be established.</p>\n</li>\n<li id=\"recital-21\" data-recital=\"21\" class=\"linkable-recital\">\n<p>(21) In order to ensure that <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> fulfil the requirements and obligations provided for in this Regulation, it is important that Member States support the proper functioning of the <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> system, monitor their <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> regularly and take appropriate corrective measures within a reasonable timeframe where necessary.</p>\n</li>\n<li id=\"recital-22\" data-recital=\"22\" class=\"linkable-recital\">\n<p>(22) In order to ensure the equivalence of the level of competence of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span>, to facilitate mutual recognition and to promote the overall acceptance of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificates and <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> results issued by accredited bodies, it is necessary that <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> operate a rigorous and transparent <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> system and regularly undergo such evaluation.</p>\n</li>\n<li id=\"recital-23\" data-recital=\"23\" class=\"linkable-recital\">\n<p>(23) This Regulation should provide for the recognition of a single organisation at European level in respect of certain functions in the field of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>. The European cooperation for <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">Accreditation</span> (the EA), whose main mission is to promote a transparent and quality-led system for the evaluation of the competence of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> throughout Europe, manages a <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> system among <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> from the Member States and other European countries. That system has proved to be efficient and to provide mutual confidence. The EA should, therefore, be the first body recognised under this Regulation and Member States should ensure that their <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> seek and maintain membership of the EA for as long as it is so recognised. At the same time, the possibility of changing the relevant body recognised under this Regulation should be provided for, in case there is a need for it in the future.</p>\n</li>\n<li id=\"recital-24\" data-recital=\"24\" class=\"linkable-recital\">\n<p>(24) Effective cooperation among <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> is essential for the proper implementation of <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> and with regard to cross-border <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>. In the interests of transparency, it is, therefore, necessary to provide for an obligation on <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> to exchange information among themselves and to provide the national authorities and the Commission with relevant information. Updated and accurate information concerning the availability of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> activities operated by <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> should also be made public and, therefore, accessible, in particular to <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span>.</p>\n</li>\n<li id=\"recital-25\" data-recital=\"25\" class=\"linkable-recital\">\n<p>(25) Sectoral <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> schemes should cover the fields of activity where general requirements for the competence of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> are not sufficient to ensure the necessary level of protection where specific detailed technology or health and safety-related requirements are imposed. Given the fact that the EA has at its disposal a broad range of technical expertise, it should be requested to develop such schemes, especially for areas covered by Community legislation.</p>\n</li>\n<li id=\"recital-26\" data-recital=\"26\" class=\"linkable-recital\">\n<p>(26) For the purpose of ensuring the equivalent and consistent enforcement of <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span>, this Regulation introduces a Community market surveillance framework, defining minimum requirements against the background of the objectives to be achieved by Member States and a framework for administrative cooperation including the exchange of information among Member States.</p>\n</li>\n<li id=\"recital-27\" data-recital=\"27\" class=\"linkable-recital\">\n<p>(27) In the case of economic operators in possession of test reports or certificates attesting conformity issued by an accredited <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span>, where the relevant <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> does not require such reports or certificates, market surveillance authorities should take due account of them when performing checks on <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> characteristics.</p>\n</li>\n<li id=\"recital-28\" data-recital=\"28\" class=\"linkable-recital\">\n<p>(28) Cooperation between competent authorities at national level and across borders in exchanging information, investigating infringements and taking action to bring about their cessation, even before the placing on the market of dangerous <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>, by reinforcing measures to identify them, mainly in seaports, is essential to the protection of health and safety and to guaranteeing the smooth functioning of the internal market. National consumer protection authorities should cooperate, at national level, with national market surveillance authorities and should exchange information with them relating to <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> which they suspect present a <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span>.</p>\n</li>\n<li id=\"recital-29\" data-recital=\"29\" class=\"linkable-recital\">\n<p>(29) <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">Risk</span> assessment should take all relevant data into account, including, where available, data on <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> that have materialised with respect to the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> in question. Account should also be taken of any measures that may have been taken by the economic operators concerned to alleviate the <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span>.</p>\n</li>\n<li id=\"recital-30\" data-recital=\"30\" class=\"linkable-recital\">\n<p>(30) Situations of serious <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> posed by a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> require rapid intervention, which may entail the withdrawal of the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span>, its recall or the prohibition of its being made available on the market. In those situations it is necessary to have access to a system of rapid exchange of information between Member States and the Commission. The system provided for in Article 12 of Directive 2001/95/EC has proved its effectiveness and efficiency in the field of consumer <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>. To avoid unnecessary duplication, that system should be used for the purposes of this Regulation. Moreover, coherent market surveillance throughout the Community requires a comprehensive exchange of information on national activities in this context which goes beyond this system.</p>\n</li>\n<li id=\"recital-31\" data-recital=\"31\" class=\"linkable-recital\">\n<p>(31) Information exchanged between competent authorities should be subject to the strictest guarantees of confidentiality and professional secrecy and be handled in accordance with rules on confidentiality pursuant to the applicable national law or, as regards the Commission, Regulation (EC) No 1049/2001 of the European Parliament and of the Council of 30 May 2001 regarding public access to European Parliament, Council and Commission documents, in order to ensure that investigations are not compromised and that the reputations of economic operators are not prejudiced. Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and on the free movement of such data and Regulation (EC) No 45/2001 of the European Parliament and of the Council of 18 December 2000 on the protection of individuals with regard to the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> by the Community institutions and bodies and on the free movement of such data apply in the context of this Regulation.</p>\n</li>\n<li id=\"recital-32\" data-recital=\"32\" class=\"linkable-recital\">\n<p>(32) <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> provides for specific procedures establishing whether or not a national measure restricting the free movement of a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> is justified (safeguard clause procedures). Those procedures apply following a rapid exchange of information on <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> presenting a serious <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span>.</p>\n</li>\n<li id=\"recital-33\" data-recital=\"33\" class=\"linkable-recital\">\n<p>(33) Points of entry at the external borders are well placed to detect unsafe non-conforming <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> or <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> to which the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> has been affixed falsely or in a misleading manner even before they are placed on the market. An obligation on authorities in charge of the control of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> entering the Community market to execute checks on an adequate scale can therefore contribute to a safer market place. In order to increase the effectiveness of such checks, those authorities should receive all the necessary information concerning dangerous non-conforming <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> from the market surveillance authorities well in advance.</p>\n</li>\n<li id=\"recital-34\" data-recital=\"34\" class=\"linkable-recital\">\n<p>(34) Council Regulation (EEC) No 339/93 of 8 February 1993 on checks for conformity with the rules on <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> safety in the case of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> imported from third countries lays down rules regarding the suspension of the release of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> by customs authorities and provides for further measures including the involvement of market surveillance authorities. It is therefore appropriate that those provisions, including the involvement of market surveillance authorities, be incorporated in this Regulation.</p>\n</li>\n<li id=\"recital-35\" data-recital=\"35\" class=\"linkable-recital\">\n<p>(35) Experience has shown that <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> which are not released are often re-exported and subsequently enter the Community market at other points of entry, thus undermining the customs authorities' efforts. Market surveillance authorities should therefore be given the means of proceeding with the destruction of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> if they deem it appropriate.</p>\n</li>\n<li id=\"recital-36\" data-recital=\"36\" class=\"linkable-recital\">\n<p>(36) Within one year of the publication of this Regulation in the Official Journal of the European Union, the Commission should present an in-depth analysis in the realm of consumer safety markings, followed by legislative proposals where necessary.</p>\n</li>\n<li id=\"recital-37\" data-recital=\"37\" class=\"linkable-recital\">\n<p>(37) The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span>, indicating the conformity of a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span>, is the visible consequence of a whole process comprising <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> in a broad sense. General principles governing the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> should be set out in this Regulation so as to make them immediately applicable and to simplify future legislation.</p>\n</li>\n<li id=\"recital-38\" data-recital=\"38\" class=\"linkable-recital\">\n<p>(38) The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> should be the only marking of conformity indicating that a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> is in conformity with <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span>. However, other markings may be used as long as they contribute to the improvement of consumer protection and are not covered by <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span>.</p>\n</li>\n<li id=\"recital-39\" data-recital=\"39\" class=\"linkable-recital\">\n<p>(39) It is necessary for Member States to provide for appropriate means of redress in the competent courts and tribunals in respect of measures taken by the competent authorities which restrict the placing on the market of a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> or which require its withdrawal or recall.</p>\n</li>\n<li id=\"recital-40\" data-recital=\"40\" class=\"linkable-recital\">\n<p>(40) Member States may find it useful to establish cooperation with the stakeholders concerned, including sectoral professional organisations and consumer organisations, in order to take advantage of available market intelligence when establishing, implementing and updating market surveillance programmes.</p>\n</li>\n<li id=\"recital-41\" data-recital=\"41\" class=\"linkable-recital\">\n<p>(41) The Member States should lay down rules on penalties applicable to infringements of the provisions of this Regulation and ensure that they are implemented. Those penalties should be effective, proportionate and dissuasive and could be increased if the relevant economic operator has previously committed a similar infringement of the provisions of this Regulation.</p>\n</li>\n<li id=\"recital-42\" data-recital=\"42\" class=\"linkable-recital\">\n<p>(42) In order to achieve the objectives of this Regulation, it is necessary for the Community to contribute to the financing of activities required to implement policies in the field of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and market surveillance. Financing should be provided in the form of grants to the body recognised under this Regulation without a call for proposals, in the form of grants after a call for proposals, or by the award of contracts to that or to other bodies, depending on the nature of the activity to be financed and in accordance with Council Regulation (EC, Euratom) No 1605/2002 of 25 June 2002 on the Financial Regulation applicable to the general budget of the European Communities (the Financial Regulation).</p>\n</li>\n<li id=\"recital-43\" data-recital=\"43\" class=\"linkable-recital\">\n<p>(43) For some specialised tasks, such as the production and revision of sectoral <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> schemes, and for other tasks related to the verification of the technical competence and the facilities of laboratories and certification or inspection bodies, the EA should initially be eligible for Community financing, since it is well adapted to providing the necessary technical expertise in this respect.</p>\n</li>\n<li id=\"recital-44\" data-recital=\"44\" class=\"linkable-recital\">\n<p>(44) Given the role of the body recognised under this Regulation in the <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> bodies and its ability to assist the Member States with the management of that <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span>, the Commission should be in a position to provide grants for the functioning of the secretariat of the body recognised under this Regulation, which should provide ongoing support for <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> activities at Community level.</p>\n</li>\n<li id=\"recital-45\" data-recital=\"45\" class=\"linkable-recital\">\n<p>(45) A partnership agreement should be signed, in accordance with the provisions of the Financial Regulation, between the Commission and the body recognised under this Regulation in order to fix the administrative and financial rules on the financing of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> activities.</p>\n</li>\n<li id=\"recital-46\" data-recital=\"46\" class=\"linkable-recital\">\n<p>(46) In addition, financing should also be available to bodies other than the body recognised under this Regulation for other activities in the field of <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span>, metrology, <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and market surveillance, such as the drawing-up and updating of guidelines, inter-comparison activities linked to the operation of safeguard clauses, preliminary or ancillary activities in connection with the implementation of Community legislation in those areas and programmes of technical assistance and cooperation with third countries as well as the enhancement of policies in those areas at Community and international level.</p>\n</li>\n<li id=\"recital-47\" data-recital=\"47\" class=\"linkable-recital\">\n<p>(47) This Regulation respects the fundamental rights and observes the principles reflected in the Charter of Fundamental Rights of the European Union.</p>\n</li>\n<li id=\"recital-48\" data-recital=\"48\" class=\"linkable-recital\">\n<p>(48) Since the objective of this Regulation, namely to ensure that <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> on the market covered by Community legislation fulfil requirements providing a high level of protection of health and safety and other public interests while guaranteeing the functioning of the internal market by providing a framework for <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and market surveillance, cannot be sufficiently achieved by the Member States and can therefore, by reason of its scale and effects, be better achieved at Community level, the Community may adopt measures, in accordance with the principle of subsidiarity as set out in Article 5 of the Treaty. In accordance with the principle of proportionality, as set out in that Article, this Regulation does not go beyond what is necessary in order to achieve that objective,</p>\n</li>\n</ul>\n<p>HAVE ADOPTED THIS REGULATION:</p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h2 id=\"i-general-provisions\">I. General Provisions</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Subject matter and scope</strong></p>\n<p>This Regulation lays down rules on the organisation and operation of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> performing <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities.</p>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>For the purposes of this Regulation the following definitions shall apply:</p>\n<!-- ⚠️ LEGAL FIDELITY WARNING (Rule 19, DEC-057):\n     This section uses raw HTML to preserve the exact EUR-Lex notation.\n     The \"N. 'term'\" format (e.g., \"3. 'manufacturer'\") must NOT be changed.\n     Standard markdown would renumber the list items (3,4,8,9 → 3,4,5,6).\n     IDs are explicit to enable deep linking from the Terminology page. -->\n<ul class=\"legal-definitions\">\n<li id=\"article-2-para-3\" class=\"linkable-paragraph\" data-para=\"3\" data-article=\"article-2\">3. 'manufacturer' means any natural or legal person who manufactures a product or has a product designed or manufactured, and markets that product under his name or trademark;</li>\n<li id=\"article-2-para-4\" class=\"linkable-paragraph\" data-para=\"4\" data-article=\"article-2\">4. 'authorised representative' means any natural or legal person established within the Community who has received a written mandate from a manufacturer to act on his behalf in relation to specified tasks with regard to the latter's obligations under the relevant Community legislation;</li>\n<li id=\"article-2-para-8\" class=\"linkable-paragraph\" data-para=\"8\" data-article=\"article-2\">8. 'technical specification' means a document that prescribes technical requirements to be fulfilled by a product, process or service;</li>\n<li id=\"article-2-para-9\" class=\"linkable-paragraph\" data-para=\"9\" data-article=\"article-2\">9. 'harmonised standard' means a standard adopted by one of the European standardisation bodies listed in Annex I to Directive 98/34/EC of the European Parliament and of the Council of 22 June 1998 laying down a procedure for the provision of information in the field of technical standards and regulations and of rules on Information Society services on the basis of a request made by the Commission in accordance with Article 6 of that Directive;</li>\n<li id=\"article-2-para-10\" class=\"linkable-paragraph\" data-para=\"10\" data-article=\"article-2\">10. 'accreditation' means an attestation by a national accreditation body that a conformity assessment body meets the requirements set by harmonised standards and, where applicable, any additional requirements including those set out in relevant sectoral schemes, to carry out a specific conformity assessment activity;</li>\n<li id=\"article-2-para-11\" class=\"linkable-paragraph\" data-para=\"11\" data-article=\"article-2\">11. 'national accreditation body' means the sole body in a Member State that performs accreditation with authority derived from the State;</li>\n<li id=\"article-2-para-12\" class=\"linkable-paragraph\" data-para=\"12\" data-article=\"article-2\">12. 'conformity assessment' means the process demonstrating whether specified requirements relating to a product, process, service, system, person or body have been fulfilled;</li>\n<li id=\"article-2-para-13\" class=\"linkable-paragraph\" data-para=\"13\" data-article=\"article-2\">13. 'conformity assessment body' means a body that performs conformity assessment activities including calibration, testing, certification and inspection;</li>\n<li id=\"article-2-para-16\" class=\"linkable-paragraph\" data-para=\"16\" data-article=\"article-2\">16. 'peer evaluation' means a process for the assessment of a national accreditation body by other national accreditation bodies, carried out in accordance with the requirements of this Regulation, and, where applicable, additional sectoral technical specifications;</li>\n<li id=\"article-2-para-19\" class=\"linkable-paragraph\" data-para=\"19\" data-article=\"article-2\">19. 'release for free circulation' means the procedure laid down in Article 79 of Council Regulation (EEC) No 2913/92 of 12 October 1992 establishing the Community Customs Code;</li>\n<li id=\"article-2-para-20\" class=\"linkable-paragraph\" data-para=\"20\" data-article=\"article-2\">20. 'CE marking' means a marking by which the manufacturer indicates that the product is in conformity with the applicable requirements set out in Community harmonisation legislation providing for its affixing;</li>\n<li id=\"article-2-para-21\" class=\"linkable-paragraph\" data-para=\"21\" data-article=\"article-2\">21. 'Community harmonisation legislation' means any Community legislation harmonising the conditions for the marketing of products.</li>\n</ul>\n<h2 id=\"ii-accreditation\">II. Accreditation</h2>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Scope</strong></p>\n<p>This Chapter shall apply to <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, used on a compulsory or voluntary basis, relating to <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span>, whether that assessment is compulsory or not, and irrespective of the legal status of the body performing the <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>.</p>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>General principles</strong></p>\n<ol>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Each Member State shall appoint a single <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span>.</p>\n</li>\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Where a Member State considers that it is not economically meaningful or sustainable to have a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> or to provide certain <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, it shall, as far as possible, have recourse to the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of another Member State.</p>\n</li>\n<li id=\"article-4-para-3\" data-para=\"3\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>A Member State shall inform the Commission and the other Member States where, in accordance with paragraph 2, recourse is had to the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of another Member State.</p>\n</li>\n<li id=\"article-4-para-4\" data-para=\"4\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>On the basis of the information referred to in paragraph 3 and Article 12, the Commission shall draw up and update a list of <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> which it shall make publicly available.</p>\n</li>\n<li id=\"article-4-para-5\" data-para=\"5\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Where <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> is not operated directly by the <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span> themselves, a Member State shall entrust its <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> with the operation of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> as a <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authority</span> activity and grant it formal recognition.</p>\n</li>\n<li id=\"article-4-para-6\" data-para=\"6\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>The responsibilities and tasks of the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall be clearly distinguished from those of other national authorities.</p>\n</li>\n<li id=\"article-4-para-7\" data-para=\"7\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall operate on a not-for-profit basis.</p>\n</li>\n<li id=\"article-4-para-8\" data-para=\"8\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall not offer or provide any activities or <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> that <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> provide, nor shall it provide consultancy <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, own shares in or otherwise have a financial or managerial interest in a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span>.</p>\n</li>\n<li id=\"article-4-para-9\" data-para=\"9\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Each Member State shall ensure that its <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> has the appropriate financial and personnel resources for the proper performance of its tasks, including the fulfilment of special tasks, such as activities for European and international <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> cooperation and activities that are required to support public policy and which are not self-financing.</p>\n</li>\n<li id=\"article-4-para-10\" data-para=\"10\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall be a member of the body recognised under Article 14.</p>\n</li>\n<li id=\"article-4-para-11\" data-para=\"11\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall establish and maintain appropriate structures to ensure the effective and balanced involvement of all interested parties within both their organisations and the body recognised under Article 14.</p>\n</li>\n</ol>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Operation of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span></strong></p>\n<ol>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>A <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall, when requested by a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span>, evaluate whether that <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> is competent to carry out a specific <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activity. Where it is found to be competent, the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall issue an <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificate to that effect.</p>\n</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>When a Member State decides not to use <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, it shall provide the Commission and the other Member States with all the documentary evidence necessary for the verification of the competence of the <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> it selects for the implementation of the <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> in question.</p>\n</li>\n<li id=\"article-5-para-3\" data-para=\"3\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall monitor the <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> to which they have issued an <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificate.</p>\n</li>\n<li id=\"article-5-para-4\" data-para=\"4\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Where a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> ascertains that a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> which has received an <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificate is no longer competent to carry out a specific <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activity or has committed a serious breach of its obligations, that <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> body shall take all appropriate measures within a reasonable timeframe to restrict, suspend or withdraw the <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificate.</p>\n</li>\n<li id=\"article-5-para-5\" data-para=\"5\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Member States shall establish procedures for the resolution of appeals, including, where appropriate, legal remedies against <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> decisions or the absence thereof.</p>\n</li>\n</ol>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong>Principle of non-competition</strong></p>\n<ol>\n<li id=\"article-6-para-1\" data-para=\"1\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall not compete with <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span>.</p>\n</li>\n<li id=\"article-6-para-2\" data-para=\"2\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall not compete with other <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span>.</p>\n</li>\n<li id=\"article-6-para-3\" data-para=\"3\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall be permitted to operate across national borders, within the territory of another Member State, either at the request of a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> in the circumstances set out in Article 7(1), or, if they are asked to do so by a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> in accordance with Article 7(3), in cooperation with the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of that Member State.</p>\n</li>\n</ol>\n<h3 id=\"article-7\">Article 7</h3>\n<p><strong>Cross-border <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span></strong></p>\n<ol>\n<li id=\"article-7-para-1\" data-para=\"1\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Where a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> requests <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> it shall do so with the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of the Member State in which it is established or with the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> to which that Member State has had recourse in accordance with Article 4(2).</p>\n<p>However, a <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> may request <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> by a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> other than those referred to in the first subparagraph in any one of the following situations:</p>\n<p>(a) where the Member State in which it is established has decided not to establish a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> and has not had recourse to the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of another Member State in accordance with Article 4(2);</p>\n<p>(b) where the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> referred to in the first subparagraph do not perform <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> in respect of the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities for which <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> is sought;</p>\n<p>(c) where the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> referred to in the first subparagraph have not successfully undergone <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> under Article 10 in respect of the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities for which <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> is sought.</p>\n</li>\n<li id=\"article-7-para-2\" data-para=\"2\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Where a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> receives a request pursuant to paragraph 1(b) or (c), it shall inform the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of the Member State in which the requesting <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> is established. In such cases, the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> of the Member State in which the requesting <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment body</span> is established may participate as an observer.</p>\n</li>\n<li id=\"article-7-para-3\" data-para=\"3\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>A <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> may request another <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> to carry out part of the assessment activity. In such a case, the <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificate shall be issued by the requesting body.</p>\n</li>\n</ol>\n<h3 id=\"article-8\">Article 8</h3>\n<p><strong>Requirements for <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span></strong></p>\n<p>A <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall fulfil the following requirements:</p>\n<ol>\n<li id=\"article-8-para-1\" data-para=\"1\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall be organised in such a manner as to make it independent of the <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> it assesses and of commercial pressures, and to ensure that no conflicts of interest with <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> occur;</p>\n</li>\n<li id=\"article-8-para-2\" data-para=\"2\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall be organised and operated so as to safeguard the objectivity and impartiality of its activities;</p>\n</li>\n<li id=\"article-8-para-3\" data-para=\"3\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall ensure that each decision relating to the attestation of competence is taken by competent persons different from those who carried out the assessment;</p>\n</li>\n<li id=\"article-8-para-4\" data-para=\"4\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall have adequate arrangements to safeguard the confidentiality of the information obtained;</p>\n</li>\n<li id=\"article-8-para-5\" data-para=\"5\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall identify the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities for which it is competent to perform <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, referring, where appropriate, to relevant Community or national legislation and <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>;</p>\n</li>\n<li id=\"article-8-para-6\" data-para=\"6\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall set up the procedures necessary to ensure efficient management and appropriate internal controls;</p>\n</li>\n<li id=\"article-8-para-7\" data-para=\"7\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall have a number of competent personnel at its disposal sufficient for the proper performance of its tasks;</p>\n</li>\n<li id=\"article-8-para-8\" data-para=\"8\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall document the duties, responsibilities and authorities of personnel who could affect the quality of the assessment and of the attestation of competence;</p>\n</li>\n<li id=\"article-8-para-9\" data-para=\"9\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall establish, implement and maintain procedures for monitoring the performance and competence of the personnel involved;</p>\n</li>\n<li id=\"article-8-para-10\" data-para=\"10\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall verify that <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessments</span> are carried out in an appropriate manner, meaning that unnecessary burdens are not imposed on undertakings and that due account is taken of the size of an undertaking, the sector in which it operates, its structure, the degree of complexity of the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> technology in question and the mass or serial nature of the production process;</p>\n</li>\n<li id=\"article-8-para-11\" data-para=\"11\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>it shall publish audited annual accounts prepared in accordance with generally accepted accounting principles.</p>\n</li>\n</ol>\n<h3 id=\"article-9\">Article 9</h3>\n<p><strong>Compliance with requirements</strong></p>\n<ol>\n<li id=\"article-9-para-1\" data-para=\"1\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Where a <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> does not meet the requirements of this Regulation or fails to fulfil its obligations hereunder, the Member State concerned shall take appropriate corrective action or shall ensure that such corrective action is taken, and shall inform the Commission thereof.</p>\n</li>\n<li id=\"article-9-para-2\" data-para=\"2\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Member States shall monitor their <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> at regular intervals in order to ensure that they fulfil the requirements laid down in Article 8 on a continuing basis.</p>\n</li>\n<li id=\"article-9-para-3\" data-para=\"3\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Member States shall take the utmost account of the results of <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> under Article 10 when carrying out the monitoring referred to in paragraph 2 of this Article.</p>\n</li>\n<li id=\"article-9-para-4\" data-para=\"4\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall have in place the necessary procedures to deal with complaints against the <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> they have accredited.</p>\n</li>\n</ol>\n<h3 id=\"article-10\">Article 10</h3>\n<p><strong><span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">Peer evaluation</span></strong></p>\n<ol>\n<li id=\"article-10-para-1\" data-para=\"1\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> shall subject themselves to <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> organised by the body recognised under Article 14.</p>\n</li>\n<li id=\"article-10-para-2\" data-para=\"2\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>Stakeholders shall have the right to participate in the system set up for the supervision of <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> activities, but not in individual <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> procedures.</p>\n</li>\n<li id=\"article-10-para-3\" data-para=\"3\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that their <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> regularly undergo <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> as required by paragraph 1.</p>\n</li>\n<li id=\"article-10-para-4\" data-para=\"4\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">Peer evaluation</span> shall be operated on the basis of sound and transparent evaluation criteria and procedures, in particular concerning structural, human resource and process requirements, confidentiality and complaints. Appropriate appeal procedures against decisions taken as a result of such evaluation shall be provided for.</p>\n</li>\n<li id=\"article-10-para-5\" data-para=\"5\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">Peer evaluation</span> shall ascertain whether the <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> meet the requirements laid down in Article 8, taking into account the relevant <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> referred to in Article 11.</p>\n</li>\n<li id=\"article-10-para-6\" data-para=\"6\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>The outcome of <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> shall be published and communicated by the body recognised under Article 14 to all Member States and the Commission.</p>\n</li>\n<li id=\"article-10-para-7\" data-para=\"7\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>The Commission shall, in cooperation with the Member States, oversee the rules and the proper functioning of the <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> system.</p>\n</li>\n</ol>\n<h3 id=\"article-11\">Article 11</h3>\n<p><strong>Presumption of conformity for <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span></strong></p>\n<ol>\n<li id=\"article-11-para-1\" data-para=\"1\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">National accreditation bodies</span> that demonstrate conformity with the criteria laid down in the relevant <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span>, the reference of which has been published in the Official Journal of the European Union, by having successfully undergone <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> under Article 10 shall be presumed to fulfil the requirements laid down in Article 8.</p>\n</li>\n<li id=\"article-11-para-2\" data-para=\"2\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p>National authorities shall recognise the equivalence of the <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> delivered by those <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> bodies which have successfully undergone <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> under Article 10, and thereby accept, on the basis of the presumption referred to in paragraph 1 of this Article, the <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> certificates of those bodies and the attestations issued by the <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> accredited by them.</p>\n</li>\n</ol>\n<h3 id=\"article-12\">Article 12</h3>\n<p><strong>Information obligation</strong></p>\n<ol>\n<li id=\"article-12-para-1\" data-para=\"1\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Each <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall inform the other <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> of the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities in respect of which it operates <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and of any changes thereto.</p>\n</li>\n<li id=\"article-12-para-2\" data-para=\"2\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Each Member State shall inform the Commission and the body recognised under Article 14 of the identity of its <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> and of all <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities in respect of which that body operates <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> in support of <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span>, and of any changes thereto.</p>\n</li>\n<li id=\"article-12-para-3\" data-para=\"3\" data-context=\"article-12\" class=\"linkable-paragraph\">\n<p>Each <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation body</span> shall regularly make publicly available information concerning the results of its <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span>, the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> activities in respect of which it operates <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and any changes thereto.</p>\n</li>\n</ol>\n<h3 id=\"article-13\">Article 13</h3>\n<p><strong>Requests to the body recognised under Article 14</strong></p>\n<ol>\n<li id=\"article-13-para-1\" data-para=\"1\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>The Commission may, after consulting the Committee set up by Article 5 of Directive 98/34/EC, request the body recognised under Article 14 to contribute to the development, maintenance and implementation of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> in the Community.</p>\n</li>\n<li id=\"article-13-para-2\" data-para=\"2\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>The Commission may also, following the procedure laid down in paragraph 1:</p>\n<p>(a) request the body recognised under Article 14 to lay down evaluation criteria and procedures for <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> and to develop sectoral <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> schemes;</p>\n<p>(b) accept any existing scheme that already lays down evaluation criteria and procedures for <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span>.</p>\n</li>\n<li id=\"article-13-para-3\" data-para=\"3\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>The Commission shall ensure that sectoral schemes identify the <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> necessary to meet the level of competence required by <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> in fields with specific requirements relating to technology, health and safety or environment related requirements or any other aspect of public interest protection.</p>\n</li>\n</ol>\n<h3 id=\"article-14\">Article 14</h3>\n<p><strong>European <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> infrastructure</strong></p>\n<ol>\n<li id=\"article-14-para-1\" data-para=\"1\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>The Commission shall, after consulting the Member States, recognise a body which satisfies the requirements set out in Annex I to this Regulation.</p>\n</li>\n<li id=\"article-14-para-2\" data-para=\"2\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>A body which is to be recognised pursuant to paragraph 1 shall conclude an agreement with the Commission. That agreement shall specify, inter alia, the detailed tasks of the body, funding provisions and provisions for its supervision. Both the Commission and the body shall be able to terminate the agreement without cause at the expiry of a reasonable period of notice to be defined therein.</p>\n</li>\n<li id=\"article-14-para-3\" data-para=\"3\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>The Commission and the body shall make the agreement public.</p>\n</li>\n<li id=\"article-14-para-4\" data-para=\"4\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>The Commission shall communicate the recognition of a body pursuant to paragraph 1 to the Member States and to <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span>.</p>\n</li>\n<li id=\"article-14-para-5\" data-para=\"5\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>The Commission may not recognise more than one body at a time.</p>\n</li>\n<li id=\"article-14-para-6\" data-para=\"6\" data-context=\"article-14\" class=\"linkable-paragraph\">\n<p>The first body recognised under this Regulation shall be the European cooperation for <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, provided that it has concluded an agreement as specified in paragraph 2.</p>\n</li>\n</ol>\n<h2 id=\"iv-ce-marking\">IV. CE Marking</h2>\n<h3 id=\"article-30\">Article 30</h3>\n<p><strong>General principles of the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span></strong></p>\n<ol>\n<li id=\"article-30-para-1\" data-para=\"1\" data-context=\"article-30\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> shall be affixed only by the <span class=\"term-link\" data-term-id=\"manufacturer\" tabindex=\"0\">manufacturer</span> or his <span class=\"term-link\" data-term-id=\"authorised-representative\" tabindex=\"0\">authorised representative</span>.</p>\n</li>\n<li id=\"article-30-para-2\" data-para=\"2\" data-context=\"article-30\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> as presented in Annex II shall be affixed only to <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> to which its affixing is provided for by specific <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span>, and shall not be affixed to any other <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span>.</p>\n</li>\n<li id=\"article-30-para-3\" data-para=\"3\" data-context=\"article-30\" class=\"linkable-paragraph\">\n<p>By affixing or having affixed the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span>, the <span class=\"term-link\" data-term-id=\"manufacturer\" tabindex=\"0\">manufacturer</span> indicates that he takes responsibility for the conformity of the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> with all applicable requirements set out in the relevant <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> providing for its affixing.</p>\n</li>\n<li id=\"article-30-para-4\" data-para=\"4\" data-context=\"article-30\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> shall be the only marking which attests the conformity of the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> with the applicable requirements of the relevant <span class=\"term-link\" data-term-id=\"community-harmonisation-legislation\" tabindex=\"0\">Community harmonisation legislation</span> providing for its affixing.</p>\n</li>\n<li id=\"article-30-para-5\" data-para=\"5\" data-context=\"article-30\" class=\"linkable-paragraph\">\n<p>The affixing to a <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> of markings, signs or inscriptions which are likely to mislead <span class=\"term-link\" data-term-id=\"third-party\" tabindex=\"0\">third parties</span> regarding the meaning or form of the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> shall be prohibited. Any other marking may be affixed to the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> provided that the visibility, legibility and meaning of the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> is not thereby impaired.</p>\n</li>\n<li id=\"article-30-para-6\" data-para=\"6\" data-context=\"article-30\" class=\"linkable-paragraph\">\n<p>Without prejudice to Article 41, Member States shall ensure the correct implementation of the regime governing the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> and take appropriate action in the event of improper use of the marking. Member States shall also provide for penalties for infringements, which may include criminal sanctions for serious infringements. Those penalties shall be proportionate to the seriousness of the offence and constitute an effective deterrent against improper use.</p>\n</li>\n</ol>\n<h2 id=\"v-community-financing\">V. Community Financing</h2>\n<h3 id=\"article-31\">Article 31</h3>\n<p><strong>Body pursuing an aim of general European interest</strong></p>\n<p>The body recognised under Article 14 shall be considered a body pursuing an aim of general European interest within the meaning of Article 162 of Commission Regulation (EC, Euratom) No 2342/2002 of 23 December 2002 laying down detailed rules for the implementation of Regulation (EC, Euratom) No 1605/2002.</p>\n<h3 id=\"article-32\">Article 32</h3>\n<p><strong>Activities eligible for Community financing</strong></p>\n<ol>\n<li id=\"article-32-para-1\" data-para=\"1\" data-context=\"article-32\" class=\"linkable-paragraph\">\n<p>The Community may finance the following activities in connection with the application of this Regulation:</p>\n<p>(a) the production and revision of sectoral <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> schemes referred to in Article 13(3);</p>\n<p>(b) the activities of the secretariat of the body recognised under Article 14, such as the coordination of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> activities, the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of technical work linked to the operation of the <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> system, the provision of interested parties with information and the participation of the body in the activities of <span class=\"term-link\" data-term-id=\"international-organisation\" tabindex=\"0\">international organisations</span> in the field of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>;</p>\n<p>(c) the drawing up and updating of contributions to guidelines in the fields of <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span>, notification to the Commission of <span class=\"term-link\" data-term-id=\"conformity-assessment-body\" tabindex=\"0\">conformity assessment bodies</span> and <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span>;</p>\n<blockquote>\n<p><strong>[As amended by Regulation (EU) 2019/1020]</strong> — Point (d) deleted (previously covered market surveillance guidelines)</p>\n</blockquote>\n<p>(e) the performance of preliminary or ancillary work in connection with the implementation of the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span>, metrology and <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> activities linked to the implementation of Community legislation, such as studies, programmes, evaluations, guidelines, comparative analyses, mutual joint visits, research work, the development and maintenance of databases, training activities, laboratory work, proficiency testing, inter-laboratory tests and <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> work;</p>\n<p>(f) activities carried out under programmes of technical assistance, cooperation with third countries and the promotion and enhancement of European <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> and <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> policies and systems among interested parties in the Community and at international level.</p>\n</li>\n<li id=\"article-32-para-2\" data-para=\"2\" data-context=\"article-32\" class=\"linkable-paragraph\">\n<p>The activities referred to in paragraph 1(a) shall be eligible for Community financing only if the Committee set up by Article 5 of Directive 98/34/EC has been consulted on the requests to be submitted to the body recognised under Article 14 of this Regulation.</p>\n</li>\n</ol>\n<h3 id=\"article-33\">Article 33</h3>\n<p><strong>Bodies eligible for Community financing</strong></p>\n<p>Community financing may be granted to the body recognised under Article 14 for the implementation of the activities set out in Article 32.</p>\n<p>However, Community financing may also be granted to other bodies for the carrying out of the activities set out in Article 32, except those set out in paragraph 1(a) and (b) of that Article.</p>\n<h3 id=\"article-34\">Article 34</h3>\n<p><strong>Financing</strong></p>\n<p>The appropriations allocated to the activities referred to in this Regulation shall be determined each year by the budgetary authority within the limits of the financial framework in force.</p>\n<h3 id=\"article-35\">Article 35</h3>\n<p><strong>Financing arrangements</strong></p>\n<ol>\n<li id=\"article-35-para-1\" data-para=\"1\" data-context=\"article-35\" class=\"linkable-paragraph\">\n<p>Community financing shall be provided:</p>\n<p>(a) without a call for proposals, to the body recognised under Article 14 to carry out those activities referred to in Article 32(1)(a) to (g) for which grants can be awarded in accordance with the Financial Regulation;</p>\n<p>(b) in the form of grants after a call for proposals, or by public procurement procedures, to other bodies to carry out the activities referred to in Article 32(1)(c) to (g).</p>\n</li>\n<li id=\"article-35-para-2\" data-para=\"2\" data-context=\"article-35\" class=\"linkable-paragraph\">\n<p>The activities of the secretariat of the body recognised under Article 14 referred to in Article 32(1)(b) may be financed on the basis of operating grants. In the event of renewal, the operating grants shall not be decreased automatically.</p>\n</li>\n<li id=\"article-35-para-3\" data-para=\"3\" data-context=\"article-35\" class=\"linkable-paragraph\">\n<p>Grant agreements may authorise flat-rate cover of the beneficiary's overheads up to a maximum of 10 % of total eligible direct costs for actions, except where the beneficiary's indirect costs are covered through an operating grant financed from the Community budget.</p>\n</li>\n<li id=\"article-35-para-4\" data-para=\"4\" data-context=\"article-35\" class=\"linkable-paragraph\">\n<p>The common cooperation objectives and the administrative and financial conditions relating to the grants awarded to the body recognised under Article 14 may be defined in a framework partnership agreement signed by the Commission and that body, in accordance with the Financial Regulation and Regulation (EC, Euratom) No 2342/2002. The European Parliament and the Council shall be informed of the conclusion of any such agreement.</p>\n</li>\n</ol>\n<h3 id=\"article-36\">Article 36</h3>\n<p><strong>Management and monitoring</strong></p>\n<ol>\n<li id=\"article-36-para-1\" data-para=\"1\" data-context=\"article-36\" class=\"linkable-paragraph\">\n<p>The appropriations determined by the budgetary authority for the financing of <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span>, <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and market surveillance activities may also cover administrative expenses relating to preparation, monitoring, inspection, auditing and evaluation which are directly necessary for the achievement of the objectives of this Regulation, and in particular studies, meetings, information and publication activities, expenses relating to informatics networks for the exchange of information and any other expenditure on administrative and technical assistance which the Commission may use for <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span> and <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> activities.</p>\n</li>\n<li id=\"article-36-para-2\" data-para=\"2\" data-context=\"article-36\" class=\"linkable-paragraph\">\n<p>The Commission shall evaluate the relevance of the <span class=\"term-link\" data-term-id=\"conformity-assessment\" tabindex=\"0\">conformity assessment</span>, <span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">accreditation</span> and market surveillance activities that receive Community financing in the light of the requirements of Community policies and legislation, and inform the European Parliament and the Council of the outcome of that evaluation by 1 January 2013 and every five years thereafter.</p>\n</li>\n</ol>\n<h3 id=\"article-37\">Article 37</h3>\n<p><strong>Protection of the Community's financial interests</strong></p>\n<ol>\n<li id=\"article-37-para-1\" data-para=\"1\" data-context=\"article-37\" class=\"linkable-paragraph\">\n<p>The Commission shall ensure that, when the activities financed under this Regulation are implemented, the Community's financial interests are protected by the application of preventive measures against fraud, corruption and other illegal activities, by effective checks and by the recovery of amounts unduly paid and, if irregularities are detected, by effective, proportionate and dissuasive penalties, in accordance with Council Regulation (EC, Euratom) No 2988/95 of 18 December 1995 on the protection of the European Communities financial interests, Council Regulation (Euratom, EC) No 2185/96 of 11 November 1996 concerning on-the-spot checks and inspections carried out by the Commission in order to protect the European Communities' financial interests against fraud and other irregularities and Regulation (EC) No 1073/1999 of the European Parliament and of the Council of 25 May 1999 concerning investigations conducted by the European Anti-Fraud Office (OLAF).</p>\n</li>\n<li id=\"article-37-para-2\" data-para=\"2\" data-context=\"article-37\" class=\"linkable-paragraph\">\n<p>For the purposes of the Community activities financed under this Regulation, the notion of irregularity referred to in Article 1(2) of Regulation (EC, Euratom) No 2988/95 shall mean any infringement of a provision of Community law or any breach of a contractual obligation resulting from an act or omission by an economic operator which has, or would have, the effect of prejudicing the general budget of the European Union or budgets managed by it by an unjustified item of expenditure.</p>\n</li>\n<li id=\"article-37-para-3\" data-para=\"3\" data-context=\"article-37\" class=\"linkable-paragraph\">\n<p>Any agreements and contracts resulting from this Regulation shall provide for monitoring and financial control by the Commission or any <span class=\"term-link\" data-term-id=\"representative\" tabindex=\"0\">representative</span> which it authorises and for audits by the Court of Auditors, which may be conducted on the spot if necessary.</p>\n</li>\n</ol>\n<h2 id=\"vi-final-provisions\">VI. Final Provisions</h2>\n<h3 id=\"article-38\">Article 38</h3>\n<p><strong>Technical guidelines</strong></p>\n<p>In order to facilitate the implementation of this Regulation, the Commission shall draw up non-binding guidelines in consultation with stakeholders.</p>\n<h3 id=\"article-39\">Article 39</h3>\n<p><strong>Transitional provision</strong></p>\n<p><span class=\"term-link\" data-term-id=\"accreditation\" tabindex=\"0\">Accreditation</span> certificates issued before 1 January 2010 may remain valid until the date of their expiry, but no later than 31 December 2014. This Regulation shall, however, apply in the case of their extension or renewal.</p>\n<h3 id=\"article-40\">Article 40</h3>\n<p><strong>Review and reporting</strong></p>\n<p>By 2 September 2013, the Commission shall submit to the European Parliament and to the Council a report on the application of this Regulation, of Directive 2001/95/EC and of any other relevant Community instrument addressing market surveillance. That report shall, in particular, analyse the consistency of Community rules in the field of market surveillance. If appropriate, it shall be accompanied by proposals to amend and/or consolidate the instruments concerned, in the interests of better regulation and simplification. It shall include an evaluation of the extension of the scope of Chapter III of this Regulation to all <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>.</p>\n<p>By 1 January 2013, and every five years thereafter, the Commission, in cooperation with the Member States, shall produce and submit to the European Parliament and to the Council a report on the implementation of this Regulation.</p>\n<h3 id=\"article-41\">Article 41</h3>\n<p><strong>Penalties</strong></p>\n<p>The Member States shall lay down rules on penalties for economic operators, which may include criminal sanctions for serious infringements, applicable to infringements of the provisions of this Regulation and shall take all measures necessary to ensure that they are implemented. The penalties provided for shall be effective, proportionate and dissuasive and may be increased if the relevant economic operator has previously committed a similar infringement of the provisions of this Regulation. The Member States shall notify the Commission of those provisions by 1 January 2010 and shall notify it without delay of any subsequent amendment affecting them.</p>\n<h3 id=\"article-42\">Article 42</h3>\n<p><strong>Amendment to Directive 2001/95/EC</strong></p>\n<p>Article 8(3) of Directive 2001/95/EC shall be replaced by the following:</p>\n<p>'3. In the case of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> posing a serious <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span>, the competent authorities shall with due dispatch take the appropriate measures referred to in paragraph 1(b) to (f). The existence of a serious <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> shall be determined by the Member States, assessing each individual case on its merits and taking into account the guidelines referred to in point 8 of Annex II.'.</p>\n<h3 id=\"article-43\">Article 43</h3>\n<p><strong>Repeal</strong></p>\n<p>Regulation (EEC) No 339/93 is hereby repealed with effect from 1 January 2010.</p>\n<p>References to the repealed Regulation shall be construed as references to this Regulation.</p>\n<h3 id=\"article-44\">Article 44</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Regulation shall enter into force on the 20th day after its publication in the Official Journal of the European Union.</p>\n<p>It shall apply from 1 January 2010.</p>\n<p>This Regulation shall be binding in its entirety and directly applicable in all Member States.</p>\n<p>Done at Strasbourg, 9 July 2008.</p>\n<p><em>For the European Parliament</em>\nThe President\n<strong>H.-G. PÖTTERING</strong></p>\n<p><em>For the Council</em>\nThe President\n<strong>J.-P. JOUYET</strong></p>\n<hr>\n<h2 id=\"annex-i\">ANNEX I</h2>\n<h3 id=\"requirements-applicable-to-the-body-to-be-recognised-under-article-14\">Requirements applicable to the body to be recognised under Article 14</h3>\n<ol>\n<li>\n<p>The body recognised under Article 14 of the Regulation (the body), shall be established within the Community.</p>\n</li>\n<li>\n<p>Under the body's constitution, <span class=\"term-link\" data-term-id=\"national-accreditation-body\" tabindex=\"0\">national accreditation bodies</span> from within the Community shall be entitled to be members of it, provided that they comply with the rules and objectives of the body and with the other conditions set out herein and as agreed with the Commission in the framework agreement.</p>\n</li>\n<li>\n<p>The body shall consult all relevant stakeholders.</p>\n</li>\n<li>\n<p>The body shall provide its members with <span class=\"term-link\" data-term-id=\"peer-evaluation\" tabindex=\"0\">peer evaluation</span> <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> satisfying the requirements of Articles 10 and 11.</p>\n</li>\n<li>\n<p>The body shall cooperate with the Commission in accordance with this Regulation.</p>\n</li>\n</ol>\n<hr>\n<h2 id=\"annex-ii\">ANNEX II</h2>\n<h3 id=\"ce-marking\">CE marking</h3>\n<ol>\n<li>\n<p>The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> shall consist of the initials 'CE' taking the following form:</p>\n<p><em>(The <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> graphic consists of two stylised letters \"C\" and \"E\" with specific proportions as defined in official EU documentation)</em></p>\n</li>\n<li>\n<p>If the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> is reduced or enlarged, the proportions given in the graduated drawing in paragraph 1 shall be respected.</p>\n</li>\n<li>\n<p>Where specific legislation does not impose specific dimensions, the <span class=\"term-link\" data-term-id=\"ce-marking\" tabindex=\"0\">CE marking</span> shall be at least 5 mm high.</p>\n</li>\n</ol>",
  "wordCount": 8304,
  "lastProcessed": "2026-01-21T21:45:24.947Z",
  "preambleInjected": false
}