{
  "slug": "2012-1025",
  "type": "regulation",
  "legalType": "regulation",
  "category": "referenced",
  "title": "Regulation (EU) No 1025/2012 of the European Parliament and of the Council of 25 October 2012 on European standardisation, amending Council Directives 89/686/EEC and 93/15/EEC and Directives 94/9/EC, 94/25/EC, 95/16/EC, 97/23/EC, 98/34/EC, 2004/22/EC, 2007/23/EC, 2009/23/EC and 2009/105/EC of the European Parliament and of the Council and repealing Council Decision 87/95/EEC and Decision No 1673/2006/EC of the European Parliament and of the Council",
  "shortTitle": "Standardisation Regulation (Consolidated)",
  "sidebarTitle": "Standardisation Regulation",
  "description": "Regulation (EU) No 1025/2012 of the European Parliament and of the Council of 25 October 2012 on European standardisation, amending Council Directives 89/686/EEC and 93/15/EEC and Directives 94/9/EC, 94/25/EC, 95/16/EC, 97/23/EC, 98/34/EC, 2004/22/EC, 2007/23/EC, 2009/23/EC and 2009/105/EC of the European Parliament and of the Council and repealing Council Decision 87/95/EEC and Decision No 1673/2006/EC of the European Parliament and of the Council",
  "celex": "02012R1025-20241213",
  "date": "25 October 2012",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:02012R1025-20241213",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "article-7",
      "title": "Article 7",
      "level": 3
    },
    {
      "id": "article-8",
      "title": "Article 8",
      "level": 3
    },
    {
      "id": "article-9",
      "title": "Article 9",
      "level": 3
    },
    {
      "id": "article-10",
      "title": "Article 10",
      "level": 3
    },
    {
      "id": "article-11",
      "title": "Article 11",
      "level": 3
    },
    {
      "id": "article-12",
      "title": "Article 12",
      "level": 3
    },
    {
      "id": "article-13",
      "title": "Article 13",
      "level": 3
    },
    {
      "id": "article-14",
      "title": "Article 14",
      "level": 3
    },
    {
      "id": "article-15",
      "title": "Article 15",
      "level": 3
    },
    {
      "id": "article-16",
      "title": "Article 16",
      "level": 3
    },
    {
      "id": "article-17",
      "title": "Article 17",
      "level": 3
    },
    {
      "id": "article-18",
      "title": "Article 18",
      "level": 3
    },
    {
      "id": "article-19",
      "title": "Article 19",
      "level": 3
    },
    {
      "id": "article-20",
      "title": "Article 20",
      "level": 3
    },
    {
      "id": "article-21",
      "title": "Article 21",
      "level": 3
    },
    {
      "id": "article-22",
      "title": "Article 22",
      "level": 3
    },
    {
      "id": "article-23",
      "title": "Article 23",
      "level": 3
    },
    {
      "id": "article-24",
      "title": "Article 24",
      "level": 3
    },
    {
      "id": "article-25",
      "title": "Article 25",
      "level": 3
    },
    {
      "id": "article-26",
      "title": "Article 26",
      "level": 3
    },
    {
      "id": "article-27",
      "title": "Article 27",
      "level": 3
    },
    {
      "id": "article-28",
      "title": "Article 28",
      "level": 3
    },
    {
      "id": "article-29",
      "title": "Article 29",
      "level": 3
    },
    {
      "id": "article-30",
      "title": "Article 30",
      "level": 3
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EUROPEAN UNION,\n\n*Having regard to the Treaty on the Functioning of the European Union, and in particular Article 114 thereof,*\n\n*Having regard to the opinion of the European Economic and Social Committee (1),*\n\n*Acting in accordance with the ordinary legislative procedure (2),*\n\n*Having regard to the proposal from the European Commission,*\n\nWhereas:\n\n## Recitals\n\n- (1) The primary objective of standardisation is the definition of voluntary technical or quality specifications with which current or future products, production processes or services may comply. Standardisation can cover various issues, such as standardisation of different grades or sizes of a particular product or technical specifications in product or services markets where compatibility and interoperability with other products or systems are essential.\n\n- (2) European standardisation is organised by and for the stakeholders concerned based on national representation (the European Committee for Standardisation (CEN) and the European Committee for Electrotechnical Standardisation (Cenelec)) and direct participation (the European Telecommunications Standards Institute (ETSI)), and is founded on the principles recognised by the World Trade Organisation (WTO) in the field of standardisation, namely coherence, transparency, openness, consensus, voluntary application, independence from special interests and efficiency (‘the founding principles’). In accordance with the founding principles, it is important that all relevant interested parties, including public authorities and small and medium-sized enterprises (SMEs), are appropriately involved in the national and European standardisation process. National standardisation bodies should also encourage and facilitate the participation of stakeholders.\n\n- (3) European standardisation also helps to boost the competitiveness of enterprises by facilitating in particular the free movement of goods and services, network interoperability, means of communication, technological development and innovation. European standardisation reinforces the global competitiveness of European industry especially when established in coordination with the international standardisation bodies, namely the International Organisation for Standardisation (ISO), the International Electrotechnical Commission (IEC) and the International Telecommunication Union (ITU). Standards produce significant positive economic effects, for example by promoting economic interpenetration on the internal market and encouraging the development of new and improved products or markets and improved supply conditions. Standards thus normally increase competition and lower output and sales costs, benefiting economies as a whole and consumers in particular. Standards may maintain and enhance quality, provide information and ensure interoperability and compatibility, thereby increasing safety and value for consumers.\n\n- (4) European standards are adopted by the European standardisation organisations, namely CEN, Cenelec and ETSI.\n\n- (5) European standards play a very important role within the internal market, for instance through the use of harmonised standards in the presumption of conformity of products to be made available on the market with the essential requirements relating to those products laid down in the relevant Union harmonisation legislation. Those requirements should be precisely defined in order to avoid misinterpretation on the part of the European standardisation organisations.\n\n- (6) Standardisation plays an increasingly important role in international trade and the opening-up of markets. The Union should seek to promote cooperation between European standardisation organisations and international standardisation bodies. The Union should also promote bilateral approaches with third countries to coordinate standardisation efforts and promote European standards, for instance when negotiating agreements or by seconding standardisation experts to third countries. Furthermore the Union should encourage contact between European standardisation organisations and private forums and consortia, while maintaining the primacy of European standardisation.\n\n- (7) European standardisation is governed by a specific legal framework consisting of three different legal acts, namely Directive 98/34/EC of the European Parliament and of the Council of 22 June 1998 laying down a procedure for the provision of information in the field of technical standards and regulations and of rules on Information Society services (3), Decision No 1673/2006/EC of the European Parliament and of the Council of 24 October 2006 on the financing of European standardisation (4) and Council Decision 87/95/EEC of 22 December 1986 on standardisation in the field of information technology and telecommunications (5). However, the current legal framework is no longer up to date with developments in European standardisation over recent decades. Therefore, the current legal framework should be simplified and adapted in order to cover new aspects of standardisation to reflect those latest developments and future challenges in European standardisation. That relates in particular to the increased development of standards for services and the evolution of standardisation deliverables other than formal standards.\n\n- (8) The European Parliament’s Resolution of 21 October 2010 on the future of European standardisation (6), as well as the report of the Expert Panel for the Review of the European Standardization System (Express) of February 2010 entitled ‘Standardization for a competitive and innovative Europe: a vision for 2020’, have set out an important number of strategic recommendations regarding the review of the European standardisation system.\n\n- (9) In order to ensure the effectiveness of standards and standardisation as policy tools for the Union, it is necessary to have an effective and efficient standardisation system which provides a flexible and transparent platform for consensus building between all participants and which is financially viable.\n\n- (10) Directive 2006/123/EC of the European Parliament and of the Council of 12 December 2006 on services in the internal market (7) establishes general provisions facilitating the exercise of the freedom of establishment for service providers and the free movement of services, while maintaining a high quality of services. It obliges the Member States to encourage, in cooperation with the Commission, the development of voluntary European standards with the aim of facilitating compatibility between services supplied by providers in different Member States, the provision of information to the recipient and the quality of service provision. However, Directive 98/34/EC only applies to standards for products while standards for services are not expressly covered by it. Furthermore, the delineation between services and goods is becoming less relevant in the reality of the internal market. In practice, it is not always possible to clearly distinguish standards for products from standards for services. Many standards for products have a service component while standards for services often also partly relate to products. Thus, it is necessary to adapt the current legal framework to these new circumstances by extending its scope to standards for services.\n\n- (11) Like other standards, standards for services are voluntary and should be market-driven, whereby the needs of the economic operators and stakeholders directly or indirectly affected by such standards prevail, and should take into account the public interest and be based on the founding principles, including consensus. They should primarily focus on services linked to products and processes.\n\n- (12) The legal framework allowing the Commission to request one or several European standardisation organisations to draft a European standard or European standardisation deliverable for services should be applied while fully respecting the distribution of competences between the Union and the Member States as laid down in the Treaties. This concerns in particular Articles 14, 151, 152, 153, 165, 166 and 168 of the Treaty on the Functioning of the European Union (TFEU) and Protocol (No 26) on Services of General Interest annexed to the Treaty on European Union (TEU) and to the TFEU in accordance with which it remains the exclusive competence of the Member States to define the fundamental principles of their social security, vocational training and health systems and to shape the framework conditions for the management, financing, organisation and delivery of the services supplied within those systems, including - without prejudice to Article 168(4) TFEU and to Directive 2005/36/EC of the European Parliament and of the Council of 7 September 2005 on the recognition of professional qualifications (8) - the definition of requirements, quality and safety standards applicable to them. The Commission should not, by means of such a request, affect the right to negotiate, conclude and enforce collective agreements and to take industrial action in accordance with national law and practices which respect Union law.\n\n- (13) The European standardisation organisations are subject to competition law to the extent that they can be considered to be an undertaking or an association of undertakings within the meaning of Articles 101 and 102 TFEU.\n\n- (14) Within the Union, national standards are adopted by national standardisation bodies which could lead to conflicting standards and technical impediments in the internal market. Therefore, it is necessary for the internal market and for the effectiveness of standardisation within the Union to confirm the existing regular exchange of information between the national standardisation bodies, the European standardisation organisations and the Commission, about their current and future standardisation activities as well as the standstill principle applicable to the national standardisation bodies within the framework of the European standardisation organisations which provides for the withdrawal of national standards after the publication of a new European standard. The national standardisation bodies and European standardisation organisations should also observe the provisions on exchange of information in Annex 3 to the Agreement on Technical Barriers to Trade (9).\n\n- (15) The Member States’ obligation to notify the Commission of their national standardisation bodies should not require the adoption of a specific national legislation for the purposes of recognition of those bodies.\n\n- (16) The regular exchange of information between the national standardisation bodies, the European standardisation organisations and the Commission should not prevent national standardisation bodies from complying with other obligations and commitments, and in particular with Annex 3 to the Agreement on Technical Barriers to Trade.\n\n- (17) The representation of societal interests and societal stakeholders in European standardisation activities refers to the activities of organisations and parties representing interests of greater societal relevance, for instance environmental, consumer interests or employee interests. However, the representation of social interests and social stakeholders in European standardisation activities refers particularly to the activities of organisations and parties representing employees and workers’ basic rights, for instance trade unions.\n\n- (18) In order to speed up the decision-making process, national standardisation bodies and European standardisation organisations should facilitate accessible information on their activities through the promotion of the use of information and communication technologies (ICT) in their respective standardisation systems, for example by providing to all relevant stakeholders an easy-to-use online consultation mechanism for the submission of comments on draft standards and by organising virtual meetings, including by means of web conferencing or video conferencing, of technical committees.\n\n- (19) Standards can contribute to helping Union policy address the major societal challenges such as climate change, sustainable resource use, innovation, ageing population, integration of people with disabilities, consumer protection, workers’ safety and working conditions. By driving the development of European or international standards for goods and technologies in the expanding markets in those areas, the Union could create a competitive advantage for its enterprises and facilitate trade, in particular for SMEs, which account for a large part of European enterprises.\n\n- (20) Standards are important tools for the competitiveness of undertakings and especially SMEs, whose participation in the standardisation process is important for technological progress in the Union. Therefore it is necessary that the standardisation framework encourage SMEs to actively participate in and provide their innovative technology solutions to standardisation efforts. This includes improving their participation at national level where they can be more effective due to lower costs and lack of linguistic barriers. Consequently this Regulation should improve representation and participation of SMEs in both national and European technical committees and should facilitate their effective access to and awareness of standards.\n\n- (21) European standards are of vital interest for the competitiveness of SMEs which, however, are in some cases under-represented in European standardisation activities. Thus, this Regulation should encourage and facilitate appropriate representation and participation of SMEs in the European standardisation process by an entity that is effectively in contact with, and duly representative of, SMEs and organisations representing SMEs at national level.\n\n- (22) Standards can have a broad impact on society, in particular on the safety and well-being of citizens, the efficiency of networks, the environment, workers’ safety and working conditions, accessibility and other public policy fields. Therefore, it is necessary to ensure that the role and the input of societal stakeholders in the development of standards are strengthened, through the reinforced support of organisations representing consumers and environmental and social interests.\n\n- (23) The obligation of the European standardisation organisations to encourage and facilitate representation and effective participation of all relevant stakeholders does not entail any voting rights for these stakeholders unless such voting rights are prescribed by the internal rules of procedure of the European standardisation organisations.\n\n- (24) The European standardisation system should also fully take into account the United Nations Convention on the Rights of Persons with Disabilities (10). It is therefore important that organisations representing the interests of consumers sufficiently represent and include the interests of people with disabilities. In addition, the participation of people with disabilities in the standardisation process should be facilitated by all available means.\n\n- (25) Due to the importance of standardisation as a tool to support Union legislation and policies and in order to avoid ex-post objections to and modifications of harmonised standards, it is important that public authorities participate in standardisation at all stages of the development of those standards where they may be involved and especially in the areas covered by Union harmonisation legislation for products.\n\n- (26) Standards should take into account environmental impacts throughout the life cycle of products and services. Important and publicly available tools for evaluating such impacts throughout the life cycle have been developed by the Commission’s Joint Research Centre (JRC). Thus, this Regulation should ensure that the JRC can play an active role in the European standardisation system.\n\n- (27) The viability of the cooperation between the Commission and the European standardisation system depends on careful planning of future requests for the development of standards. This planning could be improved, in particular through the input of interested parties, including national market surveillance authorities, by introducing mechanisms for collecting opinions and facilitating the exchange of information among all interested parties. Since Directive 98/34/EC already provides for the possibility to request the European standardisation organisations to develop European standards, it is appropriate to put in place a better and more transparent planning in an annual work programme which should contain an overview of all requests for standards which the Commission intends to submit to European standardisation organisations. It is necessary to ensure a high level of cooperation between the European standardisation organisations and the European stakeholder organisations receiving Union financing in accordance with this Regulation and the Commission in the establishment of its annual Union work programme for standardisation and in the preparation of requests for standards in order to analyse the market relevance of the proposed subject matter and the policy objectives set by the legislator, and to allow the European standardisation organisations to respond more quickly to the requested standardisation activities.\n\n- (28) Before bringing a matter regarding requests for European standards or European standardisation deliverables, or objections to a harmonised standard before the committee set up by this Regulation, the Commission should consult experts of the Member States, for instance through the involvement of committees set up by the corresponding Union legislation or by other forms of consultation of sectoral experts, where such committees do not exist.\n\n- (29) Several directives harmonising the conditions for the marketing of products specify that the Commission may request the adoption, by the European standardisation organisations, of harmonised standards on the basis of which conformity with the applicable essential requirements is presumed. However, many of those directives contain a wide variety of provisions on objections to these standards when the latter do not, or do not entirely, cover all applicable requirements. Diverging provisions which lead to uncertainty for economic operators and European standardisation organisations are in particular contained in Council Directive 89/686/EEC of 21 December 1989 on the approximation of the laws of the Member States relating to personal protective equipment (11), Council Directive 93/15/EEC of 5 April 1993 on the harmonisation of the provisions relating to the placing on the market and supervision of explosives for civil uses (12), Directive 94/9/EC of the European Parliament and the Council of 23 March 1994 on the approximation of the laws of the Member States concerning equipment and protective systems intended for use in potentially explosive atmospheres (13), Directive 94/25/EC of the European Parliament and of the Council of 16 June 1994 on the approximation of the laws, regulations and administrative provisions of the Member States relating to recreational craft (14), European Parliament and Council Directive 95/16/EC of 29 June 1995 on the approximation of the laws of the Member States relating to lifts (15), Directive 97/23/EC of the European Parliament and of the Council of 29 May 1997 on the approximation of the laws of the Member States concerning pressure equipment (16), Directive 2004/22/EC of the European Parliament and of the Council of 31 March 2004 on measuring instruments (17), Directive 2007/23/EC of the European Parliament and of the Council of 23 May 2007 on the placing on the market of pyrotechnic articles (18), Directive 2009/23/EC of the European Parliament and of the Council of23 April 2009 on non-automatic weighing instruments (19) and Directive 2009/105/EC of the European Parliament and of the Council of 16 September 2009 relating to simple pressure vessels (20). Therefore, it is necessary to include in this Regulation the uniform procedure provided for in Decision No 768/2008/EC of the European Parliament and of the Council of 9 July 2008 on a common framework for the marketing of products (21), delete the relevant provisions in those Directives and extend to the European Parliament the right to object to a harmonised standard in accordance with this Regulation.\n\n- (30) Public authorities should make best use of the full range of relevant technical specifications when procuring hardware, software and information technology services, for example by selecting technical specifications which can be implemented by all interested suppliers, allowing for more competition and reduced risk of lock-in. Directive 2004/17/EC of the European Parliament and of the Council of 31 March 2004 coordinating the procurement procedures of entities operating in the water, energy, transport and postal services sectors (22), Directive 2004/18/EC of the European Parliament and of the Council of 31 March 2004 on the coordination of procedures for the award of public works contracts, public supply contracts and public service contracts (23), Directive 2009/81/EC of the European Parliament and of the Council of 13 July 2009 on the coordination of procedures for the award of certain works contracts, supply contracts and service contracts by contracting authorities or entities in the fields of defence and security (24) and Commission Regulation (EC, Euratom) No 2342/2002 of 23 December 2002 laying down detailed rules for the implementation of Council Regulation (EC, Euratom) No 1605/2002 on the Financial Regulation applicable to the general budget of the European Communities (25) specify that technical specifications in public procurement should be formulated by reference to national standards transposing European standards, European technical approvals, common technical specifications, international standards, other technical reference systems established by the European standardisation organisations or - when these do not exist - to national standards, national technical approvals or national technical specifications relating to the design, calculation and execution of the works and use of the products, or equivalent. ICT technical specifications, however, are often developed by other standard developing organisations and do not fall in any of the categories of standards and approvals laid down in Directives 2004/17/EC, 2004/18/EC or 2009/81/EC or Regulation (EC, Euratom) No 2342/2002. Therefore, it is necessary to provide for the possibility that technical specifications for public procurement could refer to ICT technical specifications, in order to respond to the fast evolution in the field of ICT, facilitate the provision of cross-border services, encourage competition and promote interoperability and innovation.\n\n- (31) Technical specifications not adopted by European standardisation organisations do not hold an equivalent status to European standards. Some ICT technical specifications are not developed in accordance with the founding principles. Therefore, this Regulation should lay down a procedure for the identification of ICT technical specifications that could be referenced in public procurement, involving a broad consultation of a large spectrum of stakeholders, including the European standardisation organisations, enterprises and public authorities. This Regulation should also lay down requirements, in the form of a list of criteria, for such technical specifications and their associated development processes. The requirements for the identification of ICT technical specifications should ensure that public policy objectives and societal needs are respected, and should be based on the founding principles.\n\n- (32) In order to further innovation and competition, the identification of a particular technical specification should not disqualify a competing technical specification from being identified in accordance with the provisions of this Regulation. Any identification should be subject to the criteria being fulfilled and to the technical specification having achieved a significant level of market acceptance.\n\n- (33) The identified ICT technical specifications could contribute to the implementation of Decision No 922/2009/EC of the European Parliament and of the Council of 16 September 2009 on interoperability solutions for European public administrations (ISA) (26) which establishes, for the period 2010-2015, a programme on interoperability solutions for European public administrations and institutions and bodies of the Union, providing common and shared solutions facilitating interoperability.\n\n- (34) Situations may arise in the field of ICT where it is appropriate to encourage the use of, or require compliance, with relevant standards at Union level in order to ensure interoperability in the single market and to improve freedom of choice for users. In other circumstances, it may also happen that specified European standards no longer meet consumers’ needs or are hampering technological development. For these reasons, Directive 2002/21/EC of the European Parliament and of the Council of 7 March 2002 on a common regulatory framework for electronic communications networks and services (27) enables the Commission, where necessary, to request European standardisation organisations to draw up standards, to establish and publish in the Official Journal of the European Union a list of standards or specifications with the view to encourage their use, or to make their implementation compulsory, or to remove standards or specifications from that list.\n\n- (35) This Regulation should not prevent European standardisation organisations from continuing to develop standards in the field of ICT and to increase their cooperation with other standard developing bodies, especially in the field of ICT, in order to ensure coherence and avoid fragmentation or duplication during implementation of standards and specifications.\n\n- (36) The procedure for identification of ICT technical specifications provided for in this Regulation should not undermine the coherence of the European standardisation system. Therefore, this Regulation should also lay down the conditions under which it can be considered that a technical specification does not conflict with other European standards.\n\n- (37) Before identifying ICT technical specifications which may be eligible for referencing in public procurement, the Multi Stakeholder Platform established by the Commission Decision of 28 November 2011 (28) should be used as a forum for consultation of European and national stakeholders, European standardisation organisations and Member States in order to ensure legitimacy of the process.\n\n- (38) Decision No 1673/2006/EC establishes the rules concerning the contribution of the Union to the financing of European standardisation in order to ensure that European standards and other European standardisation deliverables are developed and revised in support of the objectives, legislation and policies of the Union. It is appropriate, for the purpose of administrative and budgetary simplification, to incorporate the provisions of that Decision into this Regulation and to use wherever possible the least burdensome procedures.\n\n- (39) In view of the very broad field of involvement of European standardisation in support of Union legislation and policies and the different types of standardisation activity, it is necessary to provide for different financing arrangements. This mainly concerns grants without calls for proposals to the European standardisation organisations and national standardisation bodies in accordance with the second subparagraph of Article 110(1) of Council Regulation (EC, Euratom) No 1605/2002 of 25 June 2002 on the Financial Regulation applicable to the general budget of the European Communities (29) and point (d) of Article 168(1) of Regulation (EC, Euratom) No 2342/2002. Furthermore, the same provisions should apply to those bodies which, whilst not recognised as European standardisation organisations in this Regulation, have been mandated in a basic act and have been entrusted with carrying out preliminary work in support of European standardisation in cooperation with the European standardisation organisations.\n\n- (40) Inasmuch as European standardisation organisations provide ongoing support for Union activities, they should have effective and efficient central secretariats. The Commission should therefore be allowed to provide grants to those organisations that are pursuing an objective of general European interest without applying, in the case of operating grants, the principle of annual reduction provided for in Article 113(2) of Regulation (EC, Euratom) No 1605/2002.\n\n- (41) Decision No 1639/2006/EC of the European Parliament and of the Council of 24 October 2006 establishing a Competitiveness and Innovation Framework Programme (2007 to 2013) (30), Decision No 1926/2006/EC of the European Parliament and of the Council of 18 December 2006 establishing a programme of Community action in the field of consumer policy (2007-2013) (31) and Regulation (EC) No 614/2007 of the European Parliament and of the Council of 23 May 2007 concerning the Financial Instrument for the Environment (LIFE+) (32) already provide for the possibility of financial support of European organisations representing SMEs, consumers and environmental interests in standardisation, while specific grants are paid to European organisations representing social interests in standardisation. The financing under Decision No 1639/2006/EC, Decision No 1926/2006/EC and Regulation (EC) No 614/2007 will end on 31 December 2013. It is essential for the development of European standardisation to continue fostering and encouraging the active participation of European organisations representing SMEs, consumers and environmental and social interests. Such organisations pursue an aim of general European interest and constitute, by virtue of the specific mandate that national non-profit organisations have given them, a European network representing non-profit organisations active in the Member States and promoting principles and policies consistent with the objectives of the Treaties. Because of the context in which they operate and their statutory objectives, European organisations representing SMEs, consumers and environmental and social interests in European standardisation have a permanent role which is essential for Union objectives and policies. Therefore, the Commission should be in a position to continue providing grants to those organisations without applying, in the case of operating grants, the principle of annual reduction provided for in Article 113(2) of Regulation (EC, Euratom) No 1605/2002.\n\n- (42) The financing of standardisation activities should also be capable of covering preliminary or ancillary activities in connection with the establishment of European standards or European standardisation deliverables for products and for services. This is necessary primarily for work involving research, the preparation of preliminary documents for legislation, inter-laboratory tests and the validation or evaluation of standards. The promotion of standardisation at European and international level should also continue through programmes relating to the technical assistance to, and cooperation with, third countries. With a view to improving market access and boosting the competitiveness of enterprises in the Union, it should be possible to give grants to other bodies through calls for proposals or, where necessary, by awarding contracts.\n\n- (43) Union financing should seek to establish European standards or European standardisation deliverables for products and for services, to facilitate their use by enterprises through the enhanced support for their translation into the various official Union languages, in order to allow SMEs to fully benefit from the understanding and application of the European standards, to strengthen the cohesion of the European standardisation system and to ensure fair and transparent access to European standards for all market players throughout the Union. This is especially important in cases where the use of standards enables compliance with relevant Union legislation.\n\n- (44) In order to ensure the effective application of this Regulation, there should be the possibility of using the requisite expertise, particularly with regard to auditing and financial management, as well as administrative support resources capable of facilitating implementation, and of evaluating on a regular basis the relevance of the activities receiving Union financing in order to ensure their usefulness and impact.\n\n- (45) Appropriate measures should also be taken to avoid fraud and irregularities and to recover funds unduly paid in accordance with Council Regulations (EC, Euratom) No 2988/95 of 18 December 1995 on the protection of the European Communities financial interests (33) and (Euratom, EC) No 2185/96 of 11 November 1996 concerning on-the-spot checks and inspections carried out by the Commission in order to protect the European Communities’ financial interests against fraud and other irregularities (34) and Regulation (EC) No 1073/1999 of the European Parliament and of the Council of 25 May 1999 concerning investigations conducted by the European Anti-Fraud Office (OLAF) (35).\n\n- (46) In order to update the list of European standardisation organisations and to adapt the criteria for organisations representing SMEs and societal stakeholders to further developments as regards their non-profit making nature and representativity, the power to adopt acts in accordance with Article 290 TFEU should be delegated to the Commission in respect of amendments to the Annexes to this Regulation. It is of particular importance that the Commission carry out appropriate consultations during its preparatory work, including at expert level. The Commission, when preparing and drawing up delegated acts, should ensure a simultaneous, timely and appropriate transmission of relevant documents to the European Parliament and to the Council.\n\n- (47) The committee set up by this Regulation should assist the Commission in all matters related to the implementation of this Regulation, having due regard for the views of sectoral experts.\n\n- (48) In order to ensure uniform conditions for the implementation of this Regulation, implementing powers should be conferred on the Commission. Those powers should be exercised in accordance with Regulation (EU) No 182/2011 of the European Parliament and of the Council of 16 February 2011 laying down the rules and general principles concerning mechanisms for control by Member States of the Commission’s exercise of implementing powers (36).\n\n- (49) The advisory procedure should be used for the adoption of implementing acts with respect to the objections to harmonised standards and where the references to the harmonised standard concerned have not yet been published in the Official Journal of the European Union, given that the relevant standard has not yet led to the presumption of conformity with the essential requirements set out in the applicable Union harmonisation legislation.\n\n- (50) The examination procedure should be used for each standardisation request submitted to European standardisation organisations and the adoption of implementing acts with respect to the objections to harmonised standards and where the references to the harmonised standard concerned have already been published in the Official Journal of the European Union, given that such decision could have consequences on the presumption of conformity with the applicable essential requirements.\n\n- (51) In order to achieve the main objectives of this Regulation and to facilitate speedy decision-making procedures as well as reducing the overall development time for standards, use should be made as far as possible of the procedural measures provided for in Regulation (EU) No 182/2011, which enables the chair of the relevant committee to lay down a time limit within which the committee should deliver its opinion, according to the urgency of the matter. Moreover, where justified, it should be possible for the opinion of the committee to be obtained by written procedure, and silence on the part of the committee member should be regarded as tacit agreement.\n\n- (52) Since the objectives of this Regulation, namely to ensure the effectiveness and efficiency of standards and standardisation as policy tools for the Union through cooperation between European standardisation organisations, national standardisation bodies, Member States and the Commission, the establishment of European standards and European standardisation deliverables for products and for services in support of Union legislation and policies, the identification of ICT technical specifications eligible for referencing, the financing of European standardisation and stakeholder participation in European standardisation cannot be sufficiently achieved by the Member States and can, therefore, by reason of their effect, be better achieved at the Union level, the Union may adopt measures, in accordance with the principle of subsidiarity as set out in Article 5 TEU. In accordance with the principle of proportionality, as set out in that Article, this Regulation does not go beyond what is necessary in order to achieve those objectives.\n\n- (53) Directives 89/686/EEC, 93/15/EEC, 94/9/EC, 94/25/EC, 95/16/EC, 97/23/EC, 98/34/EC, 2004/22/EC, 2007/23/EC, 2009/23/EC and 2009/105/EC should therefore be amended accordingly.\n\n- (54) Decision No 1673/2006/EC and Decision 87/95/EEC should be repealed,\n\nHAVE ADOPTED THIS REGULATION:\n\n## Enacting Terms\n\n### Article 1\n\n**Subject matter**\n\nThis Regulation establishes rules with regard to the cooperation between European standardisation organisations, national standardisation bodies, Member States and the Commission, the establishment of European standards and European standardisation deliverables for products and for services in support of Union legislation and policies, the identification of ICT technical specifications eligible for referencing, the financing of European standardisation and stakeholder participation in European standardisation.\n\n\n### Article 2\n\n**Definitions**\n\nFor the purposes of this Regulation, the following definitions shall apply:\n\n- (1) ‘standard’ means a technical specification, adopted by a recognised standardisation body, for repeated or continuous application, with which compliance is not compulsory, and which is one of the following: (a) ‘international standard’ means a standard adopted by an international standardisation body; (b) ‘European standard’ means a standard adopted by a European standardisation organisation; (c) ‘harmonised standard’ means a European standard adopted on the basis of a request made by the Commission for the application of Union harmonisation legislation; (d) ‘national standard’ means a standard adopted by a national standardisation body;\n- (a) ‘international standard’ means a standard adopted by an international standardisation body;\n- (b) ‘European standard’ means a standard adopted by a European standardisation organisation;\n- (c) ‘harmonised standard’ means a European standard adopted on the basis of a request made by the Commission for the application of Union harmonisation legislation;\n- (d) ‘national standard’ means a standard adopted by a national standardisation body;\n- (2) ‘European standardisation deliverable’ means any other technical specification than a European standard, adopted by a European standardisation organisation for repeated or continuous application and with which compliance is not compulsory;\n- (3) ‘draft standard’ means a document containing the text of the technical specifications concerning a given subject, which is being considered for adoption in accordance with the relevant standards procedure, as that document stands after the preparatory work and as circulated for public comment or scrutiny;\n- (4) ‘technical specification’ means a document that prescribes technical requirements to be fulfilled by a product, process, service or system and which lays down one or more of the following: (a) the characteristics required of a product including levels of quality, performance, interoperability, environmental protection, health, safety or dimensions, and including the requirements applicable to the product as regards the name under which the product is sold, terminology, symbols, testing and test methods, packaging, marking or labelling and conformity assessment procedures; (b) production methods and processes used in respect of agricultural products as defined in Article 38(1) TFEU, products intended for human and animal consumption, and medicinal products, as well as production methods and processes relating to other products, where these have an effect on their characteristics; (c) the characteristics required of a service including levels of quality, performance, interoperability, environmental protection, health or safety, and including the requirements applicable to the provider as regards the information to be made available to the recipient, as specified in Article 22(1) to (3) of Directive 2006/123/EC; (d) the methods and the criteria for assessing the performance of construction products, as defined in point 1 of Article 2 of Regulation (EU) No 305/2011 of the European Parliament and of the Council of 9 March 2011 laying down harmonised conditions for the marketing of construction products ( 1 ), in relation to their essential characteristics;\n- (a) the characteristics required of a product including levels of quality, performance, interoperability, environmental protection, health, safety or dimensions, and including the requirements applicable to the product as regards the name under which the product is sold, terminology, symbols, testing and test methods, packaging, marking or labelling and conformity assessment procedures;\n- (b) production methods and processes used in respect of agricultural products as defined in Article 38(1) TFEU, products intended for human and animal consumption, and medicinal products, as well as production methods and processes relating to other products, where these have an effect on their characteristics;\n- (c) the characteristics required of a service including levels of quality, performance, interoperability, environmental protection, health or safety, and including the requirements applicable to the provider as regards the information to be made available to the recipient, as specified in Article 22(1) to (3) of Directive 2006/123/EC;\n- (d) the methods and the criteria for assessing the performance of construction products, as defined in point 1 of Article 2 of Regulation (EU) No 305/2011 of the European Parliament and of the Council of 9 March 2011 laying down harmonised conditions for the marketing of construction products ( 1 ), in relation to their essential characteristics;\n- (5) ‘ICT technical specification’ means a technical specification in the field of information and communication technologies;\n- (6) ‘product’ means any industrially manufactured product and any agricultural product, including fish products;\n- (7) ‘service’ means any self-employed economic activity normally provided for remuneration, as defined in Article 57 TFEU;\n- (8) ‘European standardisation organisation’ means an organisation listed in Annex I;\n- (9) ‘international standardisation body’ means the International Organisation for Standardisation (ISO), the International Electrotechnical Commission (IEC) and the International Telecommunication Union (ITU);\n- (10) ‘national standardisation body’ means a body notified to the Commission by a Member State in accordance with Article 27 of this Regulation.\n\n### Article 3\n\n**Transparency of work programmes of standardisation bodies**\n\n1. At least once a year, each European standardisation organisation and national standardisation body shall establish its work programme. That work programme shall contain information on the standards and European standardisation deliverables which a European standardisation organisation or national standardisation body intends to prepare or amend, which it is preparing or amending and which it has adopted in the period of the preceding work programme, unless these are identical or equivalent transpositions of international or European standards.\n\n2. The work programme shall indicate, in respect of each standard and European standardisation deliverable: (a) the subject matter; (b) the stage attained in the development of the standards and European standardisation deliverables; (c) the references of any international standards taken as a basis.\n\n3. Each European standardisation organisation and national standardisation body shall make its work programme available on its website or any other publicly available website, as well as make a notice of the existence of the work programme available in a national or, where appropriate, European publication of standardisation activities.\n\n4. No later than at the time of publication of its work programme, each European standardisation organisation and national standardisation body shall notify the existence thereof to the other European standardisation organisations and national standardisation bodies and to the Commission. The Commission shall make that information available to the Member States via the committee referred to in Article 22.\n\n5. National standardisation bodies may not object to a subject for standardisation in their work programme being considered at European level in accordance with the rules laid down by the European standardisation organisations and may not undertake any action which could prejudice a decision in this regard.\n\n6. During the preparation of a harmonised standard or after its approval, national standardisation bodies shall not take any action which could prejudice the harmonisation intended and, in particular, shall not publish in the field in question a new or revised national standard which is not completely in line with an existing harmonised standard. After publication of a new harmonised standard, all conflicting national standards shall be withdrawn within a reasonable deadline.\n\n- (a) the subject matter;\n- (b) the stage attained in the development of the standards and European standardisation deliverables;\n- (c) the references of any international standards taken as a basis.\n\n### Article 4\n\n**Transparency of standards**\n\n1. Each European standardisation organisation and national standardisation body shall send at least in electronic form any draft national standard, European standard or European standardisation deliverable to other European standardisation organisations, national standardisation bodies or the Commission, upon their request.\n\n2. Each European standardisation organisation and national standardisation body shall within three months reply to, and take due account of, any comments received from any other European standardisation organisation, national standardisation body or the Commission with respect to any draft referred to in paragraph 1.\n\n3. When a national standardisation body receives comments indicating that the draft standard would have a negative impact on the internal market, it shall consult the European standardisation organisations and the Commission before adopting it.\n\n4. National standardisation bodies shall: (a) ensure access to draft national standards in such a way that all relevant parties in particular those established in other Member States have the opportunity to submit comments; (b) allow other national standardisation bodies to be involved passively or actively, by sending an observer, in the planned activities.\n\n- (a) ensure access to draft national standards in such a way that all relevant parties in particular those established in other Member States have the opportunity to submit comments;\n- (b) allow other national standardisation bodies to be involved passively or actively, by sending an observer, in the planned activities.\n\n### Article 5\n\n**Stakeholder participation in European standardisation**\n\n1. European standardisation organisations shall encourage and facilitate an appropriate representation and effective participation of all relevant stakeholders, including SMEs, consumer organisations and environmental and social stakeholders in their standardisation activities. They shall in particular encourage and facilitate such representation and participation through the European stakeholder organisations receiving Union financing in accordance with this Regulation at the policy development level and at the following stages of the development of European standards or European standardisation deliverables: (a) the proposal and acceptance of new work items; (b) the technical discussion on proposals; (c) the submission of comments on drafts; (d) the revision of existing European standards or European standardisation deliverables; (e) the dissemination of information of, and awareness-building about, adopted European standards or European standardisation deliverables.\n\n2. In addition to the collaboration with market surveillance authorities in the Member States, research facilities of the Commission and the European stakeholder organisations receiving Union financing in accordance with this Regulation, European standardisation organisations shall encourage and facilitate appropriate representation, at technical level, of undertakings, research centres, universities and other legal entities, in standardisation activities concerning an emerging area with significant policy or technical innovation implications, if the legal entities concerned participated in a project that is related to that area and that is funded by the Union under a multiannual framework programme for activities in the area of research, innovation and technological development, adopted pursuant to Article 182 TFEU.\n\n- (a) the proposal and acceptance of new work items;\n- (b) the technical discussion on proposals;\n- (c) the submission of comments on drafts;\n- (d) the revision of existing European standards or European standardisation deliverables;\n- (e) the dissemination of information of, and awareness-building about, adopted European standards or European standardisation deliverables.\n\n### Article 6\n\n**Access of SMEs to standards**\n\n1. National standardisation bodies shall encourage and facilitate the access of SMEs to standards and standards development processes in order to reach a higher level of participation in the standardisation system, for instance by: (a) identifying, in their annual work programmes, the standardisation projects, which are of particular interests to SMEs; (b) giving access to standardisation activities without obliging SMEs to become a member of a national standardisation body; (c) providing free access or special rates to participate in standardisation activities; (d) providing free access to draft standards; (e) making available free of charge on their website abstracts of standards; (f) applying special rates for the provision of standards or providing bundles of standards at a reduced price.\n\n2. National standardisation bodies shall exchange best practices aiming to enhance the participation of SMEs in standardisation activities and to increase and facilitate the use of standards by SMEs.\n\n3. National standardisation bodies shall send annual reports to the European standardisation organisations with regards to their activities in paragraphs 1 and 2 and all other measures to improve conditions for SMEs to use standards and to participate in the standards development process. The national standardisation bodies shall publish those reports on their websites.\n\n- (a) identifying, in their annual work programmes, the standardisation projects, which are of particular interests to SMEs;\n- (b) giving access to standardisation activities without obliging SMEs to become a member of a national standardisation body;\n- (c) providing free access or special rates to participate in standardisation activities;\n- (d) providing free access to draft standards;\n- (e) making available free of charge on their website abstracts of standards;\n- (f) applying special rates for the provision of standards or providing bundles of standards at a reduced price.\n\n### Article 7\n\n**Participation of public authorities in European standardisation**\n\nMember States shall, where appropriate, encourage participation of public authorities, including market surveillance authorities, in national standardisation activities aimed at the development or revision of standards requested by the Commission in accordance with Article 10.\n\n\n### Article 8\n\n**The annual Union work programme for European standardisation**\n\n1. The Commission shall adopt an annual Union work programme for European standardisation which shall identify strategic priorities for European standardisation, taking into account Union long-term strategies for growth. It shall indicate the European standards and European standardisation deliverables that the Commission intends to request from the European standardisation organisations in accordance with Article 10.\n\n2. The annual Union work programme for European standardisation shall define the specific objectives and policies for the European standards and European standardisation deliverables that the Commission intends to request from the European standardisation organisations in accordance with Article 10. In cases of urgency the Commission can issue requests without prior indication.\n\n3. The annual Union work programme for European standardisation shall also include objectives for the international dimension of European standardisation, in support of Union legislation and policies.\n\n4. The annual Union work programme for European standardisation shall be adopted after having conducted a broad consultation of relevant stakeholders, including European standardisation organisations and European stakeholder organisations receiving Union financing in accordance with this Regulation, and Member States via the committee referred to in Article 22 of this Regulation.\n\n5. After its adoption, the Commission shall make the annual Union work programme for European standardisation available on its website.\n\n\n### Article 9\n\n**Cooperation with research facilities**\n\nThe Commission’s research facilities shall contribute to the preparation of the annual Union work programme for European standardisation referred to in Article 8 and provide European standardisation organisations with scientific input, in their areas of expertise, to ensure that European standards take into account economic competitiveness and societal needs such as environmental sustainability and safety and security concerns.\n\n\n### Article 10\n\n**Standardisation requests to European standardisation organisations**\n\n1. The Commission may, within the limitations of the competences laid down in the Treaties, request that one or more European standardisation organisations draft a European standard or European standardisation deliverable within a set deadline, provided that the European standardisation organisation concerned complies with paragraph 2a. European standards and European standardisation deliverables shall be market-driven, take into account the public interest as well as the policy objectives clearly stated in the Commission’s request and be based on consensus. The Commission shall determine the requirements as to the content to be met by the requested document and a deadline for its adoption.\n\n2. The decisions referred to in paragraph 1 shall be adopted in accordance with the procedure laid down in Article 22(3) after consultation of the European standardisation organisations and the European stakeholder organisations receiving Union financing in accordance with this Regulation as well as the committee set up by the corresponding Union legislation, when such a committee exists, or after other forms of consultation of sectoral experts.\n\n- (2a) Without prejudice to other advisory opinions, each European standardisation organisation shall ensure that the following decisions concerning European standards and European standardisation deliverables referred to in paragraph 1 are taken exclusively by representatives of the national standardisation bodies within the competent decision-making body of that organisation: (a) decisions on the acceptance and refusal of standardisation requests; (b) decisions on the acceptance of new work items that are needed for the fulfilment of the standardisation request; and (c) decisions on the adoption, revision and withdrawal of European standards or European standardisation deliverables.\n\n3. The relevant European standardisation organisation shall indicate, within one month following its receipt, if it accepts the request referred to in paragraph 1.\n\n4. Where a request for funding is made, the Commission shall inform the relevant European standardisation organisations, within two months following the receipt of the acceptance referred to in paragraph 3, about the award of a grant for drafting a European standard or a European standardisation deliverable.\n\n5. The European standardisation organisations shall inform the Commission about the activities undertaken for the development of the documents referred to in paragraph 1. The Commission together with the European standardisation organisations shall assess the compliance of the documents drafted by the European standardisation organisations with its initial request.\n\n6. Where a harmonised standard satisfies the requirements which it aims to cover and which are set out in the corresponding Union harmonisation legislation, the Commission shall publish a reference of such harmonised standard without delay in the Official Journal of the European Union or by other means in accordance with the conditions laid down in the corresponding act of Union harmonisation legislation.\n\n7. Where a European standard drafted in support of Regulation (EU) 2023/988 of the European Parliament and of the Council ( 2 ) satisfies the general safety requirement laid down in Article 5 of that Regulation and the specific safety requirements referred to in Article 7(2) of that Regulation, the Commission shall publish a reference to that European standard without delay in the Official Journal of the European Union.\n\n- (a) decisions on the acceptance and refusal of standardisation requests;\n- (b) decisions on the acceptance of new work items that are needed for the fulfilment of the standardisation request; and\n- (c) decisions on the adoption, revision and withdrawal of European standards or European standardisation deliverables.\n\n### Article 11\n\n**Formal objections to harmonised standards**\n\n1. When a Member State or the European Parliament considers that a harmonised standard or European standard drafted in support of Regulation (EU) 2023/988 does not entirely satisfy the requirements which it aims to cover and which are set out in the relevant Union harmonisation legislation or in that Regulation, it shall inform the Commission thereof with a detailed explanation. The Commission shall, after consulting the committee set up by the corresponding Union harmonisation legislation, if it exists, or the committee set up by that Regulation, or after other forms of consultation of sectoral experts, decide: (a) to publish, not to publish or to publish with restriction the references to the harmonised standard or European standard concerned drafted in support of that Regulation in the Official Journal of the European Union; and (b) to maintain, to maintain with restriction or to withdraw the references to the harmonised standard or European standard concerned drafted in support of that Regulation in or from the Official Journal of the European Union.\n\n2. The Commission shall publish information on its website on the harmonised standards and European standards drafted in support of Regulation (EU) 2023/988 that have been subject to a decision pursuant to paragraph 1.\n\n3. The Commission shall inform the European standardisation organisation concerned of any decision adopted pursuant to paragraph 1 and, if necessary, request the revision of the harmonised standards or of the European standards concerned drafted in support of Regulation (EU) 2023/988.\n\n4. The decision referred to in point (a) of paragraph 1 of this Article shall be adopted in accordance with the advisory procedure referred to in Article 22(2).\n\n5. The decision referred to in point (b) of paragraph 1 of this Article shall be adopted in accordance with the examination procedure referred to in Article 22(3).\n\n- (a) to publish, not to publish or to publish with restriction the references to the harmonised standard or European standard concerned drafted in support of that Regulation in the Official Journal of the European Union; and\n- (b) to maintain, to maintain with restriction or to withdraw the references to the harmonised standard or European standard concerned drafted in support of that Regulation in or from the Official Journal of the European Union.\n\n### Article 12\n\n**Notification of stakeholder organisations**\n\nThe Commission shall establish a notification system for all stakeholders, including European standardisation organisations and European stakeholder organisations receiving Union financing in accordance with this Regulation in order to ensure proper consultation and market relevance prior to:\n\n- (a) adopting the annual Union work programme for European standardisation referred to in Article 8(1);\n- (b) adopting standardisation requests referred to in Article 10;\n- (c) taking a decision on formal objections to harmonised standards, as referred to in Article 11(1);\n- (d) taking a decision on identifications of ICT technical specifications referred to in Article 13;\n- (e) adopting delegated acts referred to in Article 20.\n\n### Article 13\n\n**Identification of ICT technical specifications eligible for referencing**\n\n1. Either on proposal from a Member State or on its own initiative the Commission may decide to identify ICT technical specifications that are not national, European or international standards, but meet the requirements set out in Annex II, which may be referenced, primarily to enable interoperability, in public procurement.\n\n2. Either on proposal from a Member State or on its own initiative, when an ICT technical specification identified in accordance with paragraph 1 is modified, withdrawn or no longer meets the requirements set out in Annex II, the Commission may decide to identify the modified ICT technical specification or to withdraw the identification.\n\n3. The decisions provided for in paragraphs 1 and 2 shall be adopted after consultation of the European multi-stakeholder platform on ICT standardisation, which includes European standardisation organisations, Member States and relevant stakeholders, and after consultation of the committee set up by the corresponding Union legislation, if it exists, or after other forms of consultation of sectoral experts, if such a committee does not exist.\n\n\n### Article 14\n\n**Use of ICT technical specifications in public procurement**\n\nThe ICT technical specifications referred to in Article 13 of this Regulation shall constitute common technical specifications referred to in Directives 2004/17/EC, 2004/18/EC and 2009/81/EC, and Regulation (EC, Euratom) No 2342/2002.\n\n\n### Article 15\n\n**Financing of standardisation organisations by the Union**\n\n1. The financing by the Union may be granted to the European standardisation organisations for the following standardisation activities: (a) the development and revision of European standards or European standardisation deliverables which is necessary and suitable for the support of Union legislation and policies; (b) the verification of the quality, and conformity to the corresponding Union legislation and policies, of European standards or European standardisation deliverables; (c) the performance of preliminary or ancillary work in connection with European standardisation, including studies, cooperation activities, including international cooperation, seminars, evaluations, comparative analyses, research work, laboratory work, inter-laboratory tests, conformity evaluation work and measures to ensure that the periods for the development and the revision of European standards or European standardisation deliverables are shortened without prejudice to the founding principles, especially the principles of openness, quality, transparency and consensus among all stakeholders; (d) the activities of the central secretariats of the European standardisation organisations, including policy development, the coordination of standardisation activities, the processing of technical work and the provision of information to interested parties; (e) the translation of European standards or European standardisation deliverables used in support of Union legislation and policies into the official Union languages other than the working languages of the European standardisation organisations or, in duly justified cases into languages other than the official Union languages; (f) the drawing up of information to explain, interpret and simplify European standards or European standardisation deliverables, including the drawing up of user guides, abstracts of standards, best practice information and awareness-building actions, strategies and training programmes; (g) activities seeking to carry out programmes of technical assistance, cooperation with third countries and the promotion and enhancement of the European standardisation system and of European standards and European standardisation deliverables among interested parties in the Union and at international level.\n\n2. The financing by the Union may also be granted to: (a) national standardisation bodies for the standardisation activities referred to in paragraph 1, which they jointly undertake with the European standardisation organisations; (b) other bodies which have been entrusted with contributing to the activities referred to in point (a) of paragraph 1, or carrying out the activities referred to in points (c) and (g) of paragraph 1, in cooperation with the European standardisation organisations.\n\n- (a) the development and revision of European standards or European standardisation deliverables which is necessary and suitable for the support of Union legislation and policies;\n- (b) the verification of the quality, and conformity to the corresponding Union legislation and policies, of European standards or European standardisation deliverables;\n- (c) the performance of preliminary or ancillary work in connection with European standardisation, including studies, cooperation activities, including international cooperation, seminars, evaluations, comparative analyses, research work, laboratory work, inter-laboratory tests, conformity evaluation work and measures to ensure that the periods for the development and the revision of European standards or European standardisation deliverables are shortened without prejudice to the founding principles, especially the principles of openness, quality, transparency and consensus among all stakeholders;\n- (d) the activities of the central secretariats of the European standardisation organisations, including policy development, the coordination of standardisation activities, the processing of technical work and the provision of information to interested parties;\n- (e) the translation of European standards or European standardisation deliverables used in support of Union legislation and policies into the official Union languages other than the working languages of the European standardisation organisations or, in duly justified cases into languages other than the official Union languages;\n- (f) the drawing up of information to explain, interpret and simplify European standards or European standardisation deliverables, including the drawing up of user guides, abstracts of standards, best practice information and awareness-building actions, strategies and training programmes;\n- (g) activities seeking to carry out programmes of technical assistance, cooperation with third countries and the promotion and enhancement of the European standardisation system and of European standards and European standardisation deliverables among interested parties in the Union and at international level.\n- (a) national standardisation bodies for the standardisation activities referred to in paragraph 1, which they jointly undertake with the European standardisation organisations;\n- (b) other bodies which have been entrusted with contributing to the activities referred to in point (a) of paragraph 1, or carrying out the activities referred to in points (c) and (g) of paragraph 1, in cooperation with the European standardisation organisations.\n\n### Article 16\n\n**Financing of other European organisations by the Union**\n\nThe financing by the Union may be granted to the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation for the following activities:\n\n- (a) the functioning of these organisations and of their activities relating to European and international standardisation, including the processing of technical work and the provision of information to members and other interested parties;\n- (b) the provision of legal and technical expertise, including studies, in relation to assessment of the need for, and the development of, European standards and European standardisation deliverables and training of experts;\n- (c) the participation in the technical work with respect to the development and revision of European standards and European standardisation deliverables which is necessary and suitable for the support of Union legislation and policies;\n- (d) the promotion of European standards and European standardisation deliverables, and the information on, and use of, standards among interested parties, including SMEs and consumers.\n\n### Article 17\n\n**Financing arrangements**\n\n1. Financing by the Union shall be provided in the form of: (a) grants without a call for proposals, or contracts after public procurement procedures, to: (i) European standardisation organisations and national standardisation bodies to carry out the activities referred to in Article 15(1); (ii) bodies identified by a basic act, within the meaning of Article 49 of Regulation (EC, Euratom) No 1605/2002, to carry out, in collaboration with the European standardisation organisations the activities referred to in point (c) of Article 15(1) of this Regulation; (b) grants after a call for proposals, or contracts after public procurement procedures, to other bodies referred to in point (b) of Article 15(2): (i) for contributing to the development and revision of European standards or European standardisation deliverables referred to in point (a) of Article 15(1); (ii) for carrying out the preliminary or ancillary work referred to in point (c) of Article 15(1); (iii) for carrying out the activities referred to in point (g) of Article 15(1); (c) grants after a call for proposals to the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation to carry out the activities referred to in Article 16.\n\n2. The activities of the bodies referred to in paragraph 1 may be financed by: (a) grants for actions; (b) operating grants for the European standardisation organisations and the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation in accordance with the rules set out in Regulation (EC, Euratom) No 1605/2002. In the event of renewal, operating grants shall not be automatically decreased.\n\n3. The Commission shall decide on the financing arrangements referred to in paragraphs 1 and 2, on the amounts of the grants and, where necessary, on the maximum percentage of financing by type of activity.\n\n4. Except in duly justified cases, grants awarded for the standardisation activities referred to in points (a) and (b) of Article 15(1) shall take the form of lump sums and for the standardisation activities referred to in point (a) of Article 15(1) shall be paid upon fulfilment of the following conditions: (a) European standards or European standardisation deliverables requested by the Commission in accordance with Article 10 are adopted or revised within a period not exceeding the period specified in the request referred to in that Article; (b) SMEs, consumer organisations and environmental and social stakeholders are appropriately represented and can participate in European standardisation activities, as referred to in Article 5(1).\n\n5. The common cooperation objectives and the administrative and financial conditions relating to the grants awarded to European standardisation organisations and the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation shall be defined in the framework partnership agreements between the Commission and those standardisation and stakeholder organisations, in accordance with Regulations (EC, Euratom) No 1605/2002 and (EC, Euratom) No 2342/2002. The Commission shall inform the European Parliament and the Council of the conclusion of those agreements.\n\n- (a) grants without a call for proposals, or contracts after public procurement procedures, to: (i) European standardisation organisations and national standardisation bodies to carry out the activities referred to in Article 15(1); (ii) bodies identified by a basic act, within the meaning of Article 49 of Regulation (EC, Euratom) No 1605/2002, to carry out, in collaboration with the European standardisation organisations the activities referred to in point (c) of Article 15(1) of this Regulation;\n- (i) European standardisation organisations and national standardisation bodies to carry out the activities referred to in Article 15(1);\n- (ii) bodies identified by a basic act, within the meaning of Article 49 of Regulation (EC, Euratom) No 1605/2002, to carry out, in collaboration with the European standardisation organisations the activities referred to in point (c) of Article 15(1) of this Regulation;\n- (b) grants after a call for proposals, or contracts after public procurement procedures, to other bodies referred to in point (b) of Article 15(2): (i) for contributing to the development and revision of European standards or European standardisation deliverables referred to in point (a) of Article 15(1); (ii) for carrying out the preliminary or ancillary work referred to in point (c) of Article 15(1); (iii) for carrying out the activities referred to in point (g) of Article 15(1);\n- (i) for contributing to the development and revision of European standards or European standardisation deliverables referred to in point (a) of Article 15(1);\n- (ii) for carrying out the preliminary or ancillary work referred to in point (c) of Article 15(1);\n- (iii) for carrying out the activities referred to in point (g) of Article 15(1);\n- (c) grants after a call for proposals to the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation to carry out the activities referred to in Article 16.\n- (a) grants for actions;\n- (b) operating grants for the European standardisation organisations and the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation in accordance with the rules set out in Regulation (EC, Euratom) No 1605/2002. In the event of renewal, operating grants shall not be automatically decreased.\n- (a) European standards or European standardisation deliverables requested by the Commission in accordance with Article 10 are adopted or revised within a period not exceeding the period specified in the request referred to in that Article;\n- (b) SMEs, consumer organisations and environmental and social stakeholders are appropriately represented and can participate in European standardisation activities, as referred to in Article 5(1).\n\n### Article 18\n\n**Management**\n\nThe appropriations determined by the budgetary authority for the financing of standardisation activities may also cover the administrative expenses relating to the preparation, monitoring, inspection, auditing and evaluation which are directly necessary for the purposes of implementing Articles 15, 16 and 17, including studies, meetings, information and publication activities, expenses relating to informatics networks for the exchange of information and any other expenditure on administrative and technical assistance which the Commission may use for standardisation activities.\n\n\n### Article 19\n\n**Protection of the financial interests of the Union**\n\n1. The Commission shall ensure that, when the activities financed under this Regulation are implemented, the financial interests of the Union are protected by the application of preventive measures against fraud, corruption and other illegal activities, by effective checks and by the recovery of amounts unduly paid and, if irregularities are detected, by effective, proportionate and dissuasive penalties, in accordance with Regulations (EC, Euratom) No 2988/95, (Euratom, EC) No 2185/96 and (EC) No 1073/1999.\n\n2. For the Union activities financed pursuant to this Regulation, the notion of irregularity defined in Article 1(2) of Regulation (EC, Euratom) No 2988/95 shall mean any infringement of a provision of Union law or any breach of a contractual obligation resulting from an act or omission by an economic operator which has, or would have, the effect of prejudicing the general budget of the Union or budgets managed by it by an unjustified item of expenditure.\n\n3. Any agreements and contracts resulting from this Regulation shall provide for monitoring and financial control by the Commission or any representative which it authorises and for audits by the European Court of Auditors, which if necessary may be conducted on the spot.\n\n\n### Article 20\n\n**Delegated acts**\n\nThe Commission shall be empowered to adopt delegated acts in accordance with Article 21 concerning amendments to the Annexes, in order to:\n\n- (a) update the list of European standardisation organisations set out in Annex I to take into account changes in their name or structure;\n- (b) adapt the criteria for European stakeholder organisations set out in Annex III to this Regulation to further developments as regards their non-profit making nature and representativity. Such adaptations shall not have the effect of creating any new criteria or abolishing any existing criteria or category of organisation.\n\n### Article 21\n\n**Exercise of the delegation**\n\n1. The power to adopt delegated acts is conferred on the Commission subject to the conditions laid down in this Article.\n\n2. The power to adopt delegated acts referred to in Article 20 shall be conferred on the Commission for a period of five years from 1 January 2013. The Commission shall draw up a report in respect of the delegation of power not later than nine months before the end of the five-year period. The delegation of power shall be tacitly extended for periods of an identical duration, unless the European Parliament or the Council opposes such extension not later than three months before the end of each period.\n\n3. The delegation of power referred to in Article 20 may be revoked at any time by the European Parliament or by the Council. A decision to revoke shall put an end to the delegation of the power specified in that decision. It shall take effect the day following the publication of the decision in the Official Journal of the European Union or at a later date specified therein. It shall not affect the validity of any delegated acts already in force.\n\n4. As soon as it adopts a delegated act, the Commission shall notify it simultaneously to the European Parliament and to the Council.\n\n5. A delegated act adopted pursuant to Article 20 shall enter into force only if no objection has been expressed either by the European Parliament or the Council within a period of two months of notification of that act to the European Parliament and the Council or if, before the expiry of that period, the European Parliament and the Council have both informed the Commission that they will not object. That period shall be extended by two months at the initiative of the European Parliament or of the Council.\n\n\n### Article 22\n\n**Committee procedure**\n\n1. The Commission shall be assisted by a committee. That committee shall be a committee within the meaning of Regulation (EU) No 182/2011.\n\n2. Where reference is made to this paragraph, Article 4 of Regulation (EU) No 182/2011 shall apply.\n\n3. Where reference is made to this paragraph, Article 5 of Regulation (EU) No 182/2011 shall apply.\n\n4. Where the opinion of the committee is to be obtained by written procedure, that procedure shall be terminated without result when, within the time-limit for delivery of the opinion, the chair of the committee so decides or a simple majority of committee members so request.\n\n\n### Article 23\n\n**Committee cooperation with standardisation organisations and stakeholders**\n\nThe committee referred to in Article 22(1) shall work in cooperation with the European standardisation organisations and the European stakeholder organisations receiving Union financing in accordance with this Regulation.\n\n\n### Article 24\n\n**Reports**\n\n1. The European standardisation organisations shall send an annual report on the implementation of this Regulation to the Commission. It shall contain detailed information on the following: (a) the application of Articles 4, 5, 10, 15 and 17; (b) the representation of SMEs, consumer organisations and environmental and social stakeholders in national standardisation bodies; (c) the representation of SMEs on the basis of the annual reports referred to in Article 6(3); (d) the use of ICT in the standardisation system; (e) cooperation between the national standardisation bodies and European standardisation organisations.\n\n2. The European stakeholder organisations that received Union financing in accordance with this Regulation shall send an annual report on their activities to the Commission. This report shall contain in particular detailed information about the membership of these organisations and the activities referred to in Article 16.\n\n3. By 31 December 2015 and every five years thereafter, the Commission shall present a report to the European Parliament and to the Council on the implementation of this Regulation. This report shall contain an analysis of the annual reports referred to in paragraphs 1 and 2, an evaluation of the relevance of the standardisation activities receiving Union financing in the light of the requirements of Union legislation and policies as well as an assessment of potential new measures to simplify the financing of European standardisation and to reduce the administrative burden for the European standardisation organisations.\n\n- (a) the application of Articles 4, 5, 10, 15 and 17;\n- (b) the representation of SMEs, consumer organisations and environmental and social stakeholders in national standardisation bodies;\n- (c) the representation of SMEs on the basis of the annual reports referred to in Article 6(3);\n- (d) the use of ICT in the standardisation system;\n- (e) cooperation between the national standardisation bodies and European standardisation organisations.\n\n### Article 25\n\n**Review**\n\nBy 2 January 2015, the Commission shall evaluate the impact of the procedure established by Article 10 of this Regulation on the timeframe for issuing standardisation requests. The Commission shall present its conclusions in a report to the European Parliament and to the Council. Where appropriate, that report shall be accompanied by a legislative proposal to amend this Regulation.\n\n\n### Article 26\n\n**Amendments**\n\n1. The following provisions are deleted: (a) Article 6(1) of Directive 89/686/EEC; ————— ————— (d) Article 6(1) of Directive 94/25/EC; (e) Article 6(1) of Directive 95/16/EC; (f) Article 6 of Directive 97/23/EC; ————— (h) Article 8(4) of Directive 2007/23/EC; ————— —————\n\nReferences to those deleted provisions shall be construed as references to Article 11 of this Regulation.\n\n- (a) Article 6(1) of Directive 89/686/EEC;\n- (d) Article 6(1) of Directive 94/25/EC;\n- (e) Article 6(1) of Directive 95/16/EC;\n- (f) Article 6 of Directive 97/23/EC;\n- (h) Article 8(4) of Directive 2007/23/EC;\n\n### Article 27\n\n**National standardisation bodies**\n\nMember States shall inform the Commission of their standardisation bodies.\n\nThe Commission shall publish a list of national standardisation bodies and any updates to that list in the Official Journal of the European Union.\n\n\n### Article 28\n\n**Transitional provisions**\n\nIn Union acts that provide for a presumption of conformity with essential requirements through the application of harmonised standards adopted in accordance with Directive 98/34/EC, references to Directive 98/34/EC shall be construed as references to this Regulation, except references to the committee set up by Article 5 of Directive 98/34/EC regarding technical regulations.\n\nWhere a Union act provides for a procedure for objection to harmonised standards, Article 11 of this Regulation shall not apply to that act.\n\n\n### Article 29\n\n**Repeal**\n\nDecision No 1673/2006/EC and Decision 87/95/EEC are hereby repealed.\n\nReferences to the repealed Decisions shall be construed as references to this Regulation and shall be read in accordance with the correlation table set out in Annex IV to this Regulation.\n\n\n### Article 30\n\n**Entry into force**\n\nThis Regulation shall enter into force on the twentieth day following that of its publication in the Official Journal of the European Union.\n\nIt shall apply from 1 January 2013.\n\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN PARLIAMENT AND THE COUNCIL OF THE EUROPEAN UNION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union, and in particular Article 114 thereof,</em></p>\n<p><em>Having regard to the opinion of the European Economic and Social Committee (1),</em></p>\n<p><em>Acting in accordance with the ordinary legislative procedure (2),</em></p>\n<p><em>Having regard to the proposal from the European Commission,</em></p>\n<p>Whereas:</p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) The primary objective of standardisation is the definition of voluntary technical or quality specifications with which current or future <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>, production processes or <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> may comply. Standardisation can cover various issues, such as standardisation of different grades or sizes of a particular <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> or <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> in <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> or <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> markets where compatibility and interoperability with other <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> or systems are essential.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) European standardisation is organised by and for the stakeholders concerned based on national representation (the European Committee for Standardisation (CEN) and the European Committee for Electrotechnical Standardisation (Cenelec)) and direct participation (the European Telecommunications <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> Institute (ETSI)), and is founded on the principles recognised by the World Trade Organisation (WTO) in the field of standardisation, namely coherence, transparency, openness, consensus, voluntary application, independence from special interests and efficiency (‘the founding principles’). In accordance with the founding principles, it is important that all relevant interested parties, including <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span> and small and <span class=\"term-link\" data-term-id=\"medium-sized-enterprise\" tabindex=\"0\">medium-sized enterprises</span> (SMEs), are appropriately involved in the national and European standardisation process. <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span> should also encourage and facilitate the participation of stakeholders.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) European standardisation also helps to boost the competitiveness of <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> by facilitating in particular the free movement of goods and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, network interoperability, means of <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>, technological development and innovation. European standardisation reinforces the global competitiveness of European industry especially when established in coordination with the <span class=\"term-link\" data-term-id=\"international-standardisation-body\" tabindex=\"0\">international standardisation bodies</span>, namely the <span class=\"term-link\" data-term-id=\"international-organisation\" tabindex=\"0\">International Organisation</span> for Standardisation (ISO), the International Electrotechnical Commission (IEC) and the International Telecommunication Union (ITU). <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> produce significant positive economic effects, for example by promoting economic interpenetration on the internal market and encouraging the development of new and improved <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> or markets and improved supply conditions. <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> thus normally increase competition and lower output and sales costs, benefiting economies as a whole and consumers in particular. <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> may maintain and enhance quality, provide information and ensure interoperability and compatibility, thereby increasing safety and value for consumers.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> are adopted by the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, namely CEN, Cenelec and ETSI.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> play a very important role within the internal market, for instance through the use of <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> in the presumption of conformity of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> to be made available on the market with the essential requirements relating to those <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> laid down in the relevant Union harmonisation legislation. Those requirements should be precisely defined in order to avoid misinterpretation on the part of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) Standardisation plays an increasingly important role in international trade and the opening-up of markets. The Union should seek to promote cooperation between <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and <span class=\"term-link\" data-term-id=\"international-standardisation-body\" tabindex=\"0\">international standardisation bodies</span>. The Union should also promote bilateral approaches with third countries to coordinate standardisation efforts and promote <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>, for instance when negotiating agreements or by seconding standardisation experts to third countries. Furthermore the Union should encourage contact between <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and private forums and consortia, while maintaining the primacy of European standardisation.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) European standardisation is governed by a specific legal framework consisting of three different legal acts, namely Directive 98/34/EC of the European Parliament and of the Council of 22 June 1998 laying down a procedure for the provision of information in the field of technical <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and regulations and of rules on <span class=\"term-link\" data-term-id=\"information-society-service\" tabindex=\"0\">Information Society services</span> (3), Decision No 1673/2006/EC of the European Parliament and of the Council of 24 October 2006 on the financing of European standardisation (4) and Council Decision 87/95/EEC of 22 December 1986 on standardisation in the field of information technology and telecommunications (5). However, the current legal framework is no longer up to date with developments in European standardisation over recent decades. Therefore, the current legal framework should be simplified and adapted in order to cover new aspects of standardisation to reflect those latest developments and future challenges in European standardisation. That relates in particular to the increased development of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> and the evolution of standardisation deliverables other than formal <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) The European Parliament’s Resolution of 21 October 2010 on the future of European standardisation (6), as well as the report of the Expert Panel for the Review of the European Standardization System (Express) of February 2010 entitled ‘Standardization for a competitive and innovative Europe: a vision for 2020’, have set out an important number of strategic recommendations regarding the review of the European standardisation system.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) In order to ensure the effectiveness of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and standardisation as policy tools for the Union, it is necessary to have an effective and efficient standardisation system which provides a flexible and transparent platform for consensus building between all participants and which is financially viable.</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) Directive 2006/123/EC of the European Parliament and of the Council of 12 December 2006 on <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> in the internal market (7) establishes general provisions facilitating the exercise of the freedom of establishment for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> providers and the free movement of <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, while maintaining a high quality of <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. It obliges the Member States to encourage, in cooperation with the Commission, the development of voluntary <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> with the aim of facilitating compatibility between <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> supplied by providers in different Member States, the provision of information to the <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span> and the quality of <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> provision. However, Directive 98/34/EC only applies to <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> while <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> are not expressly covered by it. Furthermore, the delineation between <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> and goods is becoming less relevant in the reality of the internal market. In practice, it is not always possible to clearly distinguish <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> from <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. Many <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> have a <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> component while <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> often also partly relate to <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>. Thus, it is necessary to adapt the current legal framework to these new circumstances by extending its scope to <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>.</p>\n</li>\n<li id=\"recital-11\" data-recital=\"11\" class=\"linkable-recital\">\n<p>(11) Like other <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> are voluntary and should be market-driven, whereby the needs of the economic operators and stakeholders directly or indirectly affected by such <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> prevail, and should take into account the public interest and be based on the founding principles, including consensus. They should primarily focus on <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> linked to <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and processes.</p>\n</li>\n<li id=\"recital-12\" data-recital=\"12\" class=\"linkable-recital\">\n<p>(12) The legal framework allowing the Commission to request one or several <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> to draft a <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverable</span> for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> should be applied while fully respecting the distribution of competences between the Union and the Member States as laid down in the Treaties. This concerns in particular Articles 14, 151, 152, 153, 165, 166 and 168 of the Treaty on the Functioning of the European Union (TFEU) and Protocol (No 26) on <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">Services</span> of General Interest annexed to the Treaty on European Union (TEU) and to the TFEU in accordance with which it remains the exclusive competence of the Member States to define the fundamental principles of their social security, vocational training and health systems and to shape the framework conditions for the management, financing, organisation and delivery of the <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> supplied within those systems, including - without prejudice to Article 168(4) TFEU and to Directive 2005/36/EC of the European Parliament and of the Council of 7 September 2005 on the recognition of professional qualifications (8) - the definition of requirements, quality and safety <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> applicable to them. The Commission should not, by means of such a request, affect the right to negotiate, conclude and enforce collective agreements and to take industrial action in accordance with national law and practices which respect Union law.</p>\n</li>\n<li id=\"recital-13\" data-recital=\"13\" class=\"linkable-recital\">\n<p>(13) The <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> are subject to competition law to the extent that they can be considered to be an undertaking or an association of undertakings within the meaning of Articles 101 and 102 TFEU.</p>\n</li>\n<li id=\"recital-14\" data-recital=\"14\" class=\"linkable-recital\">\n<p>(14) Within the Union, <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span> are adopted by <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> which could lead to conflicting <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and technical impediments in the internal market. Therefore, it is necessary for the internal market and for the effectiveness of standardisation within the Union to confirm the existing regular exchange of information between the <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span>, the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the Commission, about their current and future standardisation activities as well as the standstill principle applicable to the <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> within the framework of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> which provides for the withdrawal of <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span> after the publication of a new <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span>. The <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> should also observe the provisions on exchange of information in Annex 3 to the Agreement on Technical Barriers to Trade (9).</p>\n</li>\n<li id=\"recital-15\" data-recital=\"15\" class=\"linkable-recital\">\n<p>(15) The Member States’ obligation to notify the Commission of their <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> should not require the adoption of a specific national legislation for the purposes of recognition of those bodies.</p>\n</li>\n<li id=\"recital-16\" data-recital=\"16\" class=\"linkable-recital\">\n<p>(16) The regular exchange of information between the <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span>, the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the Commission should not prevent <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> from complying with other obligations and commitments, and in particular with Annex 3 to the Agreement on Technical Barriers to Trade.</p>\n</li>\n<li id=\"recital-17\" data-recital=\"17\" class=\"linkable-recital\">\n<p>(17) The representation of societal interests and societal stakeholders in European standardisation activities refers to the activities of organisations and parties representing interests of greater societal relevance, for instance environmental, consumer interests or employee interests. However, the representation of social interests and social stakeholders in European standardisation activities refers particularly to the activities of organisations and parties representing employees and workers’ basic rights, for instance trade unions.</p>\n</li>\n<li id=\"recital-18\" data-recital=\"18\" class=\"linkable-recital\">\n<p>(18) In order to speed up the decision-making process, <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> should facilitate accessible information on their activities through the promotion of the use of information and <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> technologies (ICT) in their respective standardisation systems, for example by providing to all relevant stakeholders an easy-to-use online consultation mechanism for the submission of comments on <span class=\"term-link\" data-term-id=\"draft-standard\" tabindex=\"0\">draft standards</span> and by organising virtual meetings, including by means of web conferencing or video conferencing, of technical committees.</p>\n</li>\n<li id=\"recital-19\" data-recital=\"19\" class=\"linkable-recital\">\n<p>(19) <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> can contribute to helping Union policy address the major societal challenges such as climate change, sustainable resource use, innovation, ageing population, integration of people with disabilities, consumer protection, workers’ safety and working conditions. By driving the development of European or <span class=\"term-link\" data-term-id=\"international-standard\" tabindex=\"0\">international standards</span> for goods and technologies in the expanding markets in those areas, the Union could create a competitive advantage for its <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> and facilitate trade, in particular for SMEs, which account for a large part of European <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span>.</p>\n</li>\n<li id=\"recital-20\" data-recital=\"20\" class=\"linkable-recital\">\n<p>(20) <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> are important tools for the competitiveness of undertakings and especially SMEs, whose participation in the standardisation process is important for technological progress in the Union. Therefore it is necessary that the standardisation framework encourage SMEs to actively participate in and provide their innovative technology solutions to standardisation efforts. This includes improving their participation at national level where they can be more effective due to lower costs and lack of linguistic barriers. Consequently this Regulation should improve representation and participation of SMEs in both national and European technical committees and should facilitate their effective access to and awareness of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>.</p>\n</li>\n<li id=\"recital-21\" data-recital=\"21\" class=\"linkable-recital\">\n<p>(21) <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> are of vital interest for the competitiveness of SMEs which, however, are in some cases under-represented in European standardisation activities. Thus, this Regulation should encourage and facilitate appropriate representation and participation of SMEs in the European standardisation process by an <span class=\"term-link\" data-term-id=\"entity\" tabindex=\"0\">entity</span> that is effectively in contact with, and duly <span class=\"term-link\" data-term-id=\"representative\" tabindex=\"0\">representative</span> of, SMEs and organisations representing SMEs at national level.</p>\n</li>\n<li id=\"recital-22\" data-recital=\"22\" class=\"linkable-recital\">\n<p>(22) <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> can have a broad impact on society, in particular on the safety and well-being of citizens, the efficiency of networks, the environment, workers’ safety and working conditions, accessibility and other public policy fields. Therefore, it is necessary to ensure that the role and the input of societal stakeholders in the development of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> are strengthened, through the reinforced support of organisations representing consumers and environmental and social interests.</p>\n</li>\n<li id=\"recital-23\" data-recital=\"23\" class=\"linkable-recital\">\n<p>(23) The obligation of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> to encourage and facilitate representation and effective participation of all relevant stakeholders does not entail any voting rights for these stakeholders unless such voting rights are prescribed by the internal rules of procedure of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</p>\n</li>\n<li id=\"recital-24\" data-recital=\"24\" class=\"linkable-recital\">\n<p>(24) The European standardisation system should also fully take into account the United Nations Convention on the Rights of Persons with Disabilities (10). It is therefore important that organisations representing the interests of consumers sufficiently represent and include the interests of people with disabilities. In addition, the participation of people with disabilities in the standardisation process should be facilitated by all available means.</p>\n</li>\n<li id=\"recital-25\" data-recital=\"25\" class=\"linkable-recital\">\n<p>(25) Due to the importance of standardisation as a tool to support Union legislation and policies and in order to avoid ex-post objections to and modifications of <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span>, it is important that <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span> participate in standardisation at all stages of the development of those <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> where they may be involved and especially in the areas covered by Union harmonisation legislation for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>.</p>\n</li>\n<li id=\"recital-26\" data-recital=\"26\" class=\"linkable-recital\">\n<p>(26) <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> should take into account environmental impacts throughout the life cycle of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. Important and publicly available tools for evaluating such impacts throughout the life cycle have been developed by the Commission’s Joint Research Centre (JRC). Thus, this Regulation should ensure that the JRC can play an active role in the European standardisation system.</p>\n</li>\n<li id=\"recital-27\" data-recital=\"27\" class=\"linkable-recital\">\n<p>(27) The viability of the cooperation between the Commission and the European standardisation system depends on careful planning of future requests for the development of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>. This planning could be improved, in particular through the input of interested parties, including national market surveillance authorities, by introducing mechanisms for collecting opinions and facilitating the exchange of information among all interested parties. Since Directive 98/34/EC already provides for the possibility to request the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> to develop <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>, it is appropriate to put in place a better and more transparent planning in an annual work programme which should contain an overview of all requests for <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> which the Commission intends to submit to <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>. It is necessary to ensure a high level of cooperation between the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the European stakeholder organisations receiving Union financing in accordance with this Regulation and the Commission in the establishment of its annual Union work programme for standardisation and in the preparation of requests for <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> in order to analyse the market relevance of the proposed subject matter and the policy objectives set by the legislator, and to allow the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> to respond more quickly to the requested standardisation activities.</p>\n</li>\n<li id=\"recital-28\" data-recital=\"28\" class=\"linkable-recital\">\n<p>(28) Before bringing a matter regarding requests for <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>, or objections to a <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> before the committee set up by this Regulation, the Commission should consult experts of the Member States, for instance through the involvement of committees set up by the corresponding Union legislation or by other forms of consultation of sectoral experts, where such committees do not exist.</p>\n</li>\n<li id=\"recital-29\" data-recital=\"29\" class=\"linkable-recital\">\n<p>(29) Several directives harmonising the conditions for the marketing of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> specify that the Commission may request the adoption, by the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, of <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> on the basis of which conformity with the applicable essential requirements is presumed. However, many of those directives contain a wide variety of provisions on objections to these <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> when the latter do not, or do not entirely, cover all applicable requirements. Diverging provisions which lead to uncertainty for economic operators and <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> are in particular contained in Council Directive 89/686/EEC of 21 December 1989 on the approximation of the laws of the Member States relating to personal protective equipment (11), Council Directive 93/15/EEC of 5 April 1993 on the harmonisation of the provisions relating to the placing on the market and supervision of explosives for civil uses (12), Directive 94/9/EC of the European Parliament and the Council of 23 March 1994 on the approximation of the laws of the Member States concerning equipment and protective systems intended for use in potentially explosive atmospheres (13), Directive 94/25/EC of the European Parliament and of the Council of 16 June 1994 on the approximation of the laws, regulations and administrative provisions of the Member States relating to recreational craft (14), European Parliament and Council Directive 95/16/EC of 29 June 1995 on the approximation of the laws of the Member States relating to lifts (15), Directive 97/23/EC of the European Parliament and of the Council of 29 May 1997 on the approximation of the laws of the Member States concerning pressure equipment (16), Directive 2004/22/EC of the European Parliament and of the Council of 31 March 2004 on measuring instruments (17), Directive 2007/23/EC of the European Parliament and of the Council of 23 May 2007 on the placing on the market of pyrotechnic articles (18), Directive 2009/23/EC of the European Parliament and of the Council of23 April 2009 on non-automatic weighing instruments (19) and Directive 2009/105/EC of the European Parliament and of the Council of 16 September 2009 relating to simple pressure vessels (20). Therefore, it is necessary to include in this Regulation the uniform procedure provided for in Decision No 768/2008/EC of the European Parliament and of the Council of 9 July 2008 on a common framework for the marketing of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> (21), delete the relevant provisions in those Directives and extend to the European Parliament the right to object to a <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> in accordance with this Regulation.</p>\n</li>\n<li id=\"recital-30\" data-recital=\"30\" class=\"linkable-recital\">\n<p>(30) <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">Public authorities</span> should make best use of the full range of relevant <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> when procuring hardware, software and information technology <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, for example by selecting <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> which can be implemented by all interested suppliers, allowing for more competition and reduced <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> of lock-in. Directive 2004/17/EC of the European Parliament and of the Council of 31 March 2004 coordinating the procurement procedures of <span class=\"term-link\" data-term-id=\"entity\" tabindex=\"0\">entities</span> operating in the water, energy, transport and postal <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> sectors (22), Directive 2004/18/EC of the European Parliament and of the Council of 31 March 2004 on the coordination of procedures for the award of public works contracts, public supply contracts and public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> contracts (23), Directive 2009/81/EC of the European Parliament and of the Council of 13 July 2009 on the coordination of procedures for the award of certain works contracts, supply contracts and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> contracts by contracting authorities or <span class=\"term-link\" data-term-id=\"entity\" tabindex=\"0\">entities</span> in the fields of defence and security (24) and Commission Regulation (EC, Euratom) No 2342/2002 of 23 December 2002 laying down detailed rules for the implementation of Council Regulation (EC, Euratom) No 1605/2002 on the Financial Regulation applicable to the general budget of the European Communities (25) specify that <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> in public procurement should be formulated by reference to <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span> transposing <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>, European technical approvals, common <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span>, <span class=\"term-link\" data-term-id=\"international-standard\" tabindex=\"0\">international standards</span>, other technical reference systems established by the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> or - when these do not exist - to <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span>, national technical approvals or national <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> relating to the design, calculation and execution of the works and use of the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>, or equivalent. <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span>, however, are often developed by other <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standard</span> developing organisations and do not fall in any of the categories of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and approvals laid down in Directives 2004/17/EC, 2004/18/EC or 2009/81/EC or Regulation (EC, Euratom) No 2342/2002. Therefore, it is necessary to provide for the possibility that <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> for public procurement could refer to <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span>, in order to respond to the fast evolution in the field of ICT, facilitate the provision of cross-border <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, encourage competition and promote interoperability and innovation.</p>\n</li>\n<li id=\"recital-31\" data-recital=\"31\" class=\"linkable-recital\">\n<p>(31) <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">Technical specifications</span> not adopted by <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> do not hold an equivalent status to <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>. Some <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> are not developed in accordance with the founding principles. Therefore, this Regulation should lay down a procedure for the identification of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> that could be referenced in public procurement, involving a broad consultation of a large spectrum of stakeholders, including the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> and <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span>. This Regulation should also lay down requirements, in the form of a list of criteria, for such <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> and their associated development processes. The requirements for the identification of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> should ensure that public policy objectives and societal needs are respected, and should be based on the founding principles.</p>\n</li>\n<li id=\"recital-32\" data-recital=\"32\" class=\"linkable-recital\">\n<p>(32) In order to further innovation and competition, the identification of a particular <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specification</span> should not disqualify a competing <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specification</span> from being identified in accordance with the provisions of this Regulation. Any identification should be subject to the criteria being fulfilled and to the <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specification</span> having achieved a significant level of market acceptance.</p>\n</li>\n<li id=\"recital-33\" data-recital=\"33\" class=\"linkable-recital\">\n<p>(33) The identified <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> could contribute to the implementation of Decision No 922/2009/EC of the European Parliament and of the Council of 16 September 2009 on interoperability solutions for European public administrations (ISA) (26) which establishes, for the period 2010-2015, a programme on interoperability solutions for European public administrations and institutions and bodies of the Union, providing common and shared solutions facilitating interoperability.</p>\n</li>\n<li id=\"recital-34\" data-recital=\"34\" class=\"linkable-recital\">\n<p>(34) Situations may arise in the field of ICT where it is appropriate to encourage the use of, or require compliance, with relevant <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> at Union level in order to ensure interoperability in the single market and to improve freedom of choice for <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span>. In other circumstances, it may also happen that specified <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> no longer meet consumers’ needs or are hampering technological development. For these reasons, Directive 2002/21/EC of the European Parliament and of the Council of 7 March 2002 on a common regulatory framework for electronic <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> networks and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> (27) enables the Commission, where necessary, to request <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> to draw up <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, to establish and publish in the Official Journal of the European Union a list of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> or specifications with the view to encourage their use, or to make their implementation compulsory, or to remove <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> or specifications from that list.</p>\n</li>\n<li id=\"recital-35\" data-recital=\"35\" class=\"linkable-recital\">\n<p>(35) This Regulation should not prevent <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> from continuing to develop <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> in the field of ICT and to increase their cooperation with other <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standard</span> developing bodies, especially in the field of ICT, in order to ensure coherence and avoid fragmentation or duplication during implementation of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and specifications.</p>\n</li>\n<li id=\"recital-36\" data-recital=\"36\" class=\"linkable-recital\">\n<p>(36) The procedure for identification of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> provided for in this Regulation should not undermine the coherence of the European standardisation system. Therefore, this Regulation should also lay down the conditions under which it can be considered that a <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specification</span> does not conflict with other <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>.</p>\n</li>\n<li id=\"recital-37\" data-recital=\"37\" class=\"linkable-recital\">\n<p>(37) Before identifying <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> which may be eligible for referencing in public procurement, the Multi Stakeholder Platform established by the Commission Decision of 28 November 2011 (28) should be used as a forum for consultation of European and national stakeholders, <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and Member States in order to ensure legitimacy of the process.</p>\n</li>\n<li id=\"recital-38\" data-recital=\"38\" class=\"linkable-recital\">\n<p>(38) Decision No 1673/2006/EC establishes the rules concerning the contribution of the Union to the financing of European standardisation in order to ensure that <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and other <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> are developed and revised in support of the objectives, legislation and policies of the Union. It is appropriate, for the purpose of administrative and budgetary simplification, to incorporate the provisions of that Decision into this Regulation and to use wherever possible the least burdensome procedures.</p>\n</li>\n<li id=\"recital-39\" data-recital=\"39\" class=\"linkable-recital\">\n<p>(39) In view of the very broad field of involvement of European standardisation in support of Union legislation and policies and the different types of standardisation activity, it is necessary to provide for different financing arrangements. This mainly concerns grants without calls for proposals to the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> in accordance with the second subparagraph of Article 110(1) of Council Regulation (EC, Euratom) No 1605/2002 of 25 June 2002 on the Financial Regulation applicable to the general budget of the European Communities (29) and point (d) of Article 168(1) of Regulation (EC, Euratom) No 2342/2002. Furthermore, the same provisions should apply to those bodies which, whilst not recognised as <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> in this Regulation, have been mandated in a basic act and have been entrusted with carrying out preliminary work in support of European standardisation in cooperation with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</p>\n</li>\n<li id=\"recital-40\" data-recital=\"40\" class=\"linkable-recital\">\n<p>(40) Inasmuch as <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> provide ongoing support for Union activities, they should have effective and efficient central secretariats. The Commission should therefore be allowed to provide grants to those organisations that are pursuing an objective of general European interest without applying, in the case of operating grants, the principle of annual reduction provided for in Article 113(2) of Regulation (EC, Euratom) No 1605/2002.</p>\n</li>\n<li id=\"recital-41\" data-recital=\"41\" class=\"linkable-recital\">\n<p>(41) Decision No 1639/2006/EC of the European Parliament and of the Council of 24 October 2006 establishing a Competitiveness and Innovation Framework Programme (2007 to 2013) (30), Decision No 1926/2006/EC of the European Parliament and of the Council of 18 December 2006 establishing a programme of Community action in the field of consumer policy (2007-2013) (31) and Regulation (EC) No 614/2007 of the European Parliament and of the Council of 23 May 2007 concerning the Financial Instrument for the Environment (LIFE+) (32) already provide for the possibility of financial support of European organisations representing SMEs, consumers and environmental interests in standardisation, while specific grants are paid to European organisations representing social interests in standardisation. The financing under Decision No 1639/2006/EC, Decision No 1926/2006/EC and Regulation (EC) No 614/2007 will end on 31 December 2013. It is essential for the development of European standardisation to continue fostering and encouraging the active participation of European organisations representing SMEs, consumers and environmental and social interests. Such organisations pursue an aim of general European interest and constitute, by virtue of the specific mandate that national non-profit organisations have given them, a European network representing non-profit organisations active in the Member States and promoting principles and policies consistent with the objectives of the Treaties. Because of the context in which they operate and their statutory objectives, European organisations representing SMEs, consumers and environmental and social interests in European standardisation have a permanent role which is essential for Union objectives and policies. Therefore, the Commission should be in a position to continue providing grants to those organisations without applying, in the case of operating grants, the principle of annual reduction provided for in Article 113(2) of Regulation (EC, Euratom) No 1605/2002.</p>\n</li>\n<li id=\"recital-42\" data-recital=\"42\" class=\"linkable-recital\">\n<p>(42) The financing of standardisation activities should also be capable of covering preliminary or ancillary activities in connection with the establishment of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. This is necessary primarily for work involving research, the preparation of preliminary documents for legislation, inter-laboratory tests and the <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> or evaluation of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>. The promotion of standardisation at European and international level should also continue through programmes relating to the technical assistance to, and cooperation with, third countries. With a view to improving market access and boosting the competitiveness of <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> in the Union, it should be possible to give grants to other bodies through calls for proposals or, where necessary, by awarding contracts.</p>\n</li>\n<li id=\"recital-43\" data-recital=\"43\" class=\"linkable-recital\">\n<p>(43) Union financing should seek to establish <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, to facilitate their use by <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> through the enhanced support for their translation into the various official Union languages, in order to allow SMEs to fully benefit from the understanding and application of the <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>, to strengthen the cohesion of the European standardisation system and to ensure fair and transparent access to <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> for all market players throughout the Union. This is especially important in cases where the use of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> enables compliance with relevant Union legislation.</p>\n</li>\n<li id=\"recital-44\" data-recital=\"44\" class=\"linkable-recital\">\n<p>(44) In order to ensure the effective application of this Regulation, there should be the possibility of using the requisite expertise, particularly with regard to auditing and financial management, as well as administrative support resources capable of facilitating implementation, and of evaluating on a regular basis the relevance of the activities receiving Union financing in order to ensure their usefulness and impact.</p>\n</li>\n<li id=\"recital-45\" data-recital=\"45\" class=\"linkable-recital\">\n<p>(45) Appropriate measures should also be taken to avoid fraud and irregularities and to recover funds unduly paid in accordance with Council Regulations (EC, Euratom) No 2988/95 of 18 December 1995 on the protection of the European Communities financial interests (33) and (Euratom, EC) No 2185/96 of 11 November 1996 concerning on-the-spot checks and inspections carried out by the Commission in order to protect the European Communities’ financial interests against fraud and other irregularities (34) and Regulation (EC) No 1073/1999 of the European Parliament and of the Council of 25 May 1999 concerning investigations conducted by the European Anti-Fraud Office (OLAF) (35).</p>\n</li>\n<li id=\"recital-46\" data-recital=\"46\" class=\"linkable-recital\">\n<p>(46) In order to update the list of <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and to adapt the criteria for organisations representing SMEs and societal stakeholders to further developments as regards their non-profit making nature and representativity, the power to adopt acts in accordance with Article 290 TFEU should be delegated to the Commission in respect of amendments to the Annexes to this Regulation. It is of particular importance that the Commission carry out appropriate consultations during its preparatory work, including at expert level. The Commission, when preparing and drawing up delegated acts, should ensure a simultaneous, timely and appropriate transmission of relevant documents to the European Parliament and to the Council.</p>\n</li>\n<li id=\"recital-47\" data-recital=\"47\" class=\"linkable-recital\">\n<p>(47) The committee set up by this Regulation should assist the Commission in all matters related to the implementation of this Regulation, having due regard for the views of sectoral experts.</p>\n</li>\n<li id=\"recital-48\" data-recital=\"48\" class=\"linkable-recital\">\n<p>(48) In order to ensure uniform conditions for the implementation of this Regulation, implementing powers should be conferred on the Commission. Those powers should be exercised in accordance with Regulation (EU) No 182/2011 of the European Parliament and of the Council of 16 February 2011 laying down the rules and general principles concerning mechanisms for control by Member States of the Commission’s exercise of implementing powers (36).</p>\n</li>\n<li id=\"recital-49\" data-recital=\"49\" class=\"linkable-recital\">\n<p>(49) The advisory procedure should be used for the adoption of implementing acts with respect to the objections to <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> and where the references to the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> concerned have not yet been published in the Official Journal of the European Union, given that the relevant <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standard</span> has not yet led to the presumption of conformity with the essential requirements set out in the applicable Union harmonisation legislation.</p>\n</li>\n<li id=\"recital-50\" data-recital=\"50\" class=\"linkable-recital\">\n<p>(50) The examination procedure should be used for each standardisation request submitted to <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the adoption of implementing acts with respect to the objections to <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> and where the references to the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> concerned have already been published in the Official Journal of the European Union, given that such decision could have consequences on the presumption of conformity with the applicable essential requirements.</p>\n</li>\n<li id=\"recital-51\" data-recital=\"51\" class=\"linkable-recital\">\n<p>(51) In order to achieve the main objectives of this Regulation and to facilitate speedy decision-making procedures as well as reducing the overall development time for <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, use should be made as far as possible of the procedural measures provided for in Regulation (EU) No 182/2011, which enables the chair of the relevant committee to lay down a time limit within which the committee should deliver its opinion, according to the urgency of the matter. Moreover, where justified, it should be possible for the opinion of the committee to be obtained by written procedure, and silence on the part of the committee member should be regarded as tacit agreement.</p>\n</li>\n<li id=\"recital-52\" data-recital=\"52\" class=\"linkable-recital\">\n<p>(52) Since the objectives of this Regulation, namely to ensure the effectiveness and efficiency of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and standardisation as policy tools for the Union through cooperation between <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span>, Member States and the Commission, the establishment of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> in support of Union legislation and policies, the identification of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> eligible for referencing, the financing of European standardisation and stakeholder participation in European standardisation cannot be sufficiently achieved by the Member States and can, therefore, by reason of their effect, be better achieved at the Union level, the Union may adopt measures, in accordance with the principle of subsidiarity as set out in Article 5 TEU. In accordance with the principle of proportionality, as set out in that Article, this Regulation does not go beyond what is necessary in order to achieve those objectives.</p>\n</li>\n<li id=\"recital-53\" data-recital=\"53\" class=\"linkable-recital\">\n<p>(53) Directives 89/686/EEC, 93/15/EEC, 94/9/EC, 94/25/EC, 95/16/EC, 97/23/EC, 98/34/EC, 2004/22/EC, 2007/23/EC, 2009/23/EC and 2009/105/EC should therefore be amended accordingly.</p>\n</li>\n<li id=\"recital-54\" data-recital=\"54\" class=\"linkable-recital\">\n<p>(54) Decision No 1673/2006/EC and Decision 87/95/EEC should be repealed,</p>\n</li>\n</ul>\n<p>HAVE ADOPTED THIS REGULATION:</p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Subject matter</strong></p>\n<p>This Regulation establishes rules with regard to the cooperation between <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span>, Member States and the Commission, the establishment of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> for <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and for <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> in support of Union legislation and policies, the identification of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> eligible for referencing, the financing of European standardisation and stakeholder participation in European standardisation.</p>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>For the purposes of this Regulation, the following definitions shall apply:</p>\n<ul>\n<li id=\"article-2-para-1\" data-para=\"1\" data-context=\"article-2\" class=\"linkable-paragraph\">(1) ‘standard’ means a technical specification, adopted by a recognised standardisation body, for repeated or continuous application, with which compliance is not compulsory, and which is one of the following: (a) ‘international standard’ means a standard adopted by an international standardisation body; (b) ‘European standard’ means a standard adopted by a European standardisation organisation; (c) ‘harmonised standard’ means a European standard adopted on the basis of a request made by the Commission for the application of Union harmonisation legislation; (d) ‘national standard’ means a standard adopted by a national standardisation body;</li>\n<li id=\"article-2-para-2\" data-para=\"2\" data-context=\"article-2\" class=\"linkable-paragraph\">(a) ‘international standard’ means a standard adopted by an international standardisation body;</li>\n<li id=\"article-2-para-3\" data-para=\"3\" data-context=\"article-2\" class=\"linkable-paragraph\">(b) ‘European standard’ means a standard adopted by a European standardisation organisation;</li>\n<li id=\"article-2-para-4\" data-para=\"4\" data-context=\"article-2\" class=\"linkable-paragraph\">(c) ‘harmonised standard’ means a European standard adopted on the basis of a request made by the Commission for the application of Union harmonisation legislation;</li>\n<li id=\"article-2-para-5\" data-para=\"5\" data-context=\"article-2\" class=\"linkable-paragraph\">(d) ‘national standard’ means a standard adopted by a national standardisation body;</li>\n<li id=\"article-2-para-2\" data-para=\"2\" data-context=\"article-2\" class=\"linkable-paragraph\">(2) ‘European standardisation deliverable’ means any other technical specification than a European standard, adopted by a European standardisation organisation for repeated or continuous application and with which compliance is not compulsory;</li>\n<li id=\"article-2-para-3\" data-para=\"3\" data-context=\"article-2\" class=\"linkable-paragraph\">(3) ‘draft standard’ means a document containing the text of the technical specifications concerning a given subject, which is being considered for adoption in accordance with the relevant standards procedure, as that document stands after the preparatory work and as circulated for public comment or scrutiny;</li>\n<li id=\"article-2-para-4\" data-para=\"4\" data-context=\"article-2\" class=\"linkable-paragraph\">(4) ‘technical specification’ means a document that prescribes technical requirements to be fulfilled by a product, process, service or system and which lays down one or more of the following: (a) the characteristics required of a product including levels of quality, performance, interoperability, environmental protection, health, safety or dimensions, and including the requirements applicable to the product as regards the name under which the product is sold, terminology, symbols, testing and test methods, packaging, marking or labelling and conformity assessment procedures; (b) production methods and processes used in respect of agricultural products as defined in Article 38(1) TFEU, products intended for human and animal consumption, and medicinal products, as well as production methods and processes relating to other products, where these have an effect on their characteristics; (c) the characteristics required of a service including levels of quality, performance, interoperability, environmental protection, health or safety, and including the requirements applicable to the provider as regards the information to be made available to the recipient, as specified in Article 22(1) to (3) of Directive 2006/123/EC; (d) the methods and the criteria for assessing the performance of construction products, as defined in point 1 of Article 2 of Regulation (EU) No 305/2011 of the European Parliament and of the Council of 9 March 2011 laying down harmonised conditions for the marketing of construction products ( 1 ), in relation to their essential characteristics;</li>\n<li id=\"article-2-para-9\" data-para=\"9\" data-context=\"article-2\" class=\"linkable-paragraph\">(a) the characteristics required of a product including levels of quality, performance, interoperability, environmental protection, health, safety or dimensions, and including the requirements applicable to the product as regards the name under which the product is sold, terminology, symbols, testing and test methods, packaging, marking or labelling and conformity assessment procedures;</li>\n<li id=\"article-2-para-10\" data-para=\"10\" data-context=\"article-2\" class=\"linkable-paragraph\">(b) production methods and processes used in respect of agricultural products as defined in Article 38(1) TFEU, products intended for human and animal consumption, and medicinal products, as well as production methods and processes relating to other products, where these have an effect on their characteristics;</li>\n<li id=\"article-2-para-11\" data-para=\"11\" data-context=\"article-2\" class=\"linkable-paragraph\">(c) the characteristics required of a service including levels of quality, performance, interoperability, environmental protection, health or safety, and including the requirements applicable to the provider as regards the information to be made available to the recipient, as specified in Article 22(1) to (3) of Directive 2006/123/EC;</li>\n<li id=\"article-2-para-12\" data-para=\"12\" data-context=\"article-2\" class=\"linkable-paragraph\">(d) the methods and the criteria for assessing the performance of construction products, as defined in point 1 of Article 2 of Regulation (EU) No 305/2011 of the European Parliament and of the Council of 9 March 2011 laying down harmonised conditions for the marketing of construction products ( 1 ), in relation to their essential characteristics;</li>\n<li id=\"article-2-para-5\" data-para=\"5\" data-context=\"article-2\" class=\"linkable-paragraph\">(5) ‘ICT technical specification’ means a technical specification in the field of information and communication technologies;</li>\n<li id=\"article-2-para-6\" data-para=\"6\" data-context=\"article-2\" class=\"linkable-paragraph\">(6) ‘product’ means any industrially manufactured product and any agricultural product, including fish products;</li>\n<li id=\"article-2-para-7\" data-para=\"7\" data-context=\"article-2\" class=\"linkable-paragraph\">(7) ‘service’ means any self-employed economic activity normally provided for remuneration, as defined in Article 57 TFEU;</li>\n<li id=\"article-2-para-8\" data-para=\"8\" data-context=\"article-2\" class=\"linkable-paragraph\">(8) ‘European standardisation organisation’ means an organisation listed in Annex I;</li>\n<li id=\"article-2-para-9\" data-para=\"9\" data-context=\"article-2\" class=\"linkable-paragraph\">(9) ‘international standardisation body’ means the International Organisation for Standardisation (ISO), the International Electrotechnical Commission (IEC) and the International Telecommunication Union (ITU);</li>\n<li id=\"article-2-para-10\" data-para=\"10\" data-context=\"article-2\" class=\"linkable-paragraph\">(10) ‘national standardisation body’ means a body notified to the Commission by a Member State in accordance with Article 27 of this Regulation.</li>\n</ul>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Transparency of work programmes of standardisation bodies</strong></p>\n<ol>\n<li id=\"article-3-para-1\" data-para=\"1\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>At least once a year, each <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> shall establish its work programme. That work programme shall contain information on the <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> which a <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> or <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> intends to prepare or amend, which it is preparing or amending and which it has adopted in the period of the preceding work programme, unless these are identical or equivalent transpositions of international or <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>.</p>\n</li>\n<li id=\"article-3-para-2\" data-para=\"2\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>The work programme shall indicate, in respect of each <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standard</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverable</span>: (a) the subject matter; (b) the stage attained in the development of the <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>; (c) the references of any <span class=\"term-link\" data-term-id=\"international-standard\" tabindex=\"0\">international standards</span> taken as a basis.</p>\n</li>\n<li id=\"article-3-para-3\" data-para=\"3\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Each <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> shall make its work programme available on its website or any other publicly available website, as well as make a notice of the existence of the work programme available in a national or, where appropriate, European publication of standardisation activities.</p>\n</li>\n<li id=\"article-3-para-4\" data-para=\"4\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>No later than at the time of publication of its work programme, each <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> shall notify the existence thereof to the other <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> and to the Commission. The Commission shall make that information available to the Member States via the committee referred to in Article 22.</p>\n</li>\n<li id=\"article-3-para-5\" data-para=\"5\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span> may not object to a subject for standardisation in their work programme being considered at European level in accordance with the rules laid down by the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and may not undertake any action which could prejudice a decision in this regard.</p>\n</li>\n<li id=\"article-3-para-6\" data-para=\"6\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>During the preparation of a <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> or after its approval, <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> shall not take any action which could prejudice the harmonisation intended and, in particular, shall not publish in the field in question a new or revised <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standard</span> which is not completely in line with an existing <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span>. After publication of a new <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span>, all conflicting <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span> shall be withdrawn within a reasonable deadline.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-3-para-1\" data-para=\"1\" data-context=\"article-3\" class=\"linkable-paragraph\">(a) the subject matter;</li>\n<li id=\"article-3-para-2\" data-para=\"2\" data-context=\"article-3\" class=\"linkable-paragraph\">(b) the stage attained in the development of the <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>;</li>\n<li id=\"article-3-para-3\" data-para=\"3\" data-context=\"article-3\" class=\"linkable-paragraph\">(c) the references of any <span class=\"term-link\" data-term-id=\"international-standard\" tabindex=\"0\">international standards</span> taken as a basis.</li>\n</ul>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>Transparency of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span></strong></p>\n<ol>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Each <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> shall send at least in electronic form any draft <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standard</span>, <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverable</span> to other <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> or the Commission, upon their request.</p>\n</li>\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Each <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> shall within three months reply to, and take due account of, any comments received from any other <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span>, <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> or the Commission with respect to any draft referred to in paragraph 1.</p>\n</li>\n<li id=\"article-4-para-3\" data-para=\"3\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>When a <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span> receives comments indicating that the <span class=\"term-link\" data-term-id=\"draft-standard\" tabindex=\"0\">draft standard</span> would have a negative impact on the internal market, it shall consult the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the Commission before adopting it.</p>\n</li>\n<li id=\"article-4-para-4\" data-para=\"4\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span> shall: (a) ensure access to draft <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span> in such a way that all relevant parties in particular those established in other Member States have the opportunity to submit comments; (b) allow other <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> to be involved passively or actively, by sending an observer, in the planned activities.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">(a) ensure access to draft <span class=\"term-link\" data-term-id=\"national-standard\" tabindex=\"0\">national standards</span> in such a way that all relevant parties in particular those established in other Member States have the opportunity to submit comments;</li>\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">(b) allow other <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> to be involved passively or actively, by sending an observer, in the planned activities.</li>\n</ul>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Stakeholder participation in European standardisation</strong></p>\n<ol>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> shall encourage and facilitate an appropriate representation and effective participation of all relevant stakeholders, including SMEs, consumer organisations and environmental and social stakeholders in their standardisation activities. They shall in particular encourage and facilitate such representation and participation through the European stakeholder organisations receiving Union financing in accordance with this Regulation at the policy development level and at the following stages of the development of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>: (a) the proposal and acceptance of new work items; (b) the technical discussion on proposals; (c) the submission of comments on drafts; (d) the revision of existing <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>; (e) the dissemination of information of, and awareness-building about, adopted <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>.</p>\n</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>In addition to the collaboration with market surveillance authorities in the Member States, research facilities of the Commission and the European stakeholder organisations receiving Union financing in accordance with this Regulation, <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> shall encourage and facilitate appropriate representation, at technical level, of undertakings, research centres, universities and other legal <span class=\"term-link\" data-term-id=\"entity\" tabindex=\"0\">entities</span>, in standardisation activities concerning an emerging area with significant policy or technical innovation implications, if the legal <span class=\"term-link\" data-term-id=\"entity\" tabindex=\"0\">entities</span> concerned participated in a project that is related to that area and that is funded by the Union under a multiannual framework programme for activities in the area of research, innovation and technological development, adopted pursuant to Article 182 TFEU.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">(a) the proposal and acceptance of new work items;</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">(b) the technical discussion on proposals;</li>\n<li id=\"article-5-para-3\" data-para=\"3\" data-context=\"article-5\" class=\"linkable-paragraph\">(c) the submission of comments on drafts;</li>\n<li id=\"article-5-para-4\" data-para=\"4\" data-context=\"article-5\" class=\"linkable-paragraph\">(d) the revision of existing <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>;</li>\n<li id=\"article-5-para-5\" data-para=\"5\" data-context=\"article-5\" class=\"linkable-paragraph\">(e) the dissemination of information of, and awareness-building about, adopted <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>.</li>\n</ul>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong>Access of SMEs to <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span></strong></p>\n<ol>\n<li id=\"article-6-para-1\" data-para=\"1\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span> shall encourage and facilitate the access of SMEs to <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> development processes in order to reach a higher level of participation in the standardisation system, for instance by: (a) identifying, in their annual work programmes, the standardisation projects, which are of particular interests to SMEs; (b) giving access to standardisation activities without obliging SMEs to become a member of a <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span>; (c) providing free access or special rates to participate in standardisation activities; (d) providing free access to <span class=\"term-link\" data-term-id=\"draft-standard\" tabindex=\"0\">draft standards</span>; (e) making available free of charge on their website abstracts of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>; (f) applying special rates for the provision of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> or providing bundles of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> at a reduced price.</p>\n</li>\n<li id=\"article-6-para-2\" data-para=\"2\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span> shall exchange best practices aiming to enhance the participation of SMEs in standardisation activities and to increase and facilitate the use of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> by SMEs.</p>\n</li>\n<li id=\"article-6-para-3\" data-para=\"3\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p><span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span> shall send annual reports to the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> with regards to their activities in paragraphs 1 and 2 and all other measures to improve conditions for SMEs to use <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and to participate in the <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> development process. The <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> shall publish those reports on their websites.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-6-para-1\" data-para=\"1\" data-context=\"article-6\" class=\"linkable-paragraph\">(a) identifying, in their annual work programmes, the standardisation projects, which are of particular interests to SMEs;</li>\n<li id=\"article-6-para-2\" data-para=\"2\" data-context=\"article-6\" class=\"linkable-paragraph\">(b) giving access to standardisation activities without obliging SMEs to become a member of a <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation body</span>;</li>\n<li id=\"article-6-para-3\" data-para=\"3\" data-context=\"article-6\" class=\"linkable-paragraph\">(c) providing free access or special rates to participate in standardisation activities;</li>\n<li id=\"article-6-para-4\" data-para=\"4\" data-context=\"article-6\" class=\"linkable-paragraph\">(d) providing free access to <span class=\"term-link\" data-term-id=\"draft-standard\" tabindex=\"0\">draft standards</span>;</li>\n<li id=\"article-6-para-5\" data-para=\"5\" data-context=\"article-6\" class=\"linkable-paragraph\">(e) making available free of charge on their website abstracts of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>;</li>\n<li id=\"article-6-para-6\" data-para=\"6\" data-context=\"article-6\" class=\"linkable-paragraph\">(f) applying special rates for the provision of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> or providing bundles of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> at a reduced price.</li>\n</ul>\n<h3 id=\"article-7\">Article 7</h3>\n<p><strong>Participation of <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span> in European standardisation</strong></p>\n<p>Member States shall, where appropriate, encourage participation of <span class=\"term-link\" data-term-id=\"public-authority\" tabindex=\"0\">public authorities</span>, including market surveillance authorities, in national standardisation activities aimed at the development or revision of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> requested by the Commission in accordance with Article 10.</p>\n<h3 id=\"article-8\">Article 8</h3>\n<p><strong>The annual Union work programme for European standardisation</strong></p>\n<ol>\n<li id=\"article-8-para-1\" data-para=\"1\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>The Commission shall adopt an annual Union work programme for European standardisation which shall identify strategic priorities for European standardisation, taking into account Union long-term strategies for growth. It shall indicate the <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> that the Commission intends to request from the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> in accordance with Article 10.</p>\n</li>\n<li id=\"article-8-para-2\" data-para=\"2\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>The annual Union work programme for European standardisation shall define the specific objectives and policies for the <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> that the Commission intends to request from the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> in accordance with Article 10. In cases of urgency the Commission can issue requests without prior indication.</p>\n</li>\n<li id=\"article-8-para-3\" data-para=\"3\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>The annual Union work programme for European standardisation shall also include objectives for the international dimension of European standardisation, in support of Union legislation and policies.</p>\n</li>\n<li id=\"article-8-para-4\" data-para=\"4\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>The annual Union work programme for European standardisation shall be adopted after having conducted a broad consultation of relevant stakeholders, including <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and European stakeholder organisations receiving Union financing in accordance with this Regulation, and Member States via the committee referred to in Article 22 of this Regulation.</p>\n</li>\n<li id=\"article-8-para-5\" data-para=\"5\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>After its adoption, the Commission shall make the annual Union work programme for European standardisation available on its website.</p>\n</li>\n</ol>\n<h3 id=\"article-9\">Article 9</h3>\n<p><strong>Cooperation with research facilities</strong></p>\n<p>The Commission’s research facilities shall contribute to the preparation of the annual Union work programme for European standardisation referred to in Article 8 and provide <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> with scientific input, in their areas of expertise, to ensure that <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> take into account economic competitiveness and societal needs such as environmental sustainability and safety and security concerns.</p>\n<h3 id=\"article-10\">Article 10</h3>\n<p><strong>Standardisation requests to <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span></strong></p>\n<ol>\n<li id=\"article-10-para-1\" data-para=\"1\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>The Commission may, within the limitations of the competences laid down in the Treaties, request that one or more <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> draft a <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverable</span> within a set deadline, provided that the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> concerned complies with paragraph 2a. <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> shall be market-driven, take into account the public interest as well as the policy objectives clearly stated in the Commission’s request and be based on consensus. The Commission shall determine the requirements as to the content to be met by the requested document and a deadline for its adoption.</p>\n</li>\n<li id=\"article-10-para-2\" data-para=\"2\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>The decisions referred to in paragraph 1 shall be adopted in accordance with the procedure laid down in Article 22(3) after consultation of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the European stakeholder organisations receiving Union financing in accordance with this Regulation as well as the committee set up by the corresponding Union legislation, when such a committee exists, or after other forms of consultation of sectoral experts.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-10-para-2a\" data-para=\"2a\" data-context=\"article-10\" class=\"linkable-paragraph\">(2a) Without prejudice to other advisory opinions, each <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> shall ensure that the following decisions concerning <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> referred to in paragraph 1 are taken exclusively by <span class=\"term-link\" data-term-id=\"representative\" tabindex=\"0\">representatives</span> of the <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> within the competent decision-making body of that organisation: (a) decisions on the acceptance and refusal of standardisation requests; (b) decisions on the acceptance of new work items that are needed for the fulfilment of the standardisation request; and (c) decisions on the adoption, revision and withdrawal of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>.</li>\n</ul>\n<ol start=\"3\">\n<li id=\"article-10-para-3\" data-para=\"3\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>The relevant <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> shall indicate, within one month following its receipt, if it accepts the request referred to in paragraph 1.</p>\n</li>\n<li id=\"article-10-para-4\" data-para=\"4\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>Where a request for funding is made, the Commission shall inform the relevant <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, within two months following the receipt of the acceptance referred to in paragraph 3, about the award of a grant for drafting a <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> or a <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverable</span>.</p>\n</li>\n<li id=\"article-10-para-5\" data-para=\"5\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> shall inform the Commission about the activities undertaken for the development of the documents referred to in paragraph 1. The Commission together with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> shall assess the compliance of the documents drafted by the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> with its initial request.</p>\n</li>\n<li id=\"article-10-para-6\" data-para=\"6\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>Where a <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> satisfies the requirements which it aims to cover and which are set out in the corresponding Union harmonisation legislation, the Commission shall publish a reference of such <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> without delay in the Official Journal of the European Union or by other means in accordance with the conditions laid down in the corresponding act of Union harmonisation legislation.</p>\n</li>\n<li id=\"article-10-para-7\" data-para=\"7\" data-context=\"article-10\" class=\"linkable-paragraph\">\n<p>Where a <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> drafted in support of Regulation (EU) 2023/988 of the European Parliament and of the Council ( 2 ) satisfies the general safety requirement laid down in Article 5 of that Regulation and the specific safety requirements referred to in Article 7(2) of that Regulation, the Commission shall publish a reference to that <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> without delay in the Official Journal of the European Union.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-10-para-1\" data-para=\"1\" data-context=\"article-10\" class=\"linkable-paragraph\">(a) decisions on the acceptance and refusal of standardisation requests;</li>\n<li id=\"article-10-para-2\" data-para=\"2\" data-context=\"article-10\" class=\"linkable-paragraph\">(b) decisions on the acceptance of new work items that are needed for the fulfilment of the standardisation request; and</li>\n<li id=\"article-10-para-3\" data-para=\"3\" data-context=\"article-10\" class=\"linkable-paragraph\">(c) decisions on the adoption, revision and withdrawal of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>.</li>\n</ul>\n<h3 id=\"article-11\">Article 11</h3>\n<p><strong>Formal objections to <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span></strong></p>\n<ol>\n<li id=\"article-11-para-1\" data-para=\"1\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p>When a Member State or the European Parliament considers that a <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> or <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> drafted in support of Regulation (EU) 2023/988 does not entirely satisfy the requirements which it aims to cover and which are set out in the relevant Union harmonisation legislation or in that Regulation, it shall inform the Commission thereof with a detailed explanation. The Commission shall, after consulting the committee set up by the corresponding Union harmonisation legislation, if it exists, or the committee set up by that Regulation, or after other forms of consultation of sectoral experts, decide: (a) to publish, not to publish or to publish with restriction the references to the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> or <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> concerned drafted in support of that Regulation in the Official Journal of the European Union; and (b) to maintain, to maintain with restriction or to withdraw the references to the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> or <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> concerned drafted in support of that Regulation in or from the Official Journal of the European Union.</p>\n</li>\n<li id=\"article-11-para-2\" data-para=\"2\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p>The Commission shall publish information on its website on the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> and <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> drafted in support of Regulation (EU) 2023/988 that have been subject to a decision pursuant to paragraph 1.</p>\n</li>\n<li id=\"article-11-para-3\" data-para=\"3\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p>The Commission shall inform the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisation</span> concerned of any decision adopted pursuant to paragraph 1 and, if necessary, request the revision of the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> or of the <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> concerned drafted in support of Regulation (EU) 2023/988.</p>\n</li>\n<li id=\"article-11-para-4\" data-para=\"4\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p>The decision referred to in point (a) of paragraph 1 of this Article shall be adopted in accordance with the advisory procedure referred to in Article 22(2).</p>\n</li>\n<li id=\"article-11-para-5\" data-para=\"5\" data-context=\"article-11\" class=\"linkable-paragraph\">\n<p>The decision referred to in point (b) of paragraph 1 of this Article shall be adopted in accordance with the examination procedure referred to in Article 22(3).</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-11-para-1\" data-para=\"1\" data-context=\"article-11\" class=\"linkable-paragraph\">(a) to publish, not to publish or to publish with restriction the references to the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> or <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> concerned drafted in support of that Regulation in the Official Journal of the European Union; and</li>\n<li id=\"article-11-para-2\" data-para=\"2\" data-context=\"article-11\" class=\"linkable-paragraph\">(b) to maintain, to maintain with restriction or to withdraw the references to the <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standard</span> or <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standard</span> concerned drafted in support of that Regulation in or from the Official Journal of the European Union.</li>\n</ul>\n<h3 id=\"article-12\">Article 12</h3>\n<p><strong>Notification of stakeholder organisations</strong></p>\n<p>The Commission shall establish a notification system for all stakeholders, including <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and European stakeholder organisations receiving Union financing in accordance with this Regulation in order to ensure proper consultation and market relevance prior to:</p>\n<ul>\n<li id=\"article-12-para-1\" data-para=\"1\" data-context=\"article-12\" class=\"linkable-paragraph\">(a) adopting the annual Union work programme for European standardisation referred to in Article 8(1);</li>\n<li id=\"article-12-para-2\" data-para=\"2\" data-context=\"article-12\" class=\"linkable-paragraph\">(b) adopting standardisation requests referred to in Article 10;</li>\n<li id=\"article-12-para-3\" data-para=\"3\" data-context=\"article-12\" class=\"linkable-paragraph\">(c) taking a decision on formal objections to <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span>, as referred to in Article 11(1);</li>\n<li id=\"article-12-para-4\" data-para=\"4\" data-context=\"article-12\" class=\"linkable-paragraph\">(d) taking a decision on identifications of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> referred to in Article 13;</li>\n<li id=\"article-12-para-5\" data-para=\"5\" data-context=\"article-12\" class=\"linkable-paragraph\">(e) adopting delegated acts referred to in Article 20.</li>\n</ul>\n<h3 id=\"article-13\">Article 13</h3>\n<p><strong>Identification of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> eligible for referencing</strong></p>\n<ol>\n<li id=\"article-13-para-1\" data-para=\"1\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>Either on proposal from a Member State or on its own initiative the Commission may decide to identify <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> that are not national, European or <span class=\"term-link\" data-term-id=\"international-standard\" tabindex=\"0\">international standards</span>, but meet the requirements set out in Annex II, which may be referenced, primarily to enable interoperability, in public procurement.</p>\n</li>\n<li id=\"article-13-para-2\" data-para=\"2\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>Either on proposal from a Member State or on its own initiative, when an <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specification</span> identified in accordance with paragraph 1 is modified, withdrawn or no longer meets the requirements set out in Annex II, the Commission may decide to identify the modified <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specification</span> or to withdraw the identification.</p>\n</li>\n<li id=\"article-13-para-3\" data-para=\"3\" data-context=\"article-13\" class=\"linkable-paragraph\">\n<p>The decisions provided for in paragraphs 1 and 2 shall be adopted after consultation of the European multi-stakeholder platform on ICT standardisation, which includes <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, Member States and relevant stakeholders, and after consultation of the committee set up by the corresponding Union legislation, if it exists, or after other forms of consultation of sectoral experts, if such a committee does not exist.</p>\n</li>\n</ol>\n<h3 id=\"article-14\">Article 14</h3>\n<p><strong>Use of <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> in public procurement</strong></p>\n<p>The <span class=\"term-link\" data-term-id=\"ict-technical-specification\" tabindex=\"0\">ICT technical specifications</span> referred to in Article 13 of this Regulation shall constitute common <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> referred to in Directives 2004/17/EC, 2004/18/EC and 2009/81/EC, and Regulation (EC, Euratom) No 2342/2002.</p>\n<h3 id=\"article-15\">Article 15</h3>\n<p><strong>Financing of standardisation organisations by the Union</strong></p>\n<ol>\n<li id=\"article-15-para-1\" data-para=\"1\" data-context=\"article-15\" class=\"linkable-paragraph\">\n<p>The financing by the Union may be granted to the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> for the following standardisation activities: (a) the development and revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> which is necessary and suitable for the support of Union legislation and policies; (b) the verification of the quality, and conformity to the corresponding Union legislation and policies, of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>; (c) the performance of preliminary or ancillary work in connection with European standardisation, including studies, cooperation activities, including international cooperation, seminars, evaluations, comparative analyses, research work, laboratory work, inter-laboratory tests, conformity evaluation work and measures to ensure that the periods for the development and the revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> are shortened without prejudice to the founding principles, especially the principles of openness, quality, transparency and consensus among all stakeholders; (d) the activities of the central secretariats of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, including policy development, the coordination of standardisation activities, the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of technical work and the provision of information to interested parties; (e) the translation of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> used in support of Union legislation and policies into the official Union languages other than the working languages of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> or, in duly justified cases into languages other than the official Union languages; (f) the drawing up of information to explain, interpret and simplify <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>, including the drawing up of <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> guides, abstracts of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, best practice information and awareness-building actions, strategies and training programmes; (g) activities seeking to carry out programmes of technical assistance, cooperation with third countries and the promotion and enhancement of the European standardisation system and of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> among interested parties in the Union and at international level.</p>\n</li>\n<li id=\"article-15-para-2\" data-para=\"2\" data-context=\"article-15\" class=\"linkable-paragraph\">\n<p>The financing by the Union may also be granted to: (a) <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> for the standardisation activities referred to in paragraph 1, which they jointly undertake with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>; (b) other bodies which have been entrusted with contributing to the activities referred to in point (a) of paragraph 1, or carrying out the activities referred to in points (c) and (g) of paragraph 1, in cooperation with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-15-para-1\" data-para=\"1\" data-context=\"article-15\" class=\"linkable-paragraph\">(a) the development and revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> which is necessary and suitable for the support of Union legislation and policies;</li>\n<li id=\"article-15-para-2\" data-para=\"2\" data-context=\"article-15\" class=\"linkable-paragraph\">(b) the verification of the quality, and conformity to the corresponding Union legislation and policies, of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>;</li>\n<li id=\"article-15-para-3\" data-para=\"3\" data-context=\"article-15\" class=\"linkable-paragraph\">(c) the performance of preliminary or ancillary work in connection with European standardisation, including studies, cooperation activities, including international cooperation, seminars, evaluations, comparative analyses, research work, laboratory work, inter-laboratory tests, conformity evaluation work and measures to ensure that the periods for the development and the revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> are shortened without prejudice to the founding principles, especially the principles of openness, quality, transparency and consensus among all stakeholders;</li>\n<li id=\"article-15-para-4\" data-para=\"4\" data-context=\"article-15\" class=\"linkable-paragraph\">(d) the activities of the central secretariats of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>, including policy development, the coordination of standardisation activities, the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of technical work and the provision of information to interested parties;</li>\n<li id=\"article-15-para-5\" data-para=\"5\" data-context=\"article-15\" class=\"linkable-paragraph\">(e) the translation of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> used in support of Union legislation and policies into the official Union languages other than the working languages of the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> or, in duly justified cases into languages other than the official Union languages;</li>\n<li id=\"article-15-para-6\" data-para=\"6\" data-context=\"article-15\" class=\"linkable-paragraph\">(f) the drawing up of information to explain, interpret and simplify <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>, including the drawing up of <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> guides, abstracts of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, best practice information and awareness-building actions, strategies and training programmes;</li>\n<li id=\"article-15-para-7\" data-para=\"7\" data-context=\"article-15\" class=\"linkable-paragraph\">(g) activities seeking to carry out programmes of technical assistance, cooperation with third countries and the promotion and enhancement of the European standardisation system and of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> among interested parties in the Union and at international level.</li>\n<li id=\"article-15-para-8\" data-para=\"8\" data-context=\"article-15\" class=\"linkable-paragraph\">(a) <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> for the standardisation activities referred to in paragraph 1, which they jointly undertake with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>;</li>\n<li id=\"article-15-para-9\" data-para=\"9\" data-context=\"article-15\" class=\"linkable-paragraph\">(b) other bodies which have been entrusted with contributing to the activities referred to in point (a) of paragraph 1, or carrying out the activities referred to in points (c) and (g) of paragraph 1, in cooperation with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</li>\n</ul>\n<h3 id=\"article-16\">Article 16</h3>\n<p><strong>Financing of other European organisations by the Union</strong></p>\n<p>The financing by the Union may be granted to the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation for the following activities:</p>\n<ul>\n<li id=\"article-16-para-1\" data-para=\"1\" data-context=\"article-16\" class=\"linkable-paragraph\">(a) the functioning of these organisations and of their activities relating to European and international standardisation, including the <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> of technical work and the provision of information to members and other interested parties;</li>\n<li id=\"article-16-para-2\" data-para=\"2\" data-context=\"article-16\" class=\"linkable-paragraph\">(b) the provision of legal and technical expertise, including studies, in relation to assessment of the need for, and the development of, <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> and training of experts;</li>\n<li id=\"article-16-para-3\" data-para=\"3\" data-context=\"article-16\" class=\"linkable-paragraph\">(c) the participation in the technical work with respect to the development and revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> which is necessary and suitable for the support of Union legislation and policies;</li>\n<li id=\"article-16-para-4\" data-para=\"4\" data-context=\"article-16\" class=\"linkable-paragraph\">(d) the promotion of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span>, and the information on, and use of, <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> among interested parties, including SMEs and consumers.</li>\n</ul>\n<h3 id=\"article-17\">Article 17</h3>\n<p><strong>Financing arrangements</strong></p>\n<ol>\n<li id=\"article-17-para-1\" data-para=\"1\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>Financing by the Union shall be provided in the form of: (a) grants without a call for proposals, or contracts after public procurement procedures, to: (i) <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> to carry out the activities referred to in Article 15(1); (ii) bodies identified by a basic act, within the meaning of Article 49 of Regulation (EC, Euratom) No 1605/2002, to carry out, in collaboration with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> the activities referred to in point (c) of Article 15(1) of this Regulation; (b) grants after a call for proposals, or contracts after public procurement procedures, to other bodies referred to in point (b) of Article 15(2): (i) for contributing to the development and revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> referred to in point (a) of Article 15(1); (ii) for carrying out the preliminary or ancillary work referred to in point (c) of Article 15(1); (iii) for carrying out the activities referred to in point (g) of Article 15(1); (c) grants after a call for proposals to the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation to carry out the activities referred to in Article 16.</p>\n</li>\n<li id=\"article-17-para-2\" data-para=\"2\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>The activities of the bodies referred to in paragraph 1 may be financed by: (a) grants for actions; (b) operating grants for the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation in accordance with the rules set out in Regulation (EC, Euratom) No 1605/2002. In the event of renewal, operating grants shall not be automatically decreased.</p>\n</li>\n<li id=\"article-17-para-3\" data-para=\"3\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>The Commission shall decide on the financing arrangements referred to in paragraphs 1 and 2, on the amounts of the grants and, where necessary, on the maximum percentage of financing by type of activity.</p>\n</li>\n<li id=\"article-17-para-4\" data-para=\"4\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>Except in duly justified cases, grants awarded for the standardisation activities referred to in points (a) and (b) of Article 15(1) shall take the form of lump sums and for the standardisation activities referred to in point (a) of Article 15(1) shall be paid upon fulfilment of the following conditions: (a) <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> requested by the Commission in accordance with Article 10 are adopted or revised within a period not exceeding the period specified in the request referred to in that Article; (b) SMEs, consumer organisations and environmental and social stakeholders are appropriately represented and can participate in European standardisation activities, as referred to in Article 5(1).</p>\n</li>\n<li id=\"article-17-para-5\" data-para=\"5\" data-context=\"article-17\" class=\"linkable-paragraph\">\n<p>The common cooperation objectives and the administrative and financial conditions relating to the grants awarded to <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation shall be defined in the framework partnership agreements between the Commission and those standardisation and stakeholder organisations, in accordance with Regulations (EC, Euratom) No 1605/2002 and (EC, Euratom) No 2342/2002. The Commission shall inform the European Parliament and the Council of the conclusion of those agreements.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-17-para-1\" data-para=\"1\" data-context=\"article-17\" class=\"linkable-paragraph\">(a) grants without a call for proposals, or contracts after public procurement procedures, to: (i) <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> to carry out the activities referred to in Article 15(1); (ii) bodies identified by a basic act, within the meaning of Article 49 of Regulation (EC, Euratom) No 1605/2002, to carry out, in collaboration with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> the activities referred to in point (c) of Article 15(1) of this Regulation;</li>\n<li id=\"article-17-para-2\" data-para=\"2\" data-context=\"article-17\" class=\"linkable-paragraph\">(i) <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> to carry out the activities referred to in Article 15(1);</li>\n<li id=\"article-17-para-3\" data-para=\"3\" data-context=\"article-17\" class=\"linkable-paragraph\">(ii) bodies identified by a basic act, within the meaning of Article 49 of Regulation (EC, Euratom) No 1605/2002, to carry out, in collaboration with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> the activities referred to in point (c) of Article 15(1) of this Regulation;</li>\n<li id=\"article-17-para-4\" data-para=\"4\" data-context=\"article-17\" class=\"linkable-paragraph\">(b) grants after a call for proposals, or contracts after public procurement procedures, to other bodies referred to in point (b) of Article 15(2): (i) for contributing to the development and revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> referred to in point (a) of Article 15(1); (ii) for carrying out the preliminary or ancillary work referred to in point (c) of Article 15(1); (iii) for carrying out the activities referred to in point (g) of Article 15(1);</li>\n<li id=\"article-17-para-5\" data-para=\"5\" data-context=\"article-17\" class=\"linkable-paragraph\">(i) for contributing to the development and revision of <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> referred to in point (a) of Article 15(1);</li>\n<li id=\"article-17-para-6\" data-para=\"6\" data-context=\"article-17\" class=\"linkable-paragraph\">(ii) for carrying out the preliminary or ancillary work referred to in point (c) of Article 15(1);</li>\n<li id=\"article-17-para-7\" data-para=\"7\" data-context=\"article-17\" class=\"linkable-paragraph\">(iii) for carrying out the activities referred to in point (g) of Article 15(1);</li>\n<li id=\"article-17-para-8\" data-para=\"8\" data-context=\"article-17\" class=\"linkable-paragraph\">(c) grants after a call for proposals to the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation to carry out the activities referred to in Article 16.</li>\n<li id=\"article-17-para-9\" data-para=\"9\" data-context=\"article-17\" class=\"linkable-paragraph\">(a) grants for actions;</li>\n<li id=\"article-17-para-10\" data-para=\"10\" data-context=\"article-17\" class=\"linkable-paragraph\">(b) operating grants for the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the European stakeholder organisations meeting the criteria set out in Annex III to this Regulation in accordance with the rules set out in Regulation (EC, Euratom) No 1605/2002. In the event of renewal, operating grants shall not be automatically decreased.</li>\n<li id=\"article-17-para-11\" data-para=\"11\" data-context=\"article-17\" class=\"linkable-paragraph\">(a) <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span> or <span class=\"term-link\" data-term-id=\"european-standardisation-deliverable\" tabindex=\"0\">European standardisation deliverables</span> requested by the Commission in accordance with Article 10 are adopted or revised within a period not exceeding the period specified in the request referred to in that Article;</li>\n<li id=\"article-17-para-12\" data-para=\"12\" data-context=\"article-17\" class=\"linkable-paragraph\">(b) SMEs, consumer organisations and environmental and social stakeholders are appropriately represented and can participate in European standardisation activities, as referred to in Article 5(1).</li>\n</ul>\n<h3 id=\"article-18\">Article 18</h3>\n<p><strong>Management</strong></p>\n<p>The appropriations determined by the budgetary authority for the financing of standardisation activities may also cover the administrative expenses relating to the preparation, monitoring, inspection, auditing and evaluation which are directly necessary for the purposes of implementing Articles 15, 16 and 17, including studies, meetings, information and publication activities, expenses relating to informatics networks for the exchange of information and any other expenditure on administrative and technical assistance which the Commission may use for standardisation activities.</p>\n<h3 id=\"article-19\">Article 19</h3>\n<p><strong>Protection of the financial interests of the Union</strong></p>\n<ol>\n<li id=\"article-19-para-1\" data-para=\"1\" data-context=\"article-19\" class=\"linkable-paragraph\">\n<p>The Commission shall ensure that, when the activities financed under this Regulation are implemented, the financial interests of the Union are protected by the application of preventive measures against fraud, corruption and other illegal activities, by effective checks and by the recovery of amounts unduly paid and, if irregularities are detected, by effective, proportionate and dissuasive penalties, in accordance with Regulations (EC, Euratom) No 2988/95, (Euratom, EC) No 2185/96 and (EC) No 1073/1999.</p>\n</li>\n<li id=\"article-19-para-2\" data-para=\"2\" data-context=\"article-19\" class=\"linkable-paragraph\">\n<p>For the Union activities financed pursuant to this Regulation, the notion of irregularity defined in Article 1(2) of Regulation (EC, Euratom) No 2988/95 shall mean any infringement of a provision of Union law or any breach of a contractual obligation resulting from an act or omission by an economic operator which has, or would have, the effect of prejudicing the general budget of the Union or budgets managed by it by an unjustified item of expenditure.</p>\n</li>\n<li id=\"article-19-para-3\" data-para=\"3\" data-context=\"article-19\" class=\"linkable-paragraph\">\n<p>Any agreements and contracts resulting from this Regulation shall provide for monitoring and financial control by the Commission or any <span class=\"term-link\" data-term-id=\"representative\" tabindex=\"0\">representative</span> which it authorises and for audits by the European Court of Auditors, which if necessary may be conducted on the spot.</p>\n</li>\n</ol>\n<h3 id=\"article-20\">Article 20</h3>\n<p><strong>Delegated acts</strong></p>\n<p>The Commission shall be empowered to adopt delegated acts in accordance with Article 21 concerning amendments to the Annexes, in order to:</p>\n<ul>\n<li id=\"article-20-para-1\" data-para=\"1\" data-context=\"article-20\" class=\"linkable-paragraph\">(a) update the list of <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> set out in Annex I to take into account changes in their name or structure;</li>\n<li id=\"article-20-para-2\" data-para=\"2\" data-context=\"article-20\" class=\"linkable-paragraph\">(b) adapt the criteria for European stakeholder organisations set out in Annex III to this Regulation to further developments as regards their non-profit making nature and representativity. Such adaptations shall not have the effect of creating any new criteria or abolishing any existing criteria or category of organisation.</li>\n</ul>\n<h3 id=\"article-21\">Article 21</h3>\n<p><strong>Exercise of the delegation</strong></p>\n<ol>\n<li id=\"article-21-para-1\" data-para=\"1\" data-context=\"article-21\" class=\"linkable-paragraph\">\n<p>The power to adopt delegated acts is conferred on the Commission subject to the conditions laid down in this Article.</p>\n</li>\n<li id=\"article-21-para-2\" data-para=\"2\" data-context=\"article-21\" class=\"linkable-paragraph\">\n<p>The power to adopt delegated acts referred to in Article 20 shall be conferred on the Commission for a period of five years from 1 January 2013. The Commission shall draw up a report in respect of the delegation of power not later than nine months before the end of the five-year period. The delegation of power shall be tacitly extended for periods of an identical duration, unless the European Parliament or the Council opposes such extension not later than three months before the end of each period.</p>\n</li>\n<li id=\"article-21-para-3\" data-para=\"3\" data-context=\"article-21\" class=\"linkable-paragraph\">\n<p>The delegation of power referred to in Article 20 may be revoked at any time by the European Parliament or by the Council. A decision to revoke shall put an end to the delegation of the power specified in that decision. It shall take effect the day following the publication of the decision in the Official Journal of the European Union or at a later date specified therein. It shall not affect the validity of any delegated acts already in force.</p>\n</li>\n<li id=\"article-21-para-4\" data-para=\"4\" data-context=\"article-21\" class=\"linkable-paragraph\">\n<p>As soon as it adopts a delegated act, the Commission shall notify it simultaneously to the European Parliament and to the Council.</p>\n</li>\n<li id=\"article-21-para-5\" data-para=\"5\" data-context=\"article-21\" class=\"linkable-paragraph\">\n<p>A delegated act adopted pursuant to Article 20 shall enter into force only if no objection has been expressed either by the European Parliament or the Council within a period of two months of notification of that act to the European Parliament and the Council or if, before the expiry of that period, the European Parliament and the Council have both informed the Commission that they will not object. That period shall be extended by two months at the initiative of the European Parliament or of the Council.</p>\n</li>\n</ol>\n<h3 id=\"article-22\">Article 22</h3>\n<p><strong>Committee procedure</strong></p>\n<ol>\n<li id=\"article-22-para-1\" data-para=\"1\" data-context=\"article-22\" class=\"linkable-paragraph\">\n<p>The Commission shall be assisted by a committee. That committee shall be a committee within the meaning of Regulation (EU) No 182/2011.</p>\n</li>\n<li id=\"article-22-para-2\" data-para=\"2\" data-context=\"article-22\" class=\"linkable-paragraph\">\n<p>Where reference is made to this paragraph, Article 4 of Regulation (EU) No 182/2011 shall apply.</p>\n</li>\n<li id=\"article-22-para-3\" data-para=\"3\" data-context=\"article-22\" class=\"linkable-paragraph\">\n<p>Where reference is made to this paragraph, Article 5 of Regulation (EU) No 182/2011 shall apply.</p>\n</li>\n<li id=\"article-22-para-4\" data-para=\"4\" data-context=\"article-22\" class=\"linkable-paragraph\">\n<p>Where the opinion of the committee is to be obtained by written procedure, that procedure shall be terminated without result when, within the time-limit for delivery of the opinion, the chair of the committee so decides or a simple majority of committee members so request.</p>\n</li>\n</ol>\n<h3 id=\"article-23\">Article 23</h3>\n<p><strong>Committee cooperation with standardisation organisations and stakeholders</strong></p>\n<p>The committee referred to in Article 22(1) shall work in cooperation with the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> and the European stakeholder organisations receiving Union financing in accordance with this Regulation.</p>\n<h3 id=\"article-24\">Article 24</h3>\n<p><strong>Reports</strong></p>\n<ol>\n<li id=\"article-24-para-1\" data-para=\"1\" data-context=\"article-24\" class=\"linkable-paragraph\">\n<p>The <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span> shall send an annual report on the implementation of this Regulation to the Commission. It shall contain detailed information on the following: (a) the application of Articles 4, 5, 10, 15 and 17; (b) the representation of SMEs, consumer organisations and environmental and social stakeholders in <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span>; (c) the representation of SMEs on the basis of the annual reports referred to in Article 6(3); (d) the use of ICT in the standardisation system; (e) cooperation between the <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</p>\n</li>\n<li id=\"article-24-para-2\" data-para=\"2\" data-context=\"article-24\" class=\"linkable-paragraph\">\n<p>The European stakeholder organisations that received Union financing in accordance with this Regulation shall send an annual report on their activities to the Commission. This report shall contain in particular detailed information about the membership of these organisations and the activities referred to in Article 16.</p>\n</li>\n<li id=\"article-24-para-3\" data-para=\"3\" data-context=\"article-24\" class=\"linkable-paragraph\">\n<p>By 31 December 2015 and every five years thereafter, the Commission shall present a report to the European Parliament and to the Council on the implementation of this Regulation. This report shall contain an analysis of the annual reports referred to in paragraphs 1 and 2, an evaluation of the relevance of the standardisation activities receiving Union financing in the light of the requirements of Union legislation and policies as well as an assessment of potential new measures to simplify the financing of European standardisation and to reduce the administrative burden for the <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</p>\n</li>\n</ol>\n<ul>\n<li id=\"article-24-para-1\" data-para=\"1\" data-context=\"article-24\" class=\"linkable-paragraph\">(a) the application of Articles 4, 5, 10, 15 and 17;</li>\n<li id=\"article-24-para-2\" data-para=\"2\" data-context=\"article-24\" class=\"linkable-paragraph\">(b) the representation of SMEs, consumer organisations and environmental and social stakeholders in <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span>;</li>\n<li id=\"article-24-para-3\" data-para=\"3\" data-context=\"article-24\" class=\"linkable-paragraph\">(c) the representation of SMEs on the basis of the annual reports referred to in Article 6(3);</li>\n<li id=\"article-24-para-4\" data-para=\"4\" data-context=\"article-24\" class=\"linkable-paragraph\">(d) the use of ICT in the standardisation system;</li>\n<li id=\"article-24-para-5\" data-para=\"5\" data-context=\"article-24\" class=\"linkable-paragraph\">(e) cooperation between the <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> and <span class=\"term-link\" data-term-id=\"european-standardisation-organisation\" tabindex=\"0\">European standardisation organisations</span>.</li>\n</ul>\n<h3 id=\"article-25\">Article 25</h3>\n<p><strong>Review</strong></p>\n<p>By 2 January 2015, the Commission shall evaluate the impact of the procedure established by Article 10 of this Regulation on the timeframe for issuing standardisation requests. The Commission shall present its conclusions in a report to the European Parliament and to the Council. Where appropriate, that report shall be accompanied by a legislative proposal to amend this Regulation.</p>\n<h3 id=\"article-26\">Article 26</h3>\n<p><strong>Amendments</strong></p>\n<ol>\n<li id=\"article-26-para-1\" data-para=\"1\" data-context=\"article-26\" class=\"linkable-paragraph\">The following provisions are deleted: (a) Article 6(1) of Directive 89/686/EEC; ————— ————— (d) Article 6(1) of Directive 94/25/EC; (e) Article 6(1) of Directive 95/16/EC; (f) Article 6 of Directive 97/23/EC; ————— (h) Article 8(4) of Directive 2007/23/EC; ————— —————</li>\n</ol>\n<p>References to those deleted provisions shall be construed as references to Article 11 of this Regulation.</p>\n<ul>\n<li id=\"article-26-para-1\" data-para=\"1\" data-context=\"article-26\" class=\"linkable-paragraph\">(a) Article 6(1) of Directive 89/686/EEC;</li>\n<li id=\"article-26-para-2\" data-para=\"2\" data-context=\"article-26\" class=\"linkable-paragraph\">(d) Article 6(1) of Directive 94/25/EC;</li>\n<li id=\"article-26-para-3\" data-para=\"3\" data-context=\"article-26\" class=\"linkable-paragraph\">(e) Article 6(1) of Directive 95/16/EC;</li>\n<li id=\"article-26-para-4\" data-para=\"4\" data-context=\"article-26\" class=\"linkable-paragraph\">(f) Article 6 of Directive 97/23/EC;</li>\n<li id=\"article-26-para-5\" data-para=\"5\" data-context=\"article-26\" class=\"linkable-paragraph\">(h) Article 8(4) of Directive 2007/23/EC;</li>\n</ul>\n<h3 id=\"article-27\">Article 27</h3>\n<p><strong><span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">National standardisation bodies</span></strong></p>\n<p>Member States shall inform the Commission of their standardisation bodies.</p>\n<p>The Commission shall publish a list of <span class=\"term-link\" data-term-id=\"national-standardisation-body\" tabindex=\"0\">national standardisation bodies</span> and any updates to that list in the Official Journal of the European Union.</p>\n<h3 id=\"article-28\">Article 28</h3>\n<p><strong>Transitional provisions</strong></p>\n<p>In Union acts that provide for a presumption of conformity with essential requirements through the application of <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span> adopted in accordance with Directive 98/34/EC, references to Directive 98/34/EC shall be construed as references to this Regulation, except references to the committee set up by Article 5 of Directive 98/34/EC regarding technical regulations.</p>\n<p>Where a Union act provides for a procedure for objection to <span class=\"term-link\" data-term-id=\"harmonised-standard\" tabindex=\"0\">harmonised standards</span>, Article 11 of this Regulation shall not apply to that act.</p>\n<h3 id=\"article-29\">Article 29</h3>\n<p><strong>Repeal</strong></p>\n<p>Decision No 1673/2006/EC and Decision 87/95/EEC are hereby repealed.</p>\n<p>References to the repealed Decisions shall be construed as references to this Regulation and shall be read in accordance with the correlation table set out in Annex IV to this Regulation.</p>\n<h3 id=\"article-30\">Article 30</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Regulation shall enter into force on the twentieth day following that of its publication in the Official Journal of the European Union.</p>\n<p>It shall apply from 1 January 2013.</p>",
  "wordCount": 12481,
  "lastProcessed": "2026-01-21T20:58:46.978Z",
  "preambleInjected": false
}