{
  "slug": "2020-67",
  "type": "regulation",
  "legalType": "communication",
  "category": "supplementary",
  "title": "Communication from the Commission: Shaping Europe's Digital Future",
  "shortTitle": "Digital Future Communication",
  "sidebarTitle": "Digital Future",
  "description": "Communication from the Commission: Shaping Europe's Digital Future",
  "celex": "52020DC0067",
  "date": "2020",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=celex:52020DC0067",
  "version": null,
  "toc": [
    {
      "id": "1-introduction",
      "title": "1. Introduction",
      "level": 2
    },
    {
      "id": "2-our-vision-and-goals",
      "title": "2. Our Vision and Goals",
      "level": 2
    },
    {
      "id": "three-key-objectives",
      "title": "Three Key Objectives",
      "level": 3
    },
    {
      "id": "a-technology-that-works-for-people",
      "title": "A. Technology that Works for People",
      "level": 2
    },
    {
      "id": "key-actions",
      "title": "Key Actions",
      "level": 3
    },
    {
      "id": "b-a-fair-and-competitive-economy",
      "title": "B. A Fair and Competitive Economy",
      "level": 2
    },
    {
      "id": "key-actions-1",
      "title": "Key Actions",
      "level": 3
    },
    {
      "id": "c-an-open-democratic-and-sustainable-society",
      "title": "C. An Open, Democratic and Sustainable Society",
      "level": 2
    },
    {
      "id": "key-actions-2",
      "title": "Key Actions",
      "level": 3
    },
    {
      "id": "3-the-international-dimension--europe-as-a-global-player",
      "title": "3. The International Dimension – Europe as a Global Player",
      "level": 2
    },
    {
      "id": "key-actions-3",
      "title": "Key Actions",
      "level": 3
    },
    {
      "id": "4-conclusion",
      "title": "4. Conclusion",
      "level": 2
    }
  ],
  "contentMarkdown": "**Brussels, 19.2.2020**  \n**COM(2020) 67 final**\n\nCOMMUNICATION FROM THE COMMISSION TO THE EUROPEAN PARLIAMENT, THE COUNCIL, THE EUROPEAN ECONOMIC AND SOCIAL COMMITTEE AND THE COMMITTEE OF THE REGIONS\n\n---\n\n## 1. Introduction\n\nDigital technologies are profoundly changing our daily life, our way of working and doing business, and the way people travel, communicate and relate with each other. Digital communication, social media interaction, e-commerce, and digital enterprises are steadily transforming our world. They are generating an ever-increasing amount of data, which, if pooled and used, can lead to a completely new means and levels of value creation. It is a transformation as fundamental as that caused by the industrial revolution.\n\nIn her political guidelines, Commission President von der Leyen stressed the need for Europe to lead the transition to a healthy planet and a new digital world. This twin challenge of a green and digital transformation has to go hand-in-hand. It requires, as set out in the European Green Deal, an immediate change of direction towards more sustainable solutions which are resource-efficient, circular and climate-neutral. It requires that every citizen, every employee, every business person has a fair chance, wherever they live, to reap the benefits of our increasingly digitised society.\n\nDigital solutions such as communications systems, artificial intelligence or quantum technologies can enrich our lives in many ways. But the benefits arising from digital technologies do not come without risks and costs. Citizens no longer feel in control over what happens with their personal data and are increasingly overloaded by artificial solicitations of their attention. And malicious cyberactivity may threaten our personal well-being or disrupt our critical infrastructures and wider security interests.\n\nThis substantive societal transformation calls for a profound reflection at all levels of society as to how Europe can best meet, and continue to meet, these risks and challenges. It will require a huge effort, but Europe undoubtedly has the means to bring about this better digital future for everyone.\n\n---\n\n## 2. Our Vision and Goals\n\nThe Commission wants a European society powered by digital solutions that are strongly rooted in our common values, and that enrich the lives of all of us: people must have the opportunity to develop personally, to choose freely and safely, to engage in society, regardless of their age, gender or professional background. Businesses need a framework that allows them to start up, scale up, pool and use data, to innovate and compete or cooperate on fair terms. And Europe needs to have a choice and pursue the digital transformation in its own way.\n\nEuropean technological sovereignty starts from ensuring the integrity and resilience of our data infrastructure, networks and communications. It requires creating the right conditions for Europe to develop and deploy its own key capacities, thereby reducing our dependency on other parts of the globe for the most crucial technologies. Europe's ability to define its own rules and values in the digital age will be reinforced by such capacities. European technological sovereignty is not defined against anyone else, but by focusing on the needs of Europeans and of the European social model. The EU will remain open to anyone willing to play by European rules and meet European standards, regardless of where they are based.\n\nCitizens should be empowered to make better decisions based on insights gleaned from non-personal data. And that data should be available to all – whether public or private, big or small, start-up or giant. This will help society to get the most out of innovation and competition and ensure that everyone benefits from a digital dividend. This digital Europe should reflect the best of Europe - open, fair, diverse, democratic, and confident.\n\nFor the next five years, the Commission will focus on three key objectives to ensure that digital solutions help Europe to pursue its own way towards a digital transformation that works for the benefit of people through respecting our values. It will also put Europe in a position to be a trendsetter in the global debate.\n\n### Three Key Objectives\n\n- **Technology that works for people:** Development, deployment and uptake of technology that makes a real difference to people's daily lives. A strong and competitive economy that masters and shapes technology in a way that respects European values.\n\n- **A fair and competitive economy:** A frictionless single market, where companies of all sizes and in any sector can compete on equal terms, and can develop, market and use digital technologies, products and services at a scale that boosts their productivity and global competitiveness, and consumers can be confident that their rights are respected.\n\n- **An open, democratic and sustainable society:** A trustworthy environment in which citizens are empowered in how they act and interact, and of the data they provide both online and offline. A European way to digital transformation which enhances our democratic values, respects our fundamental rights, and contributes to a sustainable, climate-neutral and resource-efficient economy.\n\nFor Europe to truly influence the way in which digital solutions are developed and used on a global scale, it needs to be a strong, independent and purposeful digital player in its own right. In order to achieve this, a clear framework that promotes trustworthy, digitally enabled interactions across society, for people as well as for businesses, is needed. Without this focus on trustworthiness, the vital process of digital transformation cannot succeed.\n\nCreating a Europe fit for the digital age is a complex puzzle with many interconnected pieces; as with any puzzle, the whole picture cannot be seen without putting all the pieces together. The following sections will describe how the Commission intends to complete this puzzle and turn its vision into reality.\n\n---\n\n## A. Technology that Works for People\n\nEurope has a long and successful history of technology and creativity. Europe is strongest when it acts together and joins forces between the EU and its Member States; involving regions and municipalities, academia, civil society, financial institutions, businesses and social enterprises. Europe needs to pool its investments in research and innovation, to share experiences, and to cooperate across countries. Recent agreements to work together in areas such as supercomputing and micro-electronics have shown that collaboration can be highly effective. Similar initiatives on key areas of the next wave of innovative technologies will follow. Promoting the digital transformation of public administrations throughout Europe is also crucial in this regard.\n\nEurope must invest more in the strategic capacities that allow us to develop and use digital solutions at scale and to strive for interoperability in key digital infrastructures, such as extensive 5G (and future 6G) networks and deep tech. To take just one example: connectivity is the most fundamental building block of the digital transformation. It is what enables data to flow, people to collaborate wherever they are, and to connect more objects to the Internet, transforming manufacturing, mobility and logistic chains. Gigabit connectivity, powered with secure fibre and 5G infrastructures, is vital if we are to tap into Europe's digital growth potential. To this end, adequate investments at EU, national and regional levels are necessary to achieve the EU 2025 connectivity objectives.\n\nThe new EU Multiannual Financial Framework will contribute to these objectives. The aim is to achieve more and better strategic capacity where it matters – through targeted funding programmes, and making use of the InvestEU guarantee and of structural and rural development funds. This public funding has to be used to leverage private investment, because only together can we plug the investment gaps. The Capital Markets Union will facilitate the access of innovative and high-tech companies to market-based financing across the whole EU. We therefore need to ensure there is a broad array of private and public equity available to finance digital innovation.\n\nEurope needs to invest in connectivity, deep tech and human capital, as well as in smart energy and transport infrastructures. For digital infrastructure and networks alone, the EU has an investment gap of EUR 65 billion per year. Implementing reforms and stepping up investments in Research and Development and technological deployment could yield 14% of cumulative additional GDP growth by 2030. Acting quickly (for example by stepping up investments and adopting measures by 2022 rather than by 2025) would bring an additional 3.2% increase in GDP and positive job creation by 2030. This is a socio-economic boost that Europe cannot afford to miss.\n\nInvesting in innovation is only part of the issue, however. A true digital transformation has to start from European citizens and businesses trusting that their applications and products are secure. The more interconnected we are, the more we are vulnerable to malicious cyber activity. To tackle this growing threat, we need to work together at every stage: setting consistent rules for companies and stronger mechanisms for proactive information-sharing; ensuring operational cooperation between Member States, and between the EU and Member States; building synergies between civilian cyber resilience and the law enforcement and defence dimensions of cybersecurity; ensuring that law enforcement and judicial authorities can work effectively by developing new tools to use against cybercriminals; and last but by no means least, it means raising the awareness of EU citizens on cybersecurity.\n\nFeeling safe and secure is not just a question of cybersecurity. Citizens need to be able to trust the technology itself, as well as the way in which it is used. This is particularly important when it comes to the issue of artificial intelligence. In this respect, the European Commission is presenting a White Paper on creating ecosystems of excellence and trust in the field of AI, based on European values.\n\nImproving education and skills is a key part of the overall vision for digital transformation in Europe. European companies need digitally savvy employees to thrive in the global technology-driven marketplace. In turn, workers need digital competences to succeed in an increasingly digitalised and fast changing labour market. More women can and must have rewarding careers in tech, and European tech needs to benefit from women's skills and competences.\n\nThe need for digital skills goes well beyond the jobs market, however. As digital technologies permeate our professional and private lives, having at least basic digital literacy and skills has become a precondition for participating effectively in today's society.\n\nAs more processes are automated, digitisation will lead to changes beyond the tech sector. Numerous occupations will be entirely transformed. The digital transition must be fair and just and encourage women to fully take part. Social partners have a crucial role to play in this context. At the same time, promoting innovation and technological diffusion are a prerequisite for a good quality of life, employment opportunities and to close existing participation gaps, notably in rural and remote areas suffering from population ageing and decline.\n\nNew challenges are also emerging as regards working conditions. The growing number of online platforms has created new opportunities for people to earn income, enter or remain in the labour market. At the same time, it has raised new questions as regards legal protections for people who do not have a worker status yet who share some of the vulnerabilities of workers. The Commission will therefore propose an enhanced framework for platform workers.\n\n### Key Actions\n\n- White Paper on Artificial Intelligence setting out options for a legislative framework for trustworthy AI (adopted together with this Communication), with a follow-up on safety, liability, fundamental rights and data (Q4 2020).\n- Building and deploying cutting-edge joint digital capacities in the areas of AI, cyber, super- and quantum computing, quantum communication and blockchain. European Strategies on Quantum and blockchain (Q2 2020) as well as a revised EuroHPC Regulation on supercomputing.\n- Accelerating investments in Europe's Gigabit connectivity, through a revision of the Broadband Cost Reduction Directive, an updated Action Plan on 5G and 6G, a new Radio Spectrum Policy Programme (2021). 5G corridors for connected and automated mobility, including railway corridors, will be rolled out (2021-2030).\n- A European cybersecurity strategy, including the establishment of a joint Cybersecurity Unit, a Review of the Security of Network and Information Systems (NIS) Directive and giving a push to the single market for cybersecurity.\n- A Digital Education Action Plan to boost digital literacy and competences at all levels of education (Q2 2020).\n- A reinforced Skills Agenda to strengthen digital skills throughout society and a reinforced Youth Guarantee to put a strong focus on digital skills in early career transitions (Q2 2020).\n- Initiative to improve labour conditions of platform workers (2021).\n- A reinforced EU governments interoperability strategy to ensure coordination and common standards for secure and borderless public sector data flows and services (2021).\n\n---\n\n## B. A Fair and Competitive Economy\n\nIn an ever-shrinking world where technology is gaining in importance, Europe needs to continue to act and decide independently and reduce over-reliance on digital solutions created elsewhere.\n\nFor the development of many products and services, data needs to be widely and easily available, easily accessible, and simple to use and process. Data has become a key factor of production, and the value it creates has to be shared back with the entire society participating in providing the data. This is why we need to build a genuine European single market for data - a European data space based on European rules and values.\n\nMany European companies – and SMEs in particular – have been slow at taking up digital solutions, and therefore have not benefitted from them and missed opportunities to scale up. The Commission will seek to address this issue with a new EU Industrial Strategy that will set out actions to facilitate the transition towards a more digital, clean, circular and globally competitive EU industry. It will also include a strategy for SMEs, a vital part of the European economy, often hampered by lack of available skills, access to finance and markets.\n\nTo start up and grow in Europe, SMEs need a frictionless single market, unhampered by diverging local or national regulations that increase administrative burdens for smaller companies in particular. They need clear and proportionate rules that are effectively and uniformly enforced across the EU, providing them with an immensely powerful home market from which to launch themselves on the world stage.\n\nIn the digital age, ensuring a level playing field for businesses, big and small, is more important than ever. This suggests that rules applying offline – from competition and single market rules, consumer protection, to intellectual property, taxation and workers' rights – should also apply online. Consumers need to be able to trust digital products and service just as much as they would any other. There is a need to pay attention to the most vulnerable consumers and to ensure the enforcement of safety laws, also in relation to goods originating from third countries. Some platforms have acquired significant scale, which effectively allows them to act as private gatekeepers to markets, customers and information. We must ensure that the systemic role of certain online platforms and the market power they acquire will not put in danger the fairness and openness of our markets.\n\nWith specific respect to EU competition law, its foundations are as relevant for digital as for traditional industries. EU competition law serves Europe well by contributing to a level playing field where markets serve consumers. At the same time, it is important that the competition rules remain fit for a world that is changing fast, is increasingly digital and must become greener. With this in mind, the Commission is currently reflecting on the effectiveness of the way in which the current rules are applied, for example in relation to anti-trust remedies, and also conducting an evaluation and review of the rules themselves to ensure that they meet today's digital and green challenges.\n\nReviews are already underway of the rules governing horizontal and vertical agreements and of the market definition notice, as is a \"fitness\" check of various state aid guidelines. Among the key issues for Europe's digital future are data access, pooling and sharing, and the balance between online and offline commerce. The review of the market definition notice will also take account of new digital business models - such as \"free\" services that users access while providing their data – and their implications for competitive constraints.\n\nHowever, competition policy alone cannot address all the systemic problems that may arise in the platform economy. Based on the single market logic, additional rules may be needed to ensure contestability, fairness and innovation and the possibility of market entry, as well as public interests that go beyond competition or economic considerations.\n\nEnsuring fairness in the digital economy is a major challenge. In the borderless digital world, a handful of companies with the largest market share get the bulk of the profits on the value that is created in a data-based economy. Those profits are often not taxed where they are generated as a result of outdated corporate tax rules, distorting competition. This is why the Commission will look to address the tax challenges arising from the digitisation of the economy.\n\n### Key Actions\n\n- A European Data Strategy to make Europe a global leader in the data-agile economy (February 2020), announcing a legislative framework for data governance (Q4 2020) and a possible Data Act (2021).\n- Ongoing evaluation and review of the fitness of EU competition rules for the digital age (2020-2023), and launch of a sector inquiry (2020).\n- The Commission will further explore, in the context of the Digital Services Act package, ex ante rules to ensure that markets characterised by large platforms with significant network effects acting as gate-keepers, remain fair and contestable for innovators, businesses, and new market entrants (Q4 2020).\n- Propose an Industrial Strategy Package putting forward a range of actions to facilitate the transformation towards clean, circular, digital and globally competitive EU industries, including SMEs and the reinforcement of single market rules.\n- Create a framework to enable convenient, competitive and secure Digital Finance, including legislative proposals on crypto assets, and on digital operational and cyber resilience in the financial sector and a strategy towards an integrated EU payments market that supports pan-European digital payment services and solutions (Q3 2020).\n- Communication on Business Taxation for the 21st century, taking into account the progress made in the context of the Organisation for Economic Co-operation and Development (OECD) to address the tax challenges arising from the digitisation of the economy.\n- Delivering a new Consumer Agenda, which will empower consumers to make informed choices and play an active role in the digital transformation (Q4 2020).\n\n---\n\n## C. An Open, Democratic and Sustainable Society\n\nPeople are entitled to technology that they can trust. What is illegal offline must also be illegal online. While we cannot predict the future of digital technology, European values and ethical rules and social and environmental norms must apply also in the digital space.\n\nIn recent years, Europe has led the way towards an open, fair, inclusive and people-centric internet with its standard-setting General Data Protection Regulation and its rules for platform-to-business cooperation. In order to protect European democracies and the values underpinning them, the Commission will continue to develop and implement innovative and proportionate rules for a trustworthy digital society. Such a digital society should be fully inclusive, fair and accessible for all.\n\nIn this context, it is essential that the rules applicable to digital services across the EU are strengthened and modernised, clarifying the roles and responsibilities of online platforms. The sale of illicit, dangerous or counterfeit goods, and dissemination of illegal content must be tackled as effectively online as it is offline.\n\nTrust in the online world also means helping consumers take greater control of and responsibility for their own data and identity. Clearer rules on the transparency, behaviour and accountability of those who act as gatekeepers to information and data flows are needed, as is effective enforcement of existing rules. **People should also be able to control their online identity, when authentication is needed to access certain online services. A universally accepted public electronic identity (eID) is necessary for consumers to have access to their data and securely use the products and services they want without having to use unrelated platforms to do so and unnecessarily sharing personal data with them.** Europeans can also benefit from use of data to improve public as well as private decision-making.\n\nIn a world where much of the public debate and political advertising has moved online, we must also be prepared to act to forcefully defend our democracies. Citizens want meaningful answers to attempted manipulations of the information space, often in the form of targeted and coordinated disinformation campaigns. Europe needs greater transparency on the ways in which information is shared and managed on the internet. Trustworthy quality media is key for democracy as well as for cultural diversity.\n\nThe digital component will also be key in reaching the ambitions of the European Green Deal and the Sustainable Development Goals. As powerful enablers for the sustainability transition, digital solutions can advance the circular economy, support the decarbonisation of all sectors and reduce the environmental and social footprint of products placed on the EU market. For example, key sectors such as precision agriculture, transport and energy can benefit immensely from digital solutions in pursuing the ambitious sustainability objectives of the European Green Deal.\n\nDigital solutions, and data in particular, will also enable a fully integrated life-cycle approach, from design through sourcing of energy, raw materials and other inputs to final products until the end-of-life stage. For example, by tracking when and where electricity is most needed, we can increase energy efficiency and use fewer fossil fuels.\n\nYet it is also clear that the ICT sector also needs to undergo its own green transformation. The environmental footprint of the sector is significant, estimated at 5-9% of the world's total electricity use and more than 2% of all emissions. Data centres and telecommunications will need to become more energy efficient, reuse waste energy, and use more renewable energy sources. They can and should become climate neutral by 2030.\n\nHow ICT equipment is designed, bought, consumed and recycled also matters. Beyond the energy efficiency requirements of Ecodesign, ICT equipment must become fully circular - designed to last longer, to be properly maintained, to contain recycled material and to be easily dismantled and recycled.\n\nThe power of data is essential also in the health sector. Digitised health records, gathered in a European health data space, can lead to better treatment for major chronic conditions, including cancer and rare diseases, but also to equal access to high quality health services for all citizens.\n\n### Key Actions\n\n- New and revised rules to deepen the Internal Market for Digital Services, by increasing and harmonising the responsibilities of online platforms and information service providers and reinforce the oversight over platforms' content policies in the EU (Q4 2020, as part of the Digital Services Act package).\n- **Revision of eIDAS Regulation to improve its effectiveness, extend its benefits to the private sector and promote trusted digital identities for all Europeans (Q4 2020).**\n- Media and audiovisual Action Plan to support digital transformation and competitiveness of the audiovisual and media sector, to stimulate access to quality content and media pluralism (Q4 2020).\n- European Democracy Action Plan to improve the resilience of our democratic systems, support media pluralism and address the threats of external intervention in European elections (Q4 2020).\n- Destination Earth, initiative to develop a high precision digital model of Earth (a \"Digital Twin of the Earth\") that would improve Europe's environmental prediction and crisis management capabilities (from 2021).\n- A circular electronics initiative, mobilising existing and new instruments in line with the policy framework for sustainable products of the forthcoming circular economy action plan, to ensure that devices are designed for durability, maintenance, dismantling, reuse and recycling and including a right to repair or upgrade to extend the lifecycle of electronic devices and to avoid premature obsolescence (2021).\n- Initiatives to achieve climate-neutral, highly energy-efficient and sustainable data centres by no later than 2030 and transparency measures for telecoms operators on their environmental footprint.\n- The promotion of electronic health records based on a common European exchange format to give European citizens secure access to and exchange of health data across the EU. A European health data space to improve safe and secure accessibility of health data allowing for targeted and faster research, diagnosis and treatment (from 2022).\n\n---\n\n## 3. The International Dimension – Europe as a Global Player\n\nThe European model has proved to be an inspiration for many other partners around the world as they seek to address policy challenges, and this should be no different when it comes to digital.\n\nIn geopolitical terms, the EU should leverage its regulatory power, reinforced industrial and technological capabilities, diplomatic strengths and external financial instruments to advance the European approach and shape global interactions. This includes the work done under association and trade agreements, as well as agreements reached in international bodies such the United Nations, the OECD, ISO and the G20, with the support of EU Member States.\n\nA strong digital presence in the EU's enlargement, neighbourhood and development policy will enable growth and drive sustainable development, including the uptake of green ICT in partner countries and regions, in accordance with Europe's commitment to the 2030 Agenda for Sustainable Development. The conclusions of the EU-African Union Digital Economy Task Force will underpin the support for the digital transformation in Africa, including the creation of a single African Digital Market as funding becomes available under the EU's new Multiannual Financial Framework.\n\nMany countries around the world have aligned their own legislation with the EU's strong data protection regime. Mirroring this success, the EU should actively promote its model of a safe and open global Internet.\n\nIn terms of standards, our trading partners have joined the EU-led process that successfully set global standards for 5G and the Internet of Things. Europe must now lead in the adoption and standardisation process of the new generation of technology: blockchain, supercomputing, quantum technologies, algorithms and tools to allow data sharing and data usage.\n\nAs regards trade and investment, the Commission will continue to address unjustified restrictions for European companies in third countries, such as data localisation requirements, and pursue ambitious goals in terms of market access, respect of intellectual property, research and development and standardisation programmes. The ongoing discussions about building a trustworthy data alliance with like-minded partners who share our values and high standards could enhance data flows and the pool of available high-quality data.\n\nThe European Union is and will remain the most open region for trade and investment in the world, provided that anyone who comes to do business here accepts and respects our rules. The Commission will use all instruments at its disposal to ensure that everyone respects EU legislation and international rules to maintain a level playing field in the digital sector. It will also propose new rules where necessary, such as the ongoing work to develop a legal instrument to deal with the distortive effects of foreign subsidies in the internal market.\n\nA Global Digital Cooperation Strategy will put forward a European approach to the digital transformation that builds on our long and successful history of technology, innovation and ingenuity, vested in European values, including openness, and will project them onto the international stage and engage with our partners. It will also reflect the EU's work in Africa and elsewhere with respect to the Sustainable Development Goals, \"Digital4Development\" and capacity building.\n\nEurope is at the forefront in addressing manipulative interference in its information space and has developed important approaches and instruments. It will continue to work closely with its international partners, such as the G7, to find common approaches with a view to developing international norms and standards.\n\n### Key Actions\n\n- A Global Digital Cooperation Strategy (2021).\n- A White Paper on an instrument on foreign subsidies (Q2 2020).\n- A Digital for Development Hub that will build and consolidate a whole-of-EU approach promoting EU values and mobilising EU member states and EU industry, Civil Society Organisations (CSOs), financial institutions, expertise and technologies in digitisation.\n- A strategy for standardisation, which will allow for the deployment of interoperable technologies respecting Europe's rules, and promote Europe's approach and interests on the global stage (Q3 2020).\n- Mapping of opportunities and action plan to promote the European approach in bilateral relations and multilateral fora (Q2 2020).\n\n---\n\n## 4. Conclusion\n\nDigital technologies, as advanced as they may be, are just a tool. They cannot solve all of our problems. Yet they are making things possible which were unthinkable a generation ago. The success of Europe's digital strategy will be measured in how well we are able to put these tools to work in delivering public goods to European citizens.\n\nThe data-agile economy and its enormous transformative potential will affect all of us and Europe stands ready to make full use of the advantages it will bring. Yet for this digital transformation to be fully successful, we will need to create the right frameworks to ensure trustworthy technology and to give businesses the confidence, competences and means to digitalise. Coordination of efforts between the EU, Member States, regions, civil society and the private sector is key to achieving this and strengthening European digital leadership.\n\nEurope can own this digital transformation and set the global standards when it comes to technological development. More importantly still, it can do so while ensuring the inclusion and respect of every single human being. The digital transformation can only work if it works for all and not for only a few. It will be a truly European project – a digital society based on European values and European rules - that can truly inspire the rest of the world.\n",
  "contentHtml": "<p><strong>Brussels, 19.2.2020</strong><br>\n<strong>COM(2020) 67 final</strong></p>\n<p><span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">COMMUNICATION</span> FROM THE COMMISSION TO THE EUROPEAN PARLIAMENT, THE COUNCIL, THE EUROPEAN ECONOMIC AND SOCIAL COMMITTEE AND THE COMMITTEE OF THE REGIONS</p>\n<hr>\n<h2 id=\"1-introduction\">1. Introduction</h2>\n<p>Digital technologies are profoundly changing our daily life, our way of working and doing business, and the way people travel, communicate and relate with each other. Digital <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span>, social media interaction, e-commerce, and digital <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> are steadily transforming our world. They are generating an ever-increasing amount of data, which, if pooled and used, can lead to a completely new means and levels of value creation. It is a transformation as fundamental as that caused by the industrial revolution.</p>\n<p>In her political guidelines, Commission President von der Leyen stressed the need for Europe to lead the transition to a healthy planet and a new digital world. This twin challenge of a green and digital transformation has to go hand-in-hand. It requires, as set out in the European Green Deal, an immediate change of direction towards more sustainable solutions which are resource-efficient, circular and climate-neutral. It requires that every citizen, every employee, every business person has a fair chance, wherever they live, to reap the benefits of our increasingly digitised society.</p>\n<p>Digital solutions such as <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> systems, artificial intelligence or quantum technologies can enrich our lives in many ways. But the benefits arising from digital technologies do not come without <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> and costs. Citizens no longer feel in control over what happens with their <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and are increasingly overloaded by artificial solicitations of their attention. And malicious cyberactivity may threaten our personal well-being or disrupt our critical infrastructures and wider security interests.</p>\n<p>This substantive societal transformation calls for a profound reflection at all levels of society as to how Europe can best meet, and continue to meet, these <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risks</span> and challenges. It will require a huge effort, but Europe undoubtedly has the means to bring about this better digital future for everyone.</p>\n<hr>\n<h2 id=\"2-our-vision-and-goals\">2. Our Vision and Goals</h2>\n<p>The Commission wants a European society powered by digital solutions that are strongly rooted in our common values, and that enrich the lives of all of us: people must have the opportunity to develop personally, to choose freely and safely, to engage in society, regardless of their age, gender or professional background. Businesses need a framework that allows them to start up, scale up, pool and use data, to innovate and compete or cooperate on fair terms. And Europe needs to have a choice and pursue the digital transformation in its own way.</p>\n<p>European technological sovereignty starts from ensuring the integrity and resilience of our data infrastructure, networks and <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span>. It requires creating the right conditions for Europe to develop and deploy its own key capacities, thereby reducing our dependency on other parts of the globe for the most crucial technologies. Europe's ability to define its own rules and values in the digital age will be reinforced by such capacities. European technological sovereignty is not defined against anyone else, but by focusing on the needs of Europeans and of the European social model. The EU will remain open to anyone willing to play by European rules and meet <span class=\"term-link\" data-term-id=\"european-standard\" tabindex=\"0\">European standards</span>, regardless of where they are based.</p>\n<p>Citizens should be empowered to make better decisions based on insights gleaned from non-<span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span>. And that data should be available to all – whether <span class=\"term-link\" data-term-id=\"public-or-private\" tabindex=\"0\">public or private</span>, big or small, start-up or giant. This will help society to get the most out of innovation and competition and ensure that everyone benefits from a digital dividend. This digital Europe should reflect the best of Europe - open, fair, diverse, democratic, and confident.</p>\n<p>For the next five years, the Commission will focus on three key objectives to ensure that digital solutions help Europe to pursue its own way towards a digital transformation that works for the benefit of people through respecting our values. It will also put Europe in a position to be a trendsetter in the global debate.</p>\n<h3 id=\"three-key-objectives\">Three Key Objectives</h3>\n<ul>\n<li>\n<p><strong>Technology that works for people:</strong> Development, deployment and uptake of technology that makes a real difference to people's daily lives. A strong and competitive economy that masters and shapes technology in a way that respects European values.</p>\n</li>\n<li>\n<p><strong>A fair and competitive economy:</strong> A frictionless single market, where companies of all sizes and in any sector can compete on equal terms, and can develop, market and use digital technologies, <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> at a scale that boosts their productivity and global competitiveness, and consumers can be confident that their rights are respected.</p>\n</li>\n<li>\n<p><strong>An open, democratic and sustainable society:</strong> A trustworthy environment in which citizens are empowered in how they act and interact, and of the data they provide both online and offline. A European way to digital transformation which enhances our democratic values, respects our fundamental rights, and contributes to a sustainable, climate-neutral and resource-efficient economy.</p>\n</li>\n</ul>\n<p>For Europe to truly influence the way in which digital solutions are developed and used on a global scale, it needs to be a strong, independent and purposeful digital player in its own right. In order to achieve this, a clear framework that promotes trustworthy, digitally enabled interactions across society, for people as well as for businesses, is needed. Without this focus on trustworthiness, the vital process of digital transformation cannot succeed.</p>\n<p>Creating a Europe fit for the digital age is a complex puzzle with many interconnected pieces; as with any puzzle, the whole picture cannot be seen without putting all the pieces together. The following sections will describe how the Commission intends to complete this puzzle and turn its vision into reality.</p>\n<hr>\n<h2 id=\"a-technology-that-works-for-people\">A. Technology that Works for People</h2>\n<p>Europe has a long and successful history of technology and creativity. Europe is strongest when it acts together and joins forces between the EU and its <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span>; involving regions and municipalities, academia, civil society, financial institutions, businesses and social <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span>. Europe needs to pool its investments in research and innovation, to share experiences, and to cooperate across countries. Recent agreements to work together in areas such as supercomputing and micro-electronics have shown that collaboration can be highly effective. Similar initiatives on key areas of the next wave of innovative technologies will follow. Promoting the digital transformation of public administrations throughout Europe is also crucial in this regard.</p>\n<p>Europe must invest more in the strategic capacities that allow us to develop and use digital solutions at scale and to strive for interoperability in key digital infrastructures, such as extensive 5G (and future 6G) networks and deep tech. To take just one example: connectivity is the most fundamental building block of the digital transformation. It is what enables data to flow, people to collaborate wherever they are, and to connect more objects to the Internet, transforming manufacturing, mobility and logistic chains. Gigabit connectivity, powered with secure fibre and 5G infrastructures, is vital if we are to tap into Europe's digital growth potential. To this end, adequate investments at EU, national and regional levels are necessary to achieve the EU 2025 connectivity objectives.</p>\n<p>The new EU Multiannual Financial Framework will contribute to these objectives. The aim is to achieve more and better strategic capacity where it matters – through targeted funding programmes, and making use of the InvestEU guarantee and of structural and rural development funds. This public funding has to be used to leverage private investment, because only together can we plug the investment gaps. The Capital Markets Union will facilitate the access of innovative and high-tech companies to market-based financing across the whole EU. We therefore need to ensure there is a broad array of private and public equity available to finance digital innovation.</p>\n<p>Europe needs to invest in connectivity, deep tech and human capital, as well as in smart energy and transport infrastructures. For digital infrastructure and networks alone, the EU has an investment gap of EUR 65 billion per year. Implementing reforms and stepping up investments in Research and Development and technological deployment could yield 14% of cumulative additional GDP growth by 2030. Acting quickly (for example by stepping up investments and adopting measures by 2022 rather than by 2025) would bring an additional 3.2% increase in GDP and positive job creation by 2030. This is a socio-economic boost that Europe cannot afford to miss.</p>\n<p>Investing in innovation is only part of the issue, however. A true digital transformation has to start from European citizens and businesses trusting that their applications and <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> are secure. The more interconnected we are, the more we are vulnerable to malicious cyber activity. To tackle this growing threat, we need to work together at every stage: setting consistent rules for companies and stronger mechanisms for proactive information-sharing; ensuring operational cooperation between <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span>, and between the EU and <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span>; building synergies between civilian cyber resilience and the law enforcement and defence dimensions of <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span>; ensuring that law enforcement and judicial authorities can work effectively by developing new tools to use against cybercriminals; and last but by no means least, it means raising the awareness of EU citizens on <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span>.</p>\n<p>Feeling safe and secure is not just a question of <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span>. Citizens need to be able to trust the technology itself, as well as the way in which it is used. This is particularly important when it comes to the issue of artificial intelligence. In this respect, the European Commission is presenting a White Paper on creating ecosystems of excellence and trust in the field of AI, based on European values.</p>\n<p>Improving education and skills is a key part of the overall vision for digital transformation in Europe. European companies need digitally savvy employees to thrive in the global technology-driven marketplace. In turn, workers need digital competences to succeed in an increasingly digitalised and fast changing labour market. More women can and must have rewarding careers in tech, and European tech needs to benefit from women's skills and competences.</p>\n<p>The need for digital skills goes well beyond the jobs market, however. As digital technologies permeate our professional and private lives, having at least basic digital literacy and skills has become a precondition for participating effectively in today's society.</p>\n<p>As more processes are automated, digitisation will lead to changes beyond the tech sector. Numerous occupations will be entirely transformed. The digital transition must be fair and just and encourage women to fully take part. Social partners have a crucial role to play in this context. At the same time, promoting innovation and technological diffusion are a prerequisite for a good quality of life, employment opportunities and to close existing participation gaps, notably in rural and remote areas suffering from population ageing and decline.</p>\n<p>New challenges are also emerging as regards working conditions. The growing number of online platforms has created new opportunities for people to earn income, enter or remain in the labour market. At the same time, it has raised new questions as regards legal protections for people who do not have a worker status yet who share some of the <span class=\"term-link\" data-term-id=\"vulnerability\" tabindex=\"0\">vulnerabilities</span> of workers. The Commission will therefore propose an enhanced framework for platform workers.</p>\n<h3 id=\"key-actions\">Key Actions</h3>\n<ul>\n<li>White Paper on Artificial Intelligence setting out options for a legislative framework for trustworthy AI (adopted together with this <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">Communication</span>), with a follow-up on safety, liability, fundamental rights and data (Q4 2020).</li>\n<li>Building and deploying cutting-edge joint digital capacities in the areas of AI, cyber, super- and quantum computing, quantum <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> and blockchain. European Strategies on Quantum and blockchain (Q2 2020) as well as a revised EuroHPC Regulation on supercomputing.</li>\n<li>Accelerating investments in Europe's Gigabit connectivity, through a revision of the Broadband Cost Reduction Directive, an updated Action Plan on 5G and 6G, a new Radio Spectrum Policy Programme (2021). 5G corridors for connected and automated mobility, including railway corridors, will be rolled out (2021-2030).</li>\n<li>A European <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span> strategy, including the establishment of a joint <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">Cybersecurity</span> Unit, a Review of the <span class=\"term-link\" data-term-id=\"security-of-network-and-information-systems\" tabindex=\"0\">Security of Network and Information Systems</span> (NIS) Directive and giving a push to the single market for <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span>.</li>\n<li>A Digital Education Action Plan to boost digital literacy and competences at all levels of education (Q2 2020).</li>\n<li>A reinforced Skills Agenda to strengthen digital skills throughout society and a reinforced Youth Guarantee to put a strong focus on digital skills in early career transitions (Q2 2020).</li>\n<li>Initiative to improve labour conditions of platform workers (2021).</li>\n<li>A reinforced EU governments interoperability strategy to ensure coordination and common <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for secure and borderless public sector data flows and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> (2021).</li>\n</ul>\n<hr>\n<h2 id=\"b-a-fair-and-competitive-economy\">B. A Fair and Competitive Economy</h2>\n<p>In an ever-shrinking world where technology is gaining in importance, Europe needs to continue to act and decide independently and reduce over-reliance on digital solutions created elsewhere.</p>\n<p>For the development of many <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, data needs to be widely and easily available, easily accessible, and simple to use and process. Data has become a key factor of production, and the value it creates has to be shared back with the entire society participating in providing the data. This is why we need to build a genuine European single market for data - a European data space based on European rules and values.</p>\n<p>Many European companies – and SMEs in particular – have been slow at taking up digital solutions, and therefore have not benefitted from them and missed opportunities to scale up. The Commission will seek to address this issue with a new EU Industrial Strategy that will set out actions to facilitate the transition towards a more digital, clean, circular and globally competitive EU industry. It will also include a strategy for SMEs, a vital part of the European economy, often hampered by lack of available skills, access to finance and markets.</p>\n<p>To start up and grow in Europe, SMEs need a frictionless single market, unhampered by diverging local or national regulations that increase administrative burdens for smaller companies in particular. They need clear and proportionate rules that are effectively and uniformly enforced across the EU, providing them with an immensely powerful home market from which to launch themselves on the world stage.</p>\n<p>In the digital age, ensuring a level playing field for businesses, big and small, is more important than ever. This suggests that rules applying offline – from competition and single market rules, consumer protection, to intellectual property, taxation and workers' rights – should also apply online. Consumers need to be able to trust digital <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> just as much as they would any other. There is a need to pay attention to the most vulnerable consumers and to ensure the enforcement of safety laws, also in relation to goods originating from <span class=\"term-link\" data-term-id=\"third-country\" tabindex=\"0\">third countries</span>. Some platforms have acquired significant scale, which effectively allows them to act as private gatekeepers to markets, customers and information. We must ensure that the systemic role of certain online platforms and the market power they acquire will not put in danger the fairness and openness of our markets.</p>\n<p>With specific respect to EU competition law, its foundations are as relevant for digital as for traditional industries. EU competition law serves Europe well by contributing to a level playing field where markets serve consumers. At the same time, it is important that the competition rules remain fit for a world that is changing fast, is increasingly digital and must become greener. With this in mind, the Commission is currently reflecting on the effectiveness of the way in which the current rules are applied, for example in relation to anti-trust remedies, and also conducting an evaluation and review of the rules themselves to ensure that they meet today's digital and green challenges.</p>\n<p>Reviews are already underway of the rules governing horizontal and vertical agreements and of the market definition notice, as is a \"fitness\" check of various state aid guidelines. Among the key issues for Europe's digital future are data access, pooling and sharing, and the balance between online and offline commerce. The review of the market definition notice will also take account of new digital business models - such as \"free\" <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> that <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> access while providing their data – and their implications for competitive constraints.</p>\n<p>However, competition policy alone cannot address all the systemic problems that may arise in the platform economy. Based on the single market logic, additional rules may be needed to ensure contestability, fairness and innovation and the possibility of market entry, as well as public interests that go beyond competition or economic considerations.</p>\n<p>Ensuring fairness in the digital economy is a major challenge. In the borderless digital world, a handful of companies with the largest market share get the bulk of the profits on the value that is created in a data-based economy. Those profits are often not taxed where they are generated as a result of outdated corporate tax rules, distorting competition. This is why the Commission will look to address the tax challenges arising from the digitisation of the economy.</p>\n<h3 id=\"key-actions-1\">Key Actions</h3>\n<ul>\n<li>A European Data Strategy to make Europe a global leader in the data-agile economy (February 2020), announcing a legislative framework for data governance (Q4 2020) and a possible Data Act (2021).</li>\n<li>Ongoing evaluation and review of the fitness of EU competition rules for the digital age (2020-2023), and launch of a sector inquiry (2020).</li>\n<li>The Commission will further explore, in the context of the <span class=\"term-link\" data-term-id=\"digital-service\" tabindex=\"0\">Digital Services</span> Act package, <span class=\"term-link\" data-term-id=\"ex-ante\" tabindex=\"0\">ex ante</span> rules to ensure that markets characterised by large platforms with significant network effects acting as gate-keepers, remain fair and contestable for innovators, businesses, and new market entrants (Q4 2020).</li>\n<li>Propose an Industrial Strategy Package putting forward a range of actions to facilitate the transformation towards clean, circular, digital and globally competitive EU industries, including SMEs and the reinforcement of single market rules.</li>\n<li>Create a framework to enable convenient, competitive and secure Digital Finance, including legislative proposals on crypto assets, and on digital operational and cyber resilience in the financial sector and a strategy towards an integrated EU payments market that supports pan-European digital payment <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> and solutions (Q3 2020).</li>\n<li><span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">Communication</span> on Business Taxation for the 21st century, taking into account the progress made in the context of the Organisation for Economic Co-operation and Development (OECD) to address the tax challenges arising from the digitisation of the economy.</li>\n<li>Delivering a new Consumer Agenda, which will empower consumers to make informed choices and play an active role in the digital transformation (Q4 2020).</li>\n</ul>\n<hr>\n<h2 id=\"c-an-open-democratic-and-sustainable-society\">C. An Open, Democratic and Sustainable Society</h2>\n<p>People are entitled to technology that they can trust. What is illegal offline must also be illegal online. While we cannot predict the future of digital technology, European values and ethical rules and social and environmental norms must apply also in the digital space.</p>\n<p>In recent years, Europe has led the way towards an open, fair, inclusive and people-centric internet with its <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standard</span>-setting General Data Protection Regulation and its rules for platform-to-business cooperation. In order to protect European democracies and the values underpinning them, the Commission will continue to develop and implement innovative and proportionate rules for a trustworthy digital society. Such a digital society should be fully inclusive, fair and accessible for all.</p>\n<p>In this context, it is essential that the rules applicable to <span class=\"term-link\" data-term-id=\"digital-service\" tabindex=\"0\">digital services</span> across the EU are strengthened and modernised, clarifying the roles and responsibilities of online platforms. The sale of illicit, dangerous or counterfeit goods, and dissemination of illegal content must be tackled as effectively online as it is offline.</p>\n<p>Trust in the online world also means helping consumers take greater control of and responsibility for their own data and identity. Clearer rules on the transparency, behaviour and accountability of those who act as gatekeepers to information and data flows are needed, as is effective enforcement of existing rules. <strong>People should also be able to control their online identity, when <span class=\"term-link\" data-term-id=\"authentication\" tabindex=\"0\">authentication</span> is needed to access certain online <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. A universally accepted public electronic identity (eID) is necessary for consumers to have access to their data and securely use the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> they want without having to use unrelated platforms to do so and unnecessarily sharing <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> with them.</strong> Europeans can also benefit from use of data to improve public as well as private decision-making.</p>\n<p>In a world where much of the public debate and political advertising has moved online, we must also be prepared to act to forcefully defend our democracies. Citizens want meaningful answers to attempted manipulations of the information space, often in the form of targeted and coordinated disinformation campaigns. Europe needs greater transparency on the ways in which information is shared and managed on the internet. Trustworthy quality media is key for democracy as well as for cultural diversity.</p>\n<p>The digital component will also be key in reaching the ambitions of the European Green Deal and the Sustainable Development Goals. As powerful enablers for the sustainability transition, digital solutions can advance the circular economy, support the decarbonisation of all sectors and reduce the environmental and social footprint of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> placed on the EU market. For example, key sectors such as precision agriculture, transport and energy can benefit immensely from digital solutions in pursuing the ambitious sustainability objectives of the European Green Deal.</p>\n<p>Digital solutions, and data in particular, will also enable a fully integrated life-cycle approach, from design through sourcing of energy, raw materials and other inputs to final <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> until the end-of-life stage. For example, by tracking when and where electricity is most needed, we can increase energy efficiency and use fewer fossil fuels.</p>\n<p>Yet it is also clear that the ICT sector also needs to undergo its own green transformation. The environmental footprint of the sector is significant, estimated at 5-9% of the world's total electricity use and more than 2% of all emissions. Data centres and telecommunications will need to become more energy efficient, reuse waste energy, and use more renewable energy sources. They can and should become climate neutral by 2030.</p>\n<p>How ICT equipment is designed, bought, consumed and recycled also matters. Beyond the energy efficiency requirements of Ecodesign, ICT equipment must become fully circular - designed to last longer, to be properly maintained, to contain recycled material and to be easily dismantled and recycled.</p>\n<p>The power of data is essential also in the health sector. Digitised health records, gathered in a European health data space, can lead to better treatment for major chronic conditions, including cancer and rare diseases, but also to equal access to high quality health <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> for all citizens.</p>\n<h3 id=\"key-actions-2\">Key Actions</h3>\n<ul>\n<li>New and revised rules to deepen the Internal Market for <span class=\"term-link\" data-term-id=\"digital-service\" tabindex=\"0\">Digital Services</span>, by increasing and harmonising the responsibilities of online platforms and information <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">service</span> providers and reinforce the oversight over platforms' content policies in the EU (Q4 2020, as part of the <span class=\"term-link\" data-term-id=\"digital-service\" tabindex=\"0\">Digital Services</span> Act package).</li>\n<li><strong>Revision of eIDAS Regulation to improve its effectiveness, extend its benefits to the private sector and promote trusted digital identities for all Europeans (Q4 2020).</strong></li>\n<li>Media and audiovisual Action Plan to support digital transformation and competitiveness of the audiovisual and media sector, to stimulate access to quality content and media pluralism (Q4 2020).</li>\n<li>European Democracy Action Plan to improve the resilience of our democratic systems, support media pluralism and address the threats of external intervention in European elections (Q4 2020).</li>\n<li>Destination Earth, initiative to develop a high precision digital model of Earth (a \"Digital Twin of the Earth\") that would improve Europe's environmental prediction and crisis management capabilities (from 2021).</li>\n<li>A circular electronics initiative, mobilising existing and new instruments in line with the policy framework for sustainable <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> of the forthcoming circular economy action plan, to ensure that devices are designed for durability, maintenance, dismantling, reuse and recycling and including a right to repair or upgrade to extend the lifecycle of electronic devices and to avoid premature obsolescence (2021).</li>\n<li>Initiatives to achieve climate-neutral, highly energy-efficient and sustainable data centres by no later than 2030 and transparency measures for telecoms operators on their environmental footprint.</li>\n<li>The promotion of electronic health records based on a common European exchange format to give European citizens secure access to and exchange of health data across the EU. A European health data space to improve safe and secure accessibility of health data allowing for targeted and faster research, diagnosis and treatment (from 2022).</li>\n</ul>\n<hr>\n<h2 id=\"3-the-international-dimension--europe-as-a-global-player\">3. The International Dimension – Europe as a Global Player</h2>\n<p>The European model has proved to be an inspiration for many other partners around the world as they seek to address policy challenges, and this should be no different when it comes to digital.</p>\n<p>In geopolitical terms, the EU should leverage its regulatory power, reinforced industrial and technological capabilities, diplomatic strengths and external financial instruments to advance the European approach and shape global interactions. This includes the work done under association and trade agreements, as well as agreements reached in international bodies such the United Nations, the OECD, ISO and the G20, with the support of EU <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span>.</p>\n<p>A strong digital presence in the EU's enlargement, neighbourhood and development policy will enable growth and drive sustainable development, including the uptake of green ICT in partner countries and regions, in accordance with Europe's commitment to the 2030 Agenda for Sustainable Development. The conclusions of the EU-African Union Digital Economy Task Force will underpin the support for the digital transformation in Africa, including the creation of a single African Digital Market as funding becomes available under the EU's new Multiannual Financial Framework.</p>\n<p>Many countries around the world have aligned their own legislation with the EU's strong data protection regime. Mirroring this success, the EU should actively promote its model of a safe and open global Internet.</p>\n<p>In terms of <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, our trading partners have joined the EU-led process that successfully set global <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for 5G and the Internet of Things. Europe must now lead in the adoption and standardisation process of the new generation of technology: blockchain, supercomputing, quantum technologies, algorithms and tools to allow data sharing and data usage.</p>\n<p>As regards trade and investment, the Commission will continue to address unjustified restrictions for European companies in <span class=\"term-link\" data-term-id=\"third-country\" tabindex=\"0\">third countries</span>, such as data localisation requirements, and pursue ambitious goals in terms of market access, respect of intellectual property, research and development and standardisation programmes. The ongoing discussions about building a trustworthy data alliance with like-minded partners who share our values and high <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> could enhance data flows and the pool of available high-quality data.</p>\n<p>The European Union is and will remain the most open region for trade and investment in the world, provided that anyone who comes to do business here accepts and respects our rules. The Commission will use all instruments at its disposal to ensure that everyone respects EU legislation and international rules to maintain a level playing field in the digital sector. It will also propose new rules where necessary, such as the ongoing work to develop a legal instrument to deal with the distortive effects of foreign subsidies in the internal market.</p>\n<p>A Global Digital Cooperation Strategy will put forward a European approach to the digital transformation that builds on our long and successful history of technology, innovation and ingenuity, vested in European values, including openness, and will project them onto the international stage and engage with our partners. It will also reflect the EU's work in Africa and elsewhere with respect to the Sustainable Development Goals, \"Digital4Development\" and capacity building.</p>\n<p>Europe is at the forefront in addressing manipulative interference in its information space and has developed important approaches and instruments. It will continue to work closely with its international partners, such as the G7, to find common approaches with a view to developing international norms and <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>.</p>\n<h3 id=\"key-actions-3\">Key Actions</h3>\n<ul>\n<li>A Global Digital Cooperation Strategy (2021).</li>\n<li>A White Paper on an instrument on foreign subsidies (Q2 2020).</li>\n<li>A Digital for Development Hub that will build and consolidate a whole-of-EU approach promoting EU values and mobilising EU <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">member states</span> and EU industry, Civil Society Organisations (CSOs), financial institutions, expertise and technologies in digitisation.</li>\n<li>A strategy for standardisation, which will allow for the deployment of interoperable technologies respecting Europe's rules, and promote Europe's approach and interests on the global stage (Q3 2020).</li>\n<li>Mapping of opportunities and action plan to promote the European approach in bilateral relations and multilateral fora (Q2 2020).</li>\n</ul>\n<hr>\n<h2 id=\"4-conclusion\">4. Conclusion</h2>\n<p>Digital technologies, as advanced as they may be, are just a tool. They cannot solve all of our problems. Yet they are making things possible which were unthinkable a generation ago. The success of Europe's digital strategy will be measured in how well we are able to put these tools to work in delivering public goods to European citizens.</p>\n<p>The data-agile economy and its enormous transformative potential will affect all of us and Europe stands ready to make full use of the advantages it will bring. Yet for this digital transformation to be fully successful, we will need to create the right frameworks to ensure trustworthy technology and to give businesses the confidence, competences and means to digitalise. Coordination of efforts between the EU, <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span>, regions, civil society and the private sector is key to achieving this and strengthening European digital leadership.</p>\n<p>Europe can own this digital transformation and set the global <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> when it comes to technological development. More importantly still, it can do so while ensuring the inclusion and respect of every single human being. The digital transformation can only work if it works for all and not for only a few. It will be a truly European project – a digital society based on European values and European rules - that can truly inspire the rest of the world.</p>",
  "wordCount": 4950,
  "lastProcessed": "2026-01-24T17:18:14.543Z",
  "preambleInjected": false
}