{
  "slug": "2021-946",
  "type": "regulation",
  "legalType": "recommendation",
  "category": "referenced",
  "title": "Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework",
  "shortTitle": "EUDIW Toolbox Recommendation",
  "sidebarTitle": "EUDIW Toolbox",
  "description": "Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework",
  "celex": "32021H0946",
  "date": "3 June 2021",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32021H0946",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "1-objectives-and-definitions",
      "title": "1. OBJECTIVES AND DEFINITIONS",
      "level": 3
    },
    {
      "id": "2-process-for-developing-a-toolbox",
      "title": "2. PROCESS FOR DEVELOPING A TOOLBOX",
      "level": 3
    },
    {
      "id": "3-cooperation-at-union-level-to-develop-a-toolbox-to-support-the-implementation-of-the-european-digital-identity-framework",
      "title": "3. COOPERATION AT UNION LEVEL TO DEVELOP A TOOLBOX TO SUPPORT THE IMPLEMENTATION OF THE EUROPEAN DIGITAL IDENTITY FRAMEWORK",
      "level": 3
    },
    {
      "id": "4-review",
      "title": "4. REVIEW",
      "level": 3
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union, and in particular Article 292 thereof,*\n\n## Recitals\n\n- (1) In just one year, the COVID-19 pandemic has radically changed the role and relevance of digitalisation in our societies and economies, and accelerated its pace. In a response to the increased digitalisation of services, the demand by users and business for means to identify and authenticate online, as well as to digitally exchange information related to identity, attributes or qualifications, in a secure way and with a high level of data protection, has increased radically.\n\n- (2) The objective of Regulation (EU) No 910/2014 of the European Parliament and of the Council \\[Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC (OJ L 257, 28.8.2014, p. 73).\\] (the 'eIDAS Regulation') is to enable the cross-border recognition of government electronic identification ('eIDs') to access public services, and to establish a Union market for trust services recognised across borders with the same legal status as the traditional equivalent paper-based processes.\n\n- (3) In its conclusions of 1-2 October 2020, the European Council called on the Commission to make a proposal for the development of an EU-wide framework for secure public electronic identification, including interoperable digital signatures, to provide people with control over their online identity and data as well as to enable access to public, private and cross-border digital services.\n\n- (4) The Commission Communication '2030 Digital Compass: the European way for the Digital Decade' \\[COM(2021) 118 final.\\] sets the objective that, by 2030, the Union and its citizens should benefit from a wide deployment of a trusted, user-controlled identity, allowing each user to control their own online interactions and presence.\n\n- (5) The Commission adopted a proposal to amend the eIDAS Regulation \\[COM(2021) 281 final.\\]. It proposes a European Digital Identity framework to offer users self-determined personal digital wallets that would allow for a secure and easy access to different services, both public and private, under the users full control. In addition, it creates a new qualified trust service for attestation of attributes concerning information related to identity, such as addresses, age, gender, civil status, family composition, nationality, educational and professional qualifications and titles, licenses, other permits and payment data, that can be offered, shared and exchanged across borders, in full security, data protection and with legal effect across borders.\n\n- (6) Given the acceleration of digitisation, Member States have deployed or are developing national electronic identity systems including digital wallets and national trust frameworks for the integration of attributes and credentials. Other solutions are being prepared or in the process of being deployed by private sector operators.\n\n- (7) The development of divergent national solutions creates fragmentation and deprives people and businesses from the benefits of the Single Market, as they cannot use secure, convenient and uniform identification systems across the Union to access both public and private services.\n\n- (8) To support the competitiveness of European businesses, online service providers should be able to rely on digital identity solutions recognised across the Union, irrespective of the Member State in which they have been issued, thus benefiting from a harmonised European approach to trust, security and interoperability. Users and service providers alike should be able to benefit from the same legal value provided to electronic attestations of attributes valid across the Union.\n\n- (9) In order to avoid fragmentation and barriers due to diverging standards, and to ensure a coordinated process to impede endangering the implementation of the future European Digital Identity framework, there needs to be a process for close and structured cooperation between the Commission, the Member States and the private sector.\n\n- (10) To accelerate the path towards achieving this objective, Member States should increase their cooperation and identify a Toolbox for a European Digital Identity framework. The toolbox should lead to a technical architecture and reference framework, a set of common standards and technical references as well as best practices and guidelines as a basis for the implementation of the European Digital Identity framework. To ensure a harmonised approach for electronic identity in line with the expectations of citizens and businesses, including of persons with disabilities, cooperation should start immediately in parallel and in full respect of the legislative process and in alignment with its outcome.\n\n- (11) This Recommendation sets up a structured process of cooperation between Member States, the Commission and, where relevant, private sector operators to develop the Toolbox.\n\n- (12) The Toolbox should cover four cross-cutting dimensions, namely the provision and exchange of identity attributes, functionality and security of the European Digital Identity Wallets, reliance on the European Digital Identity Wallet including identity matching, and governance. The Toolbox should meet the requirements laid out in the proposal for a European Digital Identity framework. It should be updated as necessary following the outcome of the legislative process.\n\n- (13) Collaboration between Member States is necessary for the exchange of best practices and the development of guidelines in areas where harmonisation is not required, but an alignment of practices would support implementation of the European Digital Identity framework by Member State.\n\n- (14) The eIDAS expert group shall be tasked as main interlocutor for the purposes of implementing this Recommendation.\n\n- (15) Catalogues of attributes and schemes for the attestation of attributes have already been established in other areas, such as for the Once Only Technical System of the Single Digital Gateway Regulation or other data exchange initiatives at European level. Alignment and reuse of that work should be considered to ensure interoperability considering also the principles of the European Interoperability framework.\n\n- (16) Existing international and European standards and technical specifications should be re-used where appropriate and reference pilots and test implementations of the European Identity Digital Wallet framework and related components should be carried out to facilitate deployment, up-take and interoperability.\n\n**HAS ADOPTED THIS RECOMMENDATION:**\n\n## Enacting Terms\n\n### 1. **OBJECTIVES AND DEFINITIONS**\n\n- (1) It is recommended that Member States work towards the development of a Toolbox to support the implementation of the European Digital Identity framework in close coordination with the Commission and, where relevant, other concerned public and private sector parties. In particular, Member States are recommended to work closely together on the basis of a proposal by the Commission to identify the following elements as part of the Toolbox:\n\n- (a) a technical architecture and reference framework defining the functioning of the European Digital Identity framework in accordance with the eIDAS Regulation, taking into account the Commission’s proposal for a European Digital Identity framework;\n- (b) common standards and technical specifications further to point 3(2);\n- (c) common guidelines and best practices in areas where alignment of practices will support the smooth functioning of the European Digital Identity framework further to point 3(3) of this Recommendation.\n\n- (2) For the purposes of this Recommendation, the definitions set out in the Commission’s proposal for a European Digital Identity framework apply.\n\n### 2. **PROCESS FOR DEVELOPING A TOOLBOX**\n\n- (1) It is recommended that Member States implement this Recommendation through the eIDAS expert group. The general rules of procedure of that expert group apply.\n\n- (2) Standardisation bodies, relevant private and public sector stakeholders and external experts will be consulted and associated to the process as appropriate.\n\n- (3) The following schedule for the implementation of this Recommendation is foreseen:\n\n- (a) by September 2021: agreement on process and working procedures, launch of data collection exercise from Member States and discussion of technical architecture outline;\n- (b) by December 2021: agreement on technical architecture outline;\n- (c) by June 2022, identification of specific technical architecture, standards and references, guidelines and best practices for:\n   - (1) the provision and exchange of identity attributes;\n   - (2) functionality and security of the European Digital Identity Wallets;\n   - (3) reliance on the European Digital Identity Wallets including identity matching;\n   - (4) governance;\n- (d) by 30 September 2022: agreement between the Member States, in close cooperation with the Commission, on the Toolbox for the implementation of the European Digital Identity framework including a comprehensive technical architecture and reference framework, common standards and technical references and guidelines and best practices;\n- (e) by 30 October 2022: publication of the toolbox by the Commission.\n\n- (4) Notwithstanding point 4 'Review', it is recommended that the Member States and other concerned parties implement the toolbox following its publication, in the form of test implementations and reference pilots.\n\n### 3. **COOPERATION AT UNION LEVEL TO DEVELOP A TOOLBOX TO SUPPORT THE IMPLEMENTATION OF THE EUROPEAN DIGITAL IDENTITY FRAMEWORK**\n\n**Content of the Toolbox**\n\n- (1) In order to facilitate the implementation of the European Digital Identity framework, it is recommended that Member States cooperate to establish a toolbox including a comprehensive technical architecture and reference framework, a set of common standards and technical references and a set of guidelines and descriptions of best practices. The scope of the toolbox should cover at least all aspects of the functionality of the European Digital Identity Wallets and of the qualified trust service for attestation of attributes as proposed by the Commission’s proposal for a European Digital Identity framework. The content should evolve in parallel with and reflect the outcome of the discussion and process of adoption of the European Digital Identity Framework.\n\n**Common Standards and Technical References**\n\n- (2) It is recommended that Member States identify common standards and technical references in particular in the following areas: European Digital Identity Wallets user functionalities including signing by means of qualified electronic signatures, interfaces and protocols, level of assurance, notification of relying parties and verification of their authenticity, electronic attestation of attributes, mechanisms for verifying validity of electronic attestations of attributes and associated person identification data, certification, publication of a list of European Digital Identity Wallets, communication of security breaches, verification of identity and attributes by qualified trust providers of electronic attestations of attributes, identity matching, minimum list of attributes from authentic sources such as addresses, age, gender, civil status, family composition, nationality, educational and professional qualifications, titles and licenses, other permits and payment data, catalogue of attributes and schemes for the attestation of attributes and verification procedures for qualified electronic attestations of attributes, cooperation and governance.\n\n**Guidelines, best practices and cooperation**\n\n- (3) It is recommended that Member States identify guidelines and best practices in particular in the following areas: business models and fees structure, verification of attributes against authentic sources including via designated intermediaries.\n\n### 4. **REVIEW**\n\nIt is recommended that Member States cooperate to update the deliverables resulting from this Recommendation after the adoption of the legislative proposal for a European Digital Identity Framework to account for the final text of the legislation.\n\n---\n\nDone at Brussels, 3 June 2021.\n\n*For the Commission*\n\nThierry Breton\n\n*Member of the Commission*\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN COMMISSION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union, and in particular Article 292 thereof,</em></p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) In just one year, the COVID-19 pandemic has radically changed the role and relevance of digitalisation in our societies and economies, and accelerated its pace. In a response to the increased digitalisation of services, the demand by <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> and business for means to identify and authenticate online, as well as to digitally exchange information related to identity, <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> or qualifications, in a secure way and with a high level of data protection, has increased radically.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) The objective of Regulation (EU) No 910/2014 of the European Parliament and of the Council [Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on <span class=\"term-link\" data-term-id=\"electronic-identification\" tabindex=\"0\">electronic identification</span> and <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> for electronic transactions in the internal market and repealing Directive 1999/93/EC (OJ L 257, 28.8.2014, p. 73).] (the 'eIDAS Regulation') is to enable the cross-border recognition of government <span class=\"term-link\" data-term-id=\"electronic-identification\" tabindex=\"0\">electronic identification</span> ('eIDs') to access public services, and to establish a Union market for <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> recognised across borders with the same legal status as the traditional equivalent paper-based processes.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) In its conclusions of 1-2 October 2020, the European Council called on the Commission to make a proposal for the development of an EU-wide framework for secure public <span class=\"term-link\" data-term-id=\"electronic-identification\" tabindex=\"0\">electronic identification</span>, including interoperable <span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">digital signatures</span>, to provide people with control over their online identity and data as well as to enable access to public, private and cross-border digital services.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) The Commission Communication '2030 Digital Compass: the European way for the Digital Decade' [COM(2021) 118 final.] sets the objective that, by 2030, the Union and its citizens should benefit from a wide deployment of a trusted, <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-controlled identity, allowing each <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> to control their own online interactions and presence.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) The Commission adopted a proposal to amend the eIDAS Regulation [COM(2021) 281 final.]. It proposes a European Digital Identity framework to offer <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> self-determined personal digital wallets that would allow for a secure and easy access to different services, both public and private, under the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> full control. In addition, it creates a new <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span> for attestation of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> concerning information related to identity, such as addresses, age, gender, civil status, family composition, nationality, educational and professional qualifications and titles, licenses, other permits and payment data, that can be offered, shared and exchanged across borders, in full security, data protection and with legal effect across borders.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) Given the acceleration of digitisation, Member States have deployed or are developing national electronic identity systems including digital wallets and national trust frameworks for the integration of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> and credentials. Other solutions are being prepared or in the process of being deployed by private sector operators.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) The development of divergent national solutions creates fragmentation and deprives people and businesses from the benefits of the Single Market, as they cannot use secure, convenient and uniform identification systems across the Union to access both public and private services.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) To support the competitiveness of European businesses, online service providers should be able to rely on digital identity solutions recognised across the Union, irrespective of the Member State in which they have been issued, thus benefiting from a harmonised European approach to trust, security and interoperability. <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">Users</span> and service providers alike should be able to benefit from the same legal value provided to electronic attestations of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> valid across the Union.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) In order to avoid fragmentation and barriers due to diverging standards, and to ensure a coordinated process to impede endangering the implementation of the future European Digital Identity framework, there needs to be a process for close and structured cooperation between the Commission, the Member States and the private sector.</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) To accelerate the path towards achieving this objective, Member States should increase their cooperation and identify a Toolbox for a European Digital Identity framework. The toolbox should lead to a technical architecture and reference framework, a set of common standards and technical references as well as best practices and guidelines as a basis for the implementation of the European Digital Identity framework. To ensure a harmonised approach for electronic identity in line with the expectations of citizens and businesses, including of persons with disabilities, cooperation should start immediately in parallel and in full respect of the legislative process and in alignment with its outcome.</p>\n</li>\n<li id=\"recital-11\" data-recital=\"11\" class=\"linkable-recital\">\n<p>(11) This Recommendation sets up a structured process of cooperation between Member States, the Commission and, where relevant, private sector operators to develop the Toolbox.</p>\n</li>\n<li id=\"recital-12\" data-recital=\"12\" class=\"linkable-recital\">\n<p>(12) The Toolbox should cover four cross-cutting dimensions, namely the provision and exchange of identity <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span>, functionality and security of the <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallets</span>, reliance on the <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallet</span> including <span class=\"term-link\" data-term-id=\"identity-matching\" tabindex=\"0\">identity matching</span>, and governance. The Toolbox should meet the requirements laid out in the proposal for a European Digital Identity framework. It should be updated as necessary following the outcome of the legislative process.</p>\n</li>\n<li id=\"recital-13\" data-recital=\"13\" class=\"linkable-recital\">\n<p>(13) Collaboration between Member States is necessary for the exchange of best practices and the development of guidelines in areas where harmonisation is not required, but an alignment of practices would support implementation of the European Digital Identity framework by Member State.</p>\n</li>\n<li id=\"recital-14\" data-recital=\"14\" class=\"linkable-recital\">\n<p>(14) The eIDAS expert group shall be tasked as main interlocutor for the purposes of implementing this Recommendation.</p>\n</li>\n<li id=\"recital-15\" data-recital=\"15\" class=\"linkable-recital\">\n<p>(15) Catalogues of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> and schemes for the attestation of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> have already been established in other areas, such as for the Once Only Technical System of the Single Digital Gateway Regulation or other data exchange initiatives at European level. Alignment and reuse of that work should be considered to ensure interoperability considering also the principles of the European Interoperability framework.</p>\n</li>\n<li id=\"recital-16\" data-recital=\"16\" class=\"linkable-recital\">\n<p>(16) Existing international and European standards and <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> should be re-used where appropriate and reference pilots and test implementations of the European Identity Digital Wallet framework and related components should be carried out to facilitate deployment, up-take and interoperability.</p>\n</li>\n</ul>\n<p><strong>HAS ADOPTED THIS RECOMMENDATION:</strong></p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"1-objectives-and-definitions\">1. <strong>OBJECTIVES AND DEFINITIONS</strong></h3>\n<ul>\n<li>\n<p>(1) It is recommended that Member States work towards the development of a Toolbox to support the implementation of the European Digital Identity framework in close coordination with the Commission and, where relevant, other concerned public and private sector parties. In particular, Member States are recommended to work closely together on the basis of a proposal by the Commission to identify the following elements as part of the Toolbox:</p>\n</li>\n<li>\n<p>(a) a technical architecture and reference framework defining the functioning of the European Digital Identity framework in accordance with the eIDAS Regulation, taking into account the Commission’s proposal for a European Digital Identity framework;</p>\n</li>\n<li>\n<p>(b) common standards and <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> further to point 3(2);</p>\n</li>\n<li>\n<p>(c) common guidelines and best practices in areas where alignment of practices will support the smooth functioning of the European Digital Identity framework further to point 3(3) of this Recommendation.</p>\n</li>\n<li>\n<p>(2) For the purposes of this Recommendation, the definitions set out in the Commission’s proposal for a European Digital Identity framework apply.</p>\n</li>\n</ul>\n<h3 id=\"2-process-for-developing-a-toolbox\">2. <strong>PROCESS FOR DEVELOPING A TOOLBOX</strong></h3>\n<ul>\n<li>\n<p>(1) It is recommended that Member States implement this Recommendation through the eIDAS expert group. The general rules of procedure of that expert group apply.</p>\n</li>\n<li>\n<p>(2) Standardisation bodies, relevant private and public sector stakeholders and external experts will be consulted and associated to the process as appropriate.</p>\n</li>\n<li>\n<p>(3) The following schedule for the implementation of this Recommendation is foreseen:</p>\n</li>\n<li>\n<p>(a) by September 2021: agreement on process and working procedures, launch of data collection exercise from Member States and discussion of technical architecture outline;</p>\n</li>\n<li>\n<p>(b) by December 2021: agreement on technical architecture outline;</p>\n</li>\n<li>\n<p>(c) by June 2022, identification of specific technical architecture, standards and references, guidelines and best practices for:</p>\n<ul>\n<li>(1) the provision and exchange of identity <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span>;</li>\n<li>(2) functionality and security of the <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallets</span>;</li>\n<li>(3) reliance on the <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallets</span> including <span class=\"term-link\" data-term-id=\"identity-matching\" tabindex=\"0\">identity matching</span>;</li>\n<li>(4) governance;</li>\n</ul>\n</li>\n<li>\n<p>(d) by 30 September 2022: agreement between the Member States, in close cooperation with the Commission, on the Toolbox for the implementation of the European Digital Identity framework including a comprehensive technical architecture and reference framework, common standards and technical references and guidelines and best practices;</p>\n</li>\n<li>\n<p>(e) by 30 October 2022: publication of the toolbox by the Commission.</p>\n</li>\n<li>\n<p>(4) Notwithstanding point 4 'Review', it is recommended that the Member States and other concerned parties implement the toolbox following its publication, in the form of test implementations and reference pilots.</p>\n</li>\n</ul>\n<h3 id=\"3-cooperation-at-union-level-to-develop-a-toolbox-to-support-the-implementation-of-the-european-digital-identity-framework\">3. <strong>COOPERATION AT UNION LEVEL TO DEVELOP A TOOLBOX TO SUPPORT THE IMPLEMENTATION OF THE EUROPEAN DIGITAL IDENTITY FRAMEWORK</strong></h3>\n<p><strong>Content of the Toolbox</strong></p>\n<ul>\n<li>(1) In order to facilitate the implementation of the European Digital Identity framework, it is recommended that Member States cooperate to establish a toolbox including a comprehensive technical architecture and reference framework, a set of common standards and technical references and a set of guidelines and descriptions of best practices. The scope of the toolbox should cover at least all aspects of the functionality of the <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallets</span> and of the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span> for attestation of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> as proposed by the Commission’s proposal for a European Digital Identity framework. The content should evolve in parallel with and reflect the outcome of the discussion and process of adoption of the European Digital Identity Framework.</li>\n</ul>\n<p><strong>Common Standards and Technical References</strong></p>\n<ul>\n<li>(2) It is recommended that Member States identify common standards and technical references in particular in the following areas: <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallets</span> <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> functionalities including signing by means of <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span>, interfaces and protocols, level of assurance, notification of <span class=\"term-link\" data-term-id=\"relying-party\" tabindex=\"0\">relying parties</span> and verification of their authenticity, <span class=\"term-link\" data-term-id=\"electronic-attestation-of-attributes\" tabindex=\"0\">electronic attestation of attributes</span>, mechanisms for verifying validity of electronic attestations of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> and associated <span class=\"term-link\" data-term-id=\"person-identification-data\" tabindex=\"0\">person identification data</span>, certification, publication of a list of <span class=\"term-link\" data-term-id=\"european-digital-identity-wallet\" tabindex=\"0\">European Digital Identity Wallets</span>, communication of security breaches, verification of identity and <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> by qualified trust providers of electronic attestations of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span>, <span class=\"term-link\" data-term-id=\"identity-matching\" tabindex=\"0\">identity matching</span>, minimum list of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> from <span class=\"term-link\" data-term-id=\"authentic-source\" tabindex=\"0\">authentic sources</span> such as addresses, age, gender, civil status, family composition, nationality, educational and professional qualifications, titles and licenses, other permits and payment data, <span class=\"term-link\" data-term-id=\"catalogue-of-attributes\" tabindex=\"0\">catalogue of attributes</span> and schemes for the attestation of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> and verification procedures for qualified electronic attestations of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span>, cooperation and governance.</li>\n</ul>\n<p><strong>Guidelines, best practices and cooperation</strong></p>\n<ul>\n<li>(3) It is recommended that Member States identify guidelines and best practices in particular in the following areas: business models and fees structure, verification of <span class=\"term-link\" data-term-id=\"attribute\" tabindex=\"0\">attributes</span> against <span class=\"term-link\" data-term-id=\"authentic-source\" tabindex=\"0\">authentic sources</span> including via designated intermediaries.</li>\n</ul>\n<h3 id=\"4-review\">4. <strong>REVIEW</strong></h3>\n<p>It is recommended that Member States cooperate to update the deliverables resulting from this Recommendation after the adoption of the legislative proposal for a European Digital Identity Framework to account for the final text of the legislation.</p>\n<hr>\n<p>Done at Brussels, 3 June 2021.</p>\n<p><em>For the Commission</em></p>\n<p>Thierry Breton</p>\n<p><em>Member of the Commission</em></p>",
  "wordCount": 1821,
  "lastProcessed": "2026-01-21T11:57:19.349Z",
  "preambleInjected": false
}