{
  "slug": "2021-118",
  "type": "regulation",
  "legalType": "communication",
  "category": "supplementary",
  "title": "2030 Digital Compass: The European Way for the Digital Decade",
  "shortTitle": "2030 Digital Compass",
  "sidebarTitle": "2030 Digital Compass",
  "description": "2030 Digital Compass: The European Way for the Digital Decade",
  "celex": "52021DC0118",
  "date": "2021",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52021DC0118",
  "version": null,
  "toc": [
    {
      "id": "1-joining-forces-digital-transformation-for-europes-resilience",
      "title": "1. Joining forces: digital transformation for Europe's resilience",
      "level": 2
    },
    {
      "id": "2-the-european-way-vision-for-2030",
      "title": "2. The European way: vision for 2030",
      "level": 2
    },
    {
      "id": "3-four-cardinal-points-for-mapping-the-eus-trajectory",
      "title": "3. Four Cardinal Points for Mapping the EU's Trajectory",
      "level": 2
    },
    {
      "id": "31-a-digitally-skilled-population-and-highly-skilled-digital-professionals",
      "title": "3.1 A digitally skilled population and highly skilled digital professionals",
      "level": 3
    },
    {
      "id": "32-secure-and-sustainable-digital-infrastructures",
      "title": "3.2 Secure and sustainable digital infrastructures",
      "level": 3
    },
    {
      "id": "33-digital-transformation-of-businesses",
      "title": "3.3 Digital transformation of businesses",
      "level": 3
    },
    {
      "id": "34-digitalisation-of-public-services",
      "title": "3.4 Digitalisation of public services",
      "level": 3
    },
    {
      "id": "4-digital-citizenship",
      "title": "4. Digital Citizenship",
      "level": 2
    },
    {
      "id": "5-a-compass-to-reach-the-2030-targets-and-objectives",
      "title": "5. A Compass to Reach the 2030 Targets and Objectives",
      "level": 2
    },
    {
      "id": "51-governance",
      "title": "5.1 Governance",
      "level": 3
    },
    {
      "id": "52-multi-country-projects",
      "title": "5.2 Multi-Country Projects",
      "level": 3
    },
    {
      "id": "6-international-partnerships-for-the-digital-decade",
      "title": "6. International Partnerships for the Digital Decade",
      "level": 2
    },
    {
      "id": "7-conclusion-the-way-forward",
      "title": "7. Conclusion: the way forward",
      "level": 2
    },
    {
      "id": "annex",
      "title": "ANNEX",
      "level": 2
    },
    {
      "id": "proposal-of-common-targets-to-mobilise-public-and-private-actors",
      "title": "Proposal of Common Targets to Mobilise Public and Private Actors",
      "level": 3
    },
    {
      "id": "cardinal-point-1-a-digitally-skilled-population-and-highly-skilled-digital-professionals",
      "title": "Cardinal Point 1: A Digitally Skilled Population and Highly Skilled Digital Professionals",
      "level": 3
    },
    {
      "id": "cardinal-point-2-secure-resilient-performant-and-sustainable-digital-infrastructures",
      "title": "Cardinal Point 2: Secure, Resilient, Performant and Sustainable Digital Infrastructures",
      "level": 3
    },
    {
      "id": "cardinal-point-3-digital-transformation-of-businesses",
      "title": "Cardinal Point 3: Digital Transformation of Businesses",
      "level": 3
    },
    {
      "id": "cardinal-point-4-digitalisation-of-public-services",
      "title": "Cardinal Point 4: Digitalisation of Public Services",
      "level": 3
    },
    {
      "id": "notes-on-data-sources",
      "title": "Notes on Data Sources",
      "level": 3
    }
  ],
  "contentMarkdown": "**Brussels, 9.3.2021**  \n**COM(2021) 118 final**\n\nCOMMUNICATION FROM THE COMMISSION TO THE EUROPEAN PARLIAMENT, THE COUNCIL, THE EUROPEAN ECONOMIC AND SOCIAL COMMITTEE AND THE COMMITTEE OF THE REGIONS\n\n---\n\n## 1. Joining forces: digital transformation for Europe's resilience\n\nIn just a year, the COVID-19 pandemic has radically changed the role and perception of digitalisation in our societies and economies, and accelerated its pace. Digital technologies are now imperative for working, learning, entertaining, socialising, shopping and accessing everything from health services to culture. It has also shown the decisive role that disruptive innovation can play. The pandemic has also exposed the vulnerabilities of our digital space, its dependencies on non-European technologies, and the impact of disinformation on our democratic societies.\n\nIn the light of these challenges, our stated ambition is more relevant than ever: to pursue digital policies that empower people and businesses to seize a human centred, sustainable and more prosperous digital future.\n\nEurope will have to build on its strengths – an open and competitive single market, strong rules embedding European values, being an assertive player in fair and rule-based international trade, its solid industrial base, highly-skilled citizens and a robust civil society.\n\nAt the same time, it needs to carefully assess and address any strategic weaknesses, vulnerabilities and high-risk dependencies which put at risk the attainment of its ambitions and will need to accelerate associated investment.\n\nThat is the way for Europe to be digitally sovereign in an interconnected world by building and deploying technological capabilities in a way that empowers people and businesses to seize the potential of the digital transformation, and helps build a healthier and greener society.\n\nIn the State of the Union Address in September 2020, President von der Leyen announced that Europe should secure digital sovereignty with a common vision of the EU in 2030, based on clear goals and principles. The President put special emphasis on a European Cloud, leadership in ethical artificial intelligence, **a secure digital identity for all**, and vastly improved data, supercomputer and connectivity infrastructures. In response, the European Council invited the Commission to present a comprehensive Digital Compass by March 2021, setting out digital ambitions for 2030, establishing a monitoring system and outlining key milestones and the means of achieving these ambitions.\n\nThis political impetus calls for an intensification of the work begun in the past decade to accelerate Europe's digital transformation – building on progress towards a fully functioning Digital Single Market, and intensifying actions defined in the strategy for Shaping Europe's digital future. The strategy set out a programme of policy reform, which have started already with the Data Governance Act, the Digital Services Act, the Digital Markets Act and the Cybersecurity Strategy. A number of Union budget instruments will support the investments necessary for the digital transition, including the Cohesion programmes, the Technical Support Instrument, and the Digital Europe Programme. The agreement by the co-legislators that a minimum of 20% of the Recovery and Resilience Facility should support the digital transition and will help underpin this reform agenda, with funding to build Europe's Digital Decade on solid foundations.\n\n---\n\n## 2. The European way: vision for 2030\n\nBy 2030 we want a Europe that is by all measures, digitally sovereign in an open and interconnected world, pursuing digital policies that empower people and businesses to seize a human-centred, sustainable and more prosperous digital future.\n\nTransition to a sustainable economy requires smarter management of product-related data across the product lifecycle. Most of this information exists, but is not available to those that could use it best. Digital technologies provide the possibility to tag, trace, localise and share product related data along value chains, down to the level of the individual components and materials. Starting with batteries for electric vehicles and industrial applications, the European digital product passport (as part of the Sustainable Products Initiative) will improve information available to business, boost resource efficiency and empower consumers to make sustainable choices.\n\nResilient, secure and trustworthy infrastructures and technologies are indispensable to ensure the respect of European rules and values. A strong single market, fair competition and a functioning rules-based trade are critical assets for the EU's economic success and resilience.\n\nAt the same time, digital technologies are mostly developed outside the EU and the convergence across Member States on digitalisation remains limited, hampering economies of scale. The EU will be a stronger international partner thanks to reinforced internal strengths and capacities. A massive scale-up of investments, through all relevant EU funds and national spending, is necessary, including leveraging significant private investments, to allow the EU to develop critical technologies in a way that fosters its productivity growth and economic development in full coherence with its societal values and objectives.\n\n---\n\n## 3. Four Cardinal Points for Mapping the EU's Trajectory\n\nThe Commission proposes to set up a Digital Compass to translate the EU's digital ambitions for 2030 into concrete targets and to ensure that these objectives will be met. The Compass will be based on an enhanced monitoring system, to follow the EU's trajectory regarding the pace of a digital transformation, gaps in European strategic digital capacities as well as the implementation of digital principles. It will include the means to deliver the vision and set out key milestones along four cardinal points. The first two are focused on digital capacities in infrastructures and education & skills, and the two other are focused on digital transformation of business and public services.\n\n### 3.1 A digitally skilled population and highly skilled digital professionals\n\nIn the world of tomorrow, if we want to be the master of our own destiny, confident in our means, value and choices, we must rely on digitally empowered and capable citizens, a digitally skilled workforce and way more digital experts than today. This should be fostered by the development of a high-performing digital education ecosystem, as well as by an effective policy to promote links with and attract talent from all over the globe.\n\nDigital skills will be essential to reinforce our collective resilience as a society. Basic digital skills for all citizens and the opportunity to acquire new specialised digital skills for the workforce are a prerequisite to participate actively in the Digital Decade, as explained in the European Skills Agenda.\n\nThe European Pillar of Social Rights Action Plan projects the target for adults with at least basic digital skills to 80% in 2030. To allow all Europeans to fully benefit from the welfare brought by an inclusive digital society, and as proposed in the chapter on digital principles, access to education allowing the acquisition of basic digital skills should be a right for all EU citizens and lifelong learning should become a reality.\n\nBroad-based digital skills should also build a society which can trust digital products and online services, identify disinformation and fraud attempts, protect itself against cyberattacks, scams and fraud online, and in which children learn how to understand and navigate through the myriad of information they are exposed to online.\n\n**It is our proposed level of ambition that by 2030:**\n- At least 80% of all adults have basic digital skills\n- At least 20 million ICT specialists are employed in the EU, with convergence between women and men\n\n### 3.2 Secure and sustainable digital infrastructures\n\nSecure connectivity is the lifeblood of the digital transformation. As the decade progresses, households will increase the take up of such network technologies reflecting their rising needs for very high capacity connectivity. By the end of this decade, new digital communications features and capabilities such as high-precision, holographic media, and digital-senses over the networks, are expected to provide a whole new perspective to a digitally enabled society underpinning the need for gigabit connectivity.\n\n**It is our proposed level of ambition that by 2030:**\n- All European households will be covered by a Gigabit network, with all populated areas covered by 5G\n\nIf connectivity is a precondition for digital transformation, microprocessors are at the start of most of the key, strategic value chains such as connected cars, phones, Internet of Things, high performance computers, edge computers and Artificial Intelligence. While Europe designs and manufactures high-end chips, there are important gaps, notably in state-of-the-art fabrication technologies and in chip design, exposing Europe to a number of vulnerabilities.\n\n**It is our proposed level of ambition that by 2030:**\n- The production of cutting-edge and sustainable semiconductors in Europe including processors is at least 20% of world production in value\n\nAs highlighted in the European data strategy, the volume of data generated is greatly increasing and a growing proportion of data is expected to be processed at the edge, closer to the users and where data are generated. To address these trends towards increasing distribution and decentralization of data processing capacities, and to overcome the gap of suitable cloud supply meeting the needs of European businesses and public administration, Europe needs to strengthen its own cloud infrastructure and capacities.\n\n**It is our proposed level of ambition that by 2030:**\n- 10,000 climate neutral highly secure edge nodes are deployed in the EU\n- By 2025, Europe will have its first computer with quantum acceleration paving the way for Europe to be at the cutting edge of quantum capabilities by 2030\n\n### 3.3 Digital transformation of businesses\n\nDuring the COVID-19 pandemic embracing digital technologies has become essential for many businesses. By 2030, more than just enablers, digital technologies including 5G, the Internet of Things, edge computing, Artificial Intelligence, robotics and augmented reality will be at the core of new products, new manufacturing processes and new business models based on fair sharing of data in the data economy.\n\nThe transformation of businesses will depend on their ability to adopt new digital technologies rapidly and across the board, including in industrial and services ecosystems that are lagging behind.\n\nSMEs have a central role in this transition, not only because they represent the bulk of the EU companies, but also because they are a critical source of innovation. With the support of over 200 Digital Innovation Hubs and industrial clusters, by 2030, SMEs should have the opportunity to access digital technologies or data easily and on fair terms.\n\n**It is our proposed level of ambition that by 2030:**\n- 75% of European enterprises have taken up cloud computing services, big data and Artificial Intelligence\n- More than 90% of European SMEs reach at least a basic level of digital intensity\n- Europe will grow the pipeline of its innovative scale ups and improve their access to finance, leading to doubling the number of unicorns in Europe\n\n### 3.4 Digitalisation of public services\n\nBy 2030, the EU's objective is to ensure that democratic life and public services online will be fully accessible for everyone, including persons with disabilities, and benefit from a best-in-class digital environment providing for easy-to-use, efficient and personalised services and tools with high security and privacy standards.\n\nGovernment as a Platform, as a new way of building digital public services, will provide a holistic and easy access to public services with a seamless interplay of advanced capabilities, such as data processing, AI and virtual reality. It will also contribute to stimulating productivity gains by European business, thanks to more efficient services that are digital by default.\n\n**European digital identity: the Government in the palm of your hand**\n\nBy 2030, the EU framework should have led to wide deployment of a trusted, user-controlled identity, allowing each citizen to control their own online interactions and presence. **Users can make a full use of online services easily and throughout the EU while preserving their privacy.**\n\n**It is our proposed level of ambition that by 2030:**\n- **100% online provision of key public services available for European citizens and businesses**\n- **100% of European citizens have access to medical records (e-records)**\n- **80% of citizens will use a digital ID solution**\n\n---\n\n## 4. Digital Citizenship\n\nDeploying digital infrastructures, skills and capacities and digitising businesses and public services alone is not sufficient to define the EU's approach to its digital future; it is also necessary to enable all Europeans to make full use of digital opportunities and technologies. In the digital space, we need to make sure that the same rights that apply offline can be fully exercised online.\n\nTo be fully empowered, people should first have access to affordable, secure and high quality connectivity, be able to learn basic digital skills – which should become a right for all – and be equipped with other means which together allow them to fully participate in economic and societal activities of today and the future. **They also need to have easy access to digital public services, on the basis of a universal digital identity**, as well as access to digital health services. People should benefit from non-discriminatory access to online services and as well from the realisation of principles, such as secure and trusted digital spaces, work-life balance in a remote working environment, protection of minors, and ethical algorithmic decision-making.\n\nThis European way for the digital society should also underpin and support open democracy initiatives by contributing to inclusive policy-making, enabling wide-ranging engagement with people and stimulating grass-roots action for developing local initiatives.\n\nThis European way for the digital society is also based on ensuring full respect of EU fundamental rights:\n- Freedom of expression, including access to diverse, trustworthy and transparent information\n- Freedom to set up and conduct a business online\n- Protection of personal data and privacy, and right to be forgotten\n- Protection of the intellectual creation of individuals in the online space\n\nIt is equally important to set up a comprehensive set of digital principles:\n- Universal Access to internet services\n- A secure and trusted online environment\n- Universal digital education and skills for people to take an active part in society and in democratic processes\n- Access to digital systems and devices that respect the environment\n- Accessible and human-centric digital public services and administration\n- Ethical principles for human centric algorithms\n- Protecting and empowering children in the online space\n- Access to digital health services\n\n---\n\n## 5. A Compass to Reach the 2030 Targets and Objectives\n\nTo deliver the renewed EU ambition for digitalisation a robust framework is necessary. It should encompass our vision based on the four cardinal points, digital principles and addressing critical capacity gaps.\n\n### 5.1 Governance\n\nOperationally, the Commission intends to propose a Digital Compass in the form of a digital policy programme to be adopted by co-decision of European Parliament and Council, setting the focus on delivery and constant commitment towards the common digital goals. The programme would feature the following aspects:\n\n- A set of concrete objectives for each of the four cardinal points\n- A monitoring system measuring the progress of the EU against the key targets for 2030 and digital principles\n- On the basis of the analysis, the Commission will publish annually the European State of the Digital Decade Report\n\nThe Report will trigger a collaborative analysis between the Commission and Member States to identify solutions addressing weaknesses and to propose targeted actions for effective remedies.\n\n### 5.2 Multi-Country Projects\n\nTo deliver the European vision for the Digital Decade, digital capacities are needed in the four areas of the Digital Compass, which can only be delivered if Member States and the EU pool resources. For the large technological projects that are necessary for Europe's digital transition, a European approach to building digital capacities is indispensable.\n\nMulti-country digital projects discussed so far with the Member States under the RRF:\n- Building a common and multi-purpose pan-European interconnected data processing infrastructure\n- Endowing the EU with capabilities in electronics design and deployment of the next generation of low power trusted processors\n- Pan-European deployment of 5G corridors for advanced digital rail operations and Connected and Automated Mobility\n- Acquiring supercomputers and quantum computers, connected with the EuroHPC network\n- Developing and deploying an ultra-secure quantum communication infrastructure spanning the whole EU\n- Deploying a network of Security Operations Centres, powered by artificial intelligence\n- **Connected Public Administration: build in complementarity and synergy with the eIDAS framework and offer on a voluntary basis European Digital Identity**\n- European Blockchain Services Infrastructure\n- European Digital Innovation Hubs\n- High tech partnerships for digital skills through Pact for Skills\n\n---\n\n## 6. International Partnerships for the Digital Decade\n\nThe degree of digitalisation of an economy or society has been shown not only to be a critical underpinning of economic and societal resilience, but also a factor in global influence. As the pandemic has highlighted the extent to which digital policy is never value-neutral, with competing models on offer the EU now has an opportunity to promote its positive and human-centric vision of the digital economy and society.\n\nFor Europe's Digital Decade to be successful, we will build strong international digital partnerships matching the four pillars of our Compass: skills, infrastructures, transformation of business and of public services. These will strengthen the EU's capacity to assert its own interests and deliver global solutions while fighting against unfair and abusive practices and ensuring the security and resilience of EU digital supply chains.\n\nThe EU's starting point is an open digital economy based on the flow of investment and innovation as an engine for prosperity. At the same time, the EU will strongly promote our core interests and values, through three overarching principles:\n- A level playing field in digital markets\n- A secure cyberspace\n- Upholding fundamental rights online\n\nThe EU's international digital partnerships will promote alignment or convergence with EU regulatory norms and standards on issues such as data protection, privacy and data flows, the ethical use of AI, cybersecurity and trust, tackling disinformation and illegal content online, ensuring internet governance, and supporting development of digital finance and e-government.\n\nBuilding on a renewed transatlantic relationship as a strong pillar of our digital international engagement, the EU should lead the way towards a wider coalition of like-minded partners, open to and developed together with all those who share its vision of a human-centric digital transformation.\n\n---\n\n## 7. Conclusion: the way forward\n\nThe Digital Compass Communication maps out a clear path towards a common vision and actions for Europe to succeed in the Digital Decade, at home and in the world.\n\nThe involvement and commitment of the public and of all stakeholders is crucial to achieve a successful digital transformation. In this context, the Commission, shortly after this Communication, will start a wide consultation process on the digital principles. It will engage with the Member States, the European Parliament, regional and economic and social partners, businesses and citizens, on specific elements of the Communication during 2021, including the compass framework with specific targets and governance.\n\nThe Commission will propose the Digital Policy Programme to the co-legislators by the third quarter of 2021, and hopes to achieve decisive progress with the other institutions on a Declaration of Digital Principles by the end of 2021.\n\n---\n\n## ANNEX\n\n### Proposal of Common Targets to Mobilise Public and Private Actors\n\nWhen selecting targets, the Commission looked at existing Key Performance Indicators (KPIs), having in mind that targets need to be measurable in order to be monitored. The choice of lead KPIs was made based partly on existing KPIs which are monitored in the Digital Economy and Society Index (DESI) monitoring system set up by the Commission since 2014.\n\n---\n\n### Cardinal Point 1: A Digitally Skilled Population and Highly Skilled Digital Professionals\n\n**EU Objective for 2030:** *\"A tech savvy continent where all are digitally empowered\"*\n\n| Dimension | 2030 EU Target | 2020 Baseline | Source |\n|-----------|----------------|---------------|--------|\n| **Basic digital skills** | 80% of adults aged 16-74 | 58.3% | DESI |\n| **ICT specialists** | 20 million employed, with gender convergence | 7.8 million (18% women) | DESI, Eurostat |\n\n---\n\n### Cardinal Point 2: Secure, Resilient, Performant and Sustainable Digital Infrastructures\n\n**EU Objective for 2030:** *\"Top-notch trustworthy and secure Digital Infrastructures\"*\n\n| Dimension | 2030 EU Target | 2020 Baseline | Source |\n|-----------|----------------|---------------|--------|\n| **Connectivity — Gigabit** | All households covered by Gigabit network | 59% VHCN coverage | DESI |\n| **Connectivity — 5G** | All populated areas covered by 5G | 14% (2021) | Broadband Study |\n| **Semiconductors** | 20% of world production in value (below 5nm) | 10% | TBC in policy programme |\n| **Edge computing** | 10,000 climate-neutral secure edge nodes | 0 (technology emerging) | CEF2 annual study |\n| **Quantum computing** | First quantum-accelerated computer by 2025 | 0 | TBC |\n\n*Note: Edge node target based on vision of 80% data processing at the edge by 2025. A mesh with a node every 100km requires 8-10,000 edge nodes to achieve few-millisecond latency.*\n\n---\n\n### Cardinal Point 3: Digital Transformation of Businesses\n\n**EU Objective for 2030:** *\"The continent with a high share of digitalised businesses\"*\n\n| Dimension | 2030 EU Target | 2020 Baseline | Source |\n|-----------|----------------|---------------|--------|\n| **Cloud computing** | 75% of enterprises using cloud | 26% | Eurostat |\n| **Big data** | 75% of enterprises using big data | 14% | Eurostat |\n| **Artificial Intelligence** | 75% of enterprises using AI | 25% | IPSOS |\n| **SME digital intensity** | 90% of SMEs at basic level (DII ≥ 4) | 60.6% (2019) | DII, Eurostat |\n| **Unicorns** | Double the number | 122 (2021) | Dealroom |\n\n*Note: Digital Intensity Index (DII) measures 12 digital technologies at firm level, including: internet access, ICT specialists, fast broadband (30+ Mbps), mobile devices, website, social media, cloud, eInvoices, eCommerce.*\n\n---\n\n### Cardinal Point 4: Digitalisation of Public Services\n\n**EU Objective for 2030:** *\"Modernised public services responding to society's needs\"*\n\n| Dimension | 2030 EU Target | 2020 Baseline | Source |\n|-----------|----------------|---------------|--------|\n| **Key public services online** | 100% online provision | 75/100 (citizens), 84/100 (businesses) | eGov Benchmark |\n| **Electronic health records** | 100% of citizens have access | N/A | TBC |\n| **Digital ID adoption** | **80% of citizens using digital ID** | N/A (no baseline) | TBC |\n\n---\n\n### Notes on Data Sources\n\n**DESI (Digital Economy and Society Index):** Composite index summarising indicators on Europe's digital performance across five dimensions: Connectivity, Human Capital, Use of Internet, Integration of Digital Technology, and Digital Public Services. Published annually since 2014.\n\n**DII (Digital Intensity Index):** Micro-based index measuring 12 digital technologies at firm level. Firms scoring 4 or more are considered to have \"basic level\" of digital intensity.\n\n**eGovernment Benchmark:** Measures online availability and usability of public services provided to citizens and businesses.\n",
  "contentHtml": "<p><strong>Brussels, 9.3.2021</strong><br>\n<strong>COM(2021) 118 final</strong></p>\n<p><span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">COMMUNICATION</span> FROM THE COMMISSION TO THE EUROPEAN PARLIAMENT, THE COUNCIL, THE EUROPEAN ECONOMIC AND SOCIAL COMMITTEE AND THE COMMITTEE OF THE REGIONS</p>\n<hr>\n<h2 id=\"1-joining-forces-digital-transformation-for-europes-resilience\">1. Joining forces: digital transformation for Europe's resilience</h2>\n<p>In just a year, the COVID-19 pandemic has radically changed the role and perception of digitalisation in our societies and economies, and accelerated its pace. Digital technologies are now imperative for working, learning, entertaining, socialising, shopping and accessing everything from health <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> to culture. It has also shown the decisive role that disruptive innovation can play. The pandemic has also exposed the <span class=\"term-link\" data-term-id=\"vulnerability\" tabindex=\"0\">vulnerabilities</span> of our digital space, its dependencies on non-European technologies, and the impact of disinformation on our democratic societies.</p>\n<p>In the light of these challenges, our stated ambition is more relevant than ever: to pursue digital policies that empower people and businesses to seize a human centred, sustainable and more prosperous digital future.</p>\n<p>Europe will have to build on its strengths – an open and competitive single market, strong rules embedding European values, being an assertive player in fair and rule-based international trade, its solid industrial base, highly-skilled citizens and a robust civil society.</p>\n<p>At the same time, it needs to carefully assess and address any strategic weaknesses, <span class=\"term-link\" data-term-id=\"vulnerability\" tabindex=\"0\">vulnerabilities</span> and high-<span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> dependencies which put at <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> the attainment of its ambitions and will need to accelerate associated investment.</p>\n<p>That is the way for Europe to be digitally sovereign in an interconnected world by building and deploying technological capabilities in a way that empowers people and businesses to seize the potential of the digital transformation, and helps build a healthier and greener society.</p>\n<p>In the State of the Union Address in September 2020, President von der Leyen announced that Europe should secure digital sovereignty with a common vision of the EU in 2030, based on clear goals and principles. The President put special emphasis on a European Cloud, leadership in ethical artificial intelligence, <strong>a secure digital identity for all</strong>, and vastly improved data, supercomputer and connectivity infrastructures. In response, the European Council invited the Commission to present a comprehensive Digital Compass by March 2021, setting out digital ambitions for 2030, establishing a monitoring system and outlining key milestones and the means of achieving these ambitions.</p>\n<p>This political impetus calls for an intensification of the work begun in the past decade to accelerate Europe's digital transformation – building on progress towards a fully functioning Digital Single Market, and intensifying actions defined in the strategy for Shaping Europe's digital future. The strategy set out a programme of policy reform, which have started already with the Data Governance Act, the <span class=\"term-link\" data-term-id=\"digital-service\" tabindex=\"0\">Digital Services</span> Act, the Digital Markets Act and the <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">Cybersecurity</span> Strategy. A number of Union budget instruments will support the investments necessary for the digital transition, including the Cohesion programmes, the Technical Support Instrument, and the Digital Europe Programme. The agreement by the co-legislators that a minimum of 20% of the Recovery and Resilience Facility should support the digital transition and will help underpin this reform agenda, with funding to build Europe's Digital Decade on solid foundations.</p>\n<hr>\n<h2 id=\"2-the-european-way-vision-for-2030\">2. The European way: vision for 2030</h2>\n<p>By 2030 we want a Europe that is by all measures, digitally sovereign in an open and interconnected world, pursuing digital policies that empower people and businesses to seize a human-centred, sustainable and more prosperous digital future.</p>\n<p>Transition to a sustainable economy requires smarter management of <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span>-related data across the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> lifecycle. Most of this information exists, but is not available to those that could use it best. Digital technologies provide the possibility to tag, trace, localise and share <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> related data along value chains, down to the level of the individual components and materials. Starting with batteries for electric vehicles and industrial applications, the European digital <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">product</span> passport (as part of the Sustainable <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">Products</span> Initiative) will improve information available to business, boost resource efficiency and empower consumers to make sustainable choices.</p>\n<p>Resilient, secure and trustworthy infrastructures and technologies are indispensable to ensure the respect of European rules and values. A strong single market, fair competition and a functioning rules-based trade are <span class=\"term-link\" data-term-id=\"critical-assets\" tabindex=\"0\">critical assets</span> for the EU's economic success and resilience.</p>\n<p>At the same time, digital technologies are mostly developed outside the EU and the convergence across <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span> on digitalisation remains limited, hampering economies of scale. The EU will be a stronger international partner thanks to reinforced internal strengths and capacities. A massive scale-up of investments, through all relevant EU funds and national spending, is necessary, including leveraging significant private investments, to allow the EU to develop critical technologies in a way that fosters its productivity growth and economic development in full coherence with its societal values and objectives.</p>\n<hr>\n<h2 id=\"3-four-cardinal-points-for-mapping-the-eus-trajectory\">3. Four Cardinal Points for Mapping the EU's Trajectory</h2>\n<p>The Commission proposes to set up a Digital Compass to translate the EU's digital ambitions for 2030 into concrete targets and to ensure that these objectives will be met. The Compass will be based on an enhanced monitoring system, to follow the EU's trajectory regarding the pace of a digital transformation, gaps in European strategic digital capacities as well as the implementation of digital principles. It will include the means to deliver the vision and set out key milestones along four cardinal points. The first two are focused on digital capacities in infrastructures and education &#x26; skills, and the two other are focused on digital transformation of business and public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>.</p>\n<h3 id=\"31-a-digitally-skilled-population-and-highly-skilled-digital-professionals\">3.1 A digitally skilled population and highly skilled digital professionals</h3>\n<p>In the world of tomorrow, if we want to be the master of our own destiny, confident in our means, value and choices, we must rely on digitally empowered and capable citizens, a digitally skilled workforce and way more digital experts than today. This should be fostered by the development of a high-performing digital education ecosystem, as well as by an effective policy to promote links with and attract talent from all over the globe.</p>\n<p>Digital skills will be essential to reinforce our collective resilience as a society. <span class=\"term-link\" data-term-id=\"basic-digital-skill\" tabindex=\"0\">Basic digital skills</span> for all citizens and the opportunity to acquire new specialised digital skills for the workforce are a prerequisite to participate actively in the Digital Decade, as explained in the European Skills Agenda.</p>\n<p>The European Pillar of Social Rights Action Plan projects the target for adults with at least <span class=\"term-link\" data-term-id=\"basic-digital-skill\" tabindex=\"0\">basic digital skills</span> to 80% in 2030. To allow all Europeans to fully benefit from the welfare brought by an inclusive digital society, and as proposed in the chapter on digital principles, access to education allowing the acquisition of <span class=\"term-link\" data-term-id=\"basic-digital-skill\" tabindex=\"0\">basic digital skills</span> should be a right for all EU citizens and lifelong learning should become a reality.</p>\n<p>Broad-based digital skills should also build a society which can trust digital <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> and online <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, identify disinformation and fraud attempts, protect itself against cyberattacks, scams and fraud online, and in which children learn how to understand and navigate through the myriad of information they are exposed to online.</p>\n<p><strong>It is our proposed level of ambition that by 2030:</strong></p>\n<ul>\n<li>At least 80% of all adults have <span class=\"term-link\" data-term-id=\"basic-digital-skill\" tabindex=\"0\">basic digital skills</span></li>\n<li>At least 20 million ICT specialists are employed in the EU, with convergence between women and men</li>\n</ul>\n<h3 id=\"32-secure-and-sustainable-digital-infrastructures\">3.2 Secure and sustainable digital infrastructures</h3>\n<p>Secure connectivity is the lifeblood of the digital transformation. As the decade progresses, households will increase the take up of such network technologies reflecting their rising needs for very high capacity connectivity. By the end of this decade, new digital <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communications</span> features and capabilities such as high-precision, holographic media, and digital-senses over the networks, are expected to provide a whole new perspective to a digitally enabled society underpinning the need for gigabit connectivity.</p>\n<p><strong>It is our proposed level of ambition that by 2030:</strong></p>\n<ul>\n<li>All European households will be covered by a Gigabit network, with all populated areas covered by 5G</li>\n</ul>\n<p>If connectivity is a precondition for digital transformation, microprocessors are at the start of most of the key, strategic value chains such as connected cars, phones, Internet of Things, high performance computers, edge computers and Artificial Intelligence. While Europe designs and manufactures high-end chips, there are important gaps, notably in state-of-the-art fabrication technologies and in chip design, exposing Europe to a number of <span class=\"term-link\" data-term-id=\"vulnerability\" tabindex=\"0\">vulnerabilities</span>.</p>\n<p><strong>It is our proposed level of ambition that by 2030:</strong></p>\n<ul>\n<li>The production of cutting-edge and sustainable semiconductors in Europe including <span class=\"term-link\" data-term-id=\"processor\" tabindex=\"0\">processors</span> is at least 20% of world production in value</li>\n</ul>\n<p>As highlighted in the European data strategy, the volume of data generated is greatly increasing and a growing proportion of data is expected to be processed at the edge, closer to the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> and where data are generated. To address these trends towards increasing distribution and decentralization of data <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> capacities, and to overcome the gap of suitable cloud supply meeting the needs of European businesses and public administration, Europe needs to strengthen its own cloud infrastructure and capacities.</p>\n<p><strong>It is our proposed level of ambition that by 2030:</strong></p>\n<ul>\n<li>10,000 climate neutral highly secure <span class=\"term-link\" data-term-id=\"edge-nodes\" tabindex=\"0\">edge nodes</span> are deployed in the EU</li>\n<li>By 2025, Europe will have its first computer with quantum acceleration paving the way for Europe to be at the cutting edge of quantum capabilities by 2030</li>\n</ul>\n<h3 id=\"33-digital-transformation-of-businesses\">3.3 Digital transformation of businesses</h3>\n<p>During the COVID-19 pandemic embracing digital technologies has become essential for many businesses. By 2030, more than just enablers, digital technologies including 5G, the Internet of Things, edge computing, Artificial Intelligence, robotics and augmented reality will be at the core of new <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span>, new manufacturing processes and new business models based on fair sharing of data in the data economy.</p>\n<p>The transformation of businesses will depend on their ability to adopt new digital technologies rapidly and across the board, including in industrial and <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> ecosystems that are lagging behind.</p>\n<p>SMEs have a central role in this transition, not only because they represent the bulk of the EU companies, but also because they are a critical source of innovation. With the support of over 200 Digital Innovation Hubs and industrial clusters, by 2030, SMEs should have the opportunity to access digital technologies or data easily and on fair terms.</p>\n<p><strong>It is our proposed level of ambition that by 2030:</strong></p>\n<ul>\n<li>75% of European <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> have taken up <span class=\"term-link\" data-term-id=\"cloud-computing-service\" tabindex=\"0\">cloud computing services</span>, big data and Artificial Intelligence</li>\n<li>More than 90% of European SMEs reach at least a basic level of <span class=\"term-link\" data-term-id=\"digital-intensity\" tabindex=\"0\">digital intensity</span></li>\n<li>Europe will grow the pipeline of its innovative scale ups and improve their access to finance, leading to doubling the number of unicorns in Europe</li>\n</ul>\n<h3 id=\"34-digitalisation-of-public-services\">3.4 Digitalisation of public services</h3>\n<p>By 2030, the EU's objective is to ensure that democratic life and public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> online will be fully accessible for everyone, including persons with disabilities, and benefit from a best-in-class digital environment providing for easy-to-use, efficient and personalised <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> and tools with high security and privacy <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>.</p>\n<p>Government as a Platform, as a new way of building digital public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, will provide a holistic and easy access to public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> with a seamless interplay of advanced capabilities, such as data <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span>, AI and virtual reality. It will also contribute to stimulating productivity gains by European business, thanks to more efficient <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> that are digital by default.</p>\n<p><strong>European digital identity: the Government in the palm of your hand</strong></p>\n<p>By 2030, the EU framework should have led to wide deployment of a trusted, <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-controlled identity, allowing each citizen to control their own online interactions and presence. <strong><span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">Users</span> can make a full use of online <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> easily and throughout the EU while preserving their privacy.</strong></p>\n<p><strong>It is our proposed level of ambition that by 2030:</strong></p>\n<ul>\n<li><strong>100% online provision of <span class=\"term-link\" data-term-id=\"key-public-services\" tabindex=\"0\">key public services</span> available for European citizens and businesses</strong></li>\n<li><strong>100% of European citizens have access to medical records (e-records)</strong></li>\n<li><strong>80% of citizens will use a digital ID solution</strong></li>\n</ul>\n<hr>\n<h2 id=\"4-digital-citizenship\">4. Digital Citizenship</h2>\n<p>Deploying digital infrastructures, skills and capacities and digitising businesses and public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> alone is not sufficient to define the EU's approach to its digital future; it is also necessary to enable all Europeans to make full use of digital opportunities and technologies. In the digital space, we need to make sure that the same rights that apply offline can be fully exercised online.</p>\n<p>To be fully empowered, people should first have access to affordable, secure and high quality connectivity, be able to learn <span class=\"term-link\" data-term-id=\"basic-digital-skill\" tabindex=\"0\">basic digital skills</span> – which should become a right for all – and be equipped with other means which together allow them to fully participate in economic and societal activities of today and the future. <strong>They also need to have easy access to digital public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>, on the basis of a universal digital identity</strong>, as well as access to digital health <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. People should benefit from non-discriminatory access to online <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> and as well from the realisation of principles, such as secure and trusted digital spaces, work-life balance in a remote working environment, protection of minors, and ethical algorithmic decision-making.</p>\n<p>This European way for the digital society should also underpin and support open democracy initiatives by contributing to inclusive policy-making, enabling wide-ranging engagement with people and stimulating grass-roots action for developing local initiatives.</p>\n<p>This European way for the digital society is also based on ensuring full respect of EU fundamental rights:</p>\n<ul>\n<li>Freedom of expression, including access to diverse, trustworthy and transparent information</li>\n<li>Freedom to set up and conduct a business online</li>\n<li>Protection of <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> and privacy, and right to be forgotten</li>\n<li>Protection of the intellectual creation of individuals in the online space</li>\n</ul>\n<p>It is equally important to set up a comprehensive set of digital principles:</p>\n<ul>\n<li>Universal Access to internet <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span></li>\n<li>A secure and trusted online environment</li>\n<li>Universal digital education and skills for people to take an active part in society and in democratic processes</li>\n<li>Access to digital systems and devices that respect the environment</li>\n<li>Accessible and human-centric digital public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> and administration</li>\n<li>Ethical principles for human centric algorithms</li>\n<li>Protecting and empowering children in the online space</li>\n<li>Access to digital health <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span></li>\n</ul>\n<hr>\n<h2 id=\"5-a-compass-to-reach-the-2030-targets-and-objectives\">5. A Compass to Reach the 2030 Targets and Objectives</h2>\n<p>To deliver the renewed EU ambition for digitalisation a robust framework is necessary. It should encompass our vision based on the four cardinal points, digital principles and addressing critical capacity gaps.</p>\n<h3 id=\"51-governance\">5.1 Governance</h3>\n<p>Operationally, the Commission intends to propose a Digital Compass in the form of a digital policy programme to be adopted by co-decision of European Parliament and Council, setting the focus on delivery and constant commitment towards the common digital goals. The programme would feature the following aspects:</p>\n<ul>\n<li>A set of concrete objectives for each of the four cardinal points</li>\n<li>A monitoring system measuring the progress of the EU against the key targets for 2030 and digital principles</li>\n<li>On the basis of the analysis, the Commission will publish annually the European State of the Digital Decade Report</li>\n</ul>\n<p>The Report will trigger a collaborative analysis between the Commission and <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span> to identify solutions addressing weaknesses and to propose targeted actions for effective remedies.</p>\n<h3 id=\"52-multi-country-projects\">5.2 Multi-Country Projects</h3>\n<p>To deliver the European vision for the Digital Decade, digital capacities are needed in the four areas of the Digital Compass, which can only be delivered if <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span> and the EU pool resources. For the large technological projects that are necessary for Europe's digital transition, a European approach to building digital capacities is indispensable.</p>\n<p>Multi-country digital projects discussed so far with the <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span> under the RRF:</p>\n<ul>\n<li>Building a common and multi-purpose pan-European interconnected data <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> infrastructure</li>\n<li>Endowing the EU with capabilities in electronics design and deployment of the next generation of low power trusted <span class=\"term-link\" data-term-id=\"processor\" tabindex=\"0\">processors</span></li>\n<li>Pan-European deployment of 5G corridors for advanced digital rail operations and Connected and Automated Mobility</li>\n<li>Acquiring supercomputers and quantum computers, connected with the EuroHPC network</li>\n<li>Developing and deploying an ultra-secure quantum <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">communication</span> infrastructure spanning the whole EU</li>\n<li>Deploying a network of Security Operations Centres, powered by artificial intelligence</li>\n<li><strong>Connected Public Administration: build in complementarity and synergy with the eIDAS framework and offer on a voluntary basis European Digital Identity</strong></li>\n<li>European Blockchain <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">Services</span> Infrastructure</li>\n<li>European Digital Innovation Hubs</li>\n<li>High tech partnerships for digital skills through Pact for Skills</li>\n</ul>\n<hr>\n<h2 id=\"6-international-partnerships-for-the-digital-decade\">6. International Partnerships for the Digital Decade</h2>\n<p>The degree of digitalisation of an economy or society has been shown not only to be a critical underpinning of economic and societal resilience, but also a factor in global influence. As the pandemic has highlighted the extent to which digital policy is never value-neutral, with competing models on offer the EU now has an opportunity to promote its positive and human-centric vision of the digital economy and society.</p>\n<p>For Europe's Digital Decade to be successful, we will build strong international digital partnerships matching the four pillars of our Compass: skills, infrastructures, transformation of business and of public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span>. These will strengthen the EU's capacity to assert its own interests and deliver global solutions while fighting against unfair and abusive practices and ensuring the security and resilience of EU digital supply chains.</p>\n<p>The EU's starting point is an open digital economy based on the flow of investment and innovation as an engine for prosperity. At the same time, the EU will strongly promote our core interests and values, through three overarching principles:</p>\n<ul>\n<li>A level playing field in digital markets</li>\n<li>A secure cyberspace</li>\n<li>Upholding fundamental rights online</li>\n</ul>\n<p>The EU's international digital partnerships will promote alignment or convergence with EU regulatory norms and <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> on issues such as data protection, privacy and data flows, the ethical use of AI, <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span> and trust, tackling disinformation and illegal content online, ensuring internet governance, and supporting development of digital finance and e-government.</p>\n<p>Building on a renewed transatlantic relationship as a strong pillar of our digital international engagement, the EU should lead the way towards a wider coalition of like-minded partners, open to and developed together with all those who share its vision of a human-centric digital transformation.</p>\n<hr>\n<h2 id=\"7-conclusion-the-way-forward\">7. Conclusion: the way forward</h2>\n<p>The Digital Compass <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">Communication</span> maps out a clear path towards a common vision and actions for Europe to succeed in the Digital Decade, at home and in the world.</p>\n<p>The involvement and commitment of the public and of all stakeholders is crucial to achieve a successful digital transformation. In this context, the Commission, shortly after this <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">Communication</span>, will start a wide consultation process on the digital principles. It will engage with the <span class=\"term-link\" data-term-id=\"member-state\" tabindex=\"0\">Member States</span>, the European Parliament, regional and economic and social partners, businesses and citizens, on specific elements of the <span class=\"term-link\" data-term-id=\"communication\" tabindex=\"0\">Communication</span> during 2021, including the compass framework with specific targets and governance.</p>\n<p>The Commission will propose the Digital Policy Programme to the co-legislators by the third quarter of 2021, and hopes to achieve decisive progress with the other institutions on a Declaration of Digital Principles by the end of 2021.</p>\n<hr>\n<h2 id=\"annex\">ANNEX</h2>\n<h3 id=\"proposal-of-common-targets-to-mobilise-public-and-private-actors\">Proposal of Common Targets to Mobilise Public and Private Actors</h3>\n<p>When selecting targets, the Commission looked at existing Key Performance Indicators (KPIs), having in mind that targets need to be measurable in order to be monitored. The choice of lead KPIs was made based partly on existing KPIs which are monitored in the Digital Economy and Society Index (DESI) monitoring system set up by the Commission since 2014.</p>\n<hr>\n<h3 id=\"cardinal-point-1-a-digitally-skilled-population-and-highly-skilled-digital-professionals\">Cardinal Point 1: A Digitally Skilled Population and Highly Skilled Digital Professionals</h3>\n<p><strong>EU Objective for 2030:</strong> <em>\"A tech savvy continent where all are digitally empowered\"</em></p>\n<table>\n<thead>\n<tr>\n<th>Dimension</th>\n<th>2030 EU Target</th>\n<th>2020 Baseline</th>\n<th>Source</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong><span class=\"term-link\" data-term-id=\"basic-digital-skill\" tabindex=\"0\">Basic digital skills</span></strong></td>\n<td>80% of adults aged 16-74</td>\n<td>58.3%</td>\n<td>DESI</td>\n</tr>\n<tr>\n<td><strong>ICT specialists</strong></td>\n<td>20 million employed, with gender convergence</td>\n<td>7.8 million (18% women)</td>\n<td>DESI, Eurostat</td>\n</tr>\n</tbody>\n</table>\n<hr>\n<h3 id=\"cardinal-point-2-secure-resilient-performant-and-sustainable-digital-infrastructures\">Cardinal Point 2: Secure, Resilient, Performant and Sustainable Digital Infrastructures</h3>\n<p><strong>EU Objective for 2030:</strong> <em>\"Top-notch trustworthy and secure Digital Infrastructures\"</em></p>\n<table>\n<thead>\n<tr>\n<th>Dimension</th>\n<th>2030 EU Target</th>\n<th>2020 Baseline</th>\n<th>Source</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Connectivity — Gigabit</strong></td>\n<td>All households covered by Gigabit network</td>\n<td>59% VHCN coverage</td>\n<td>DESI</td>\n</tr>\n<tr>\n<td><strong>Connectivity — 5G</strong></td>\n<td>All populated areas covered by 5G</td>\n<td>14% (2021)</td>\n<td>Broadband Study</td>\n</tr>\n<tr>\n<td><strong>Semiconductors</strong></td>\n<td>20% of world production in value (below 5nm)</td>\n<td>10%</td>\n<td>TBC in policy programme</td>\n</tr>\n<tr>\n<td><strong>Edge computing</strong></td>\n<td>10,000 climate-neutral secure <span class=\"term-link\" data-term-id=\"edge-nodes\" tabindex=\"0\">edge nodes</span></td>\n<td>0 (technology emerging)</td>\n<td>CEF2 annual study</td>\n</tr>\n<tr>\n<td><strong>Quantum computing</strong></td>\n<td>First quantum-accelerated computer by 2025</td>\n<td>0</td>\n<td>TBC</td>\n</tr>\n</tbody>\n</table>\n<p><em>Note: Edge <span class=\"term-link\" data-term-id=\"node\" tabindex=\"0\">node</span> target based on vision of 80% data <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> at the edge by 2025. A mesh with a <span class=\"term-link\" data-term-id=\"node\" tabindex=\"0\">node</span> every 100km requires 8-10,000 <span class=\"term-link\" data-term-id=\"edge-nodes\" tabindex=\"0\">edge nodes</span> to achieve few-millisecond latency.</em></p>\n<hr>\n<h3 id=\"cardinal-point-3-digital-transformation-of-businesses\">Cardinal Point 3: Digital Transformation of Businesses</h3>\n<p><strong>EU Objective for 2030:</strong> <em>\"The continent with a high share of digitalised businesses\"</em></p>\n<table>\n<thead>\n<tr>\n<th>Dimension</th>\n<th>2030 EU Target</th>\n<th>2020 Baseline</th>\n<th>Source</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Cloud computing</strong></td>\n<td>75% of <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> using cloud</td>\n<td>26%</td>\n<td>Eurostat</td>\n</tr>\n<tr>\n<td><strong>Big data</strong></td>\n<td>75% of <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> using big data</td>\n<td>14%</td>\n<td>Eurostat</td>\n</tr>\n<tr>\n<td><strong>Artificial Intelligence</strong></td>\n<td>75% of <span class=\"term-link\" data-term-id=\"enterprise\" tabindex=\"0\">enterprises</span> using AI</td>\n<td>25%</td>\n<td>IPSOS</td>\n</tr>\n<tr>\n<td><strong>SME <span class=\"term-link\" data-term-id=\"digital-intensity\" tabindex=\"0\">digital intensity</span></strong></td>\n<td>90% of SMEs at basic level (DII ≥ 4)</td>\n<td>60.6% (2019)</td>\n<td>DII, Eurostat</td>\n</tr>\n<tr>\n<td><strong>Unicorns</strong></td>\n<td>Double the number</td>\n<td>122 (2021)</td>\n<td>Dealroom</td>\n</tr>\n</tbody>\n</table>\n<p><em>Note: <span class=\"term-link\" data-term-id=\"digital-intensity\" tabindex=\"0\">Digital Intensity</span> Index (DII) measures 12 digital technologies at firm level, including: internet access, ICT specialists, fast broadband (30+ Mbps), mobile devices, website, social media, cloud, eInvoices, eCommerce.</em></p>\n<hr>\n<h3 id=\"cardinal-point-4-digitalisation-of-public-services\">Cardinal Point 4: Digitalisation of Public Services</h3>\n<p><strong>EU Objective for 2030:</strong> <em>\"Modernised public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> responding to society's needs\"</em></p>\n<table>\n<thead>\n<tr>\n<th>Dimension</th>\n<th>2030 EU Target</th>\n<th>2020 Baseline</th>\n<th>Source</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong><span class=\"term-link\" data-term-id=\"key-public-services\" tabindex=\"0\">Key public services</span> online</strong></td>\n<td>100% online provision</td>\n<td>75/100 (citizens), 84/100 (businesses)</td>\n<td>eGov Benchmark</td>\n</tr>\n<tr>\n<td><strong>Electronic health records</strong></td>\n<td>100% of citizens have access</td>\n<td>N/A</td>\n<td>TBC</td>\n</tr>\n<tr>\n<td><strong>Digital ID adoption</strong></td>\n<td><strong>80% of citizens using digital ID</strong></td>\n<td>N/A (no baseline)</td>\n<td>TBC</td>\n</tr>\n</tbody>\n</table>\n<hr>\n<h3 id=\"notes-on-data-sources\">Notes on Data Sources</h3>\n<p><strong>DESI (Digital Economy and Society Index):</strong> Composite index summarising indicators on Europe's digital performance across five dimensions: Connectivity, Human Capital, Use of Internet, Integration of Digital Technology, and Digital Public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">Services</span>. Published annually since 2014.</p>\n<p><strong>DII (<span class=\"term-link\" data-term-id=\"digital-intensity\" tabindex=\"0\">Digital Intensity</span> Index):</strong> Micro-based index measuring 12 digital technologies at firm level. Firms scoring 4 or more are considered to have \"basic level\" of <span class=\"term-link\" data-term-id=\"digital-intensity\" tabindex=\"0\">digital intensity</span>.</p>\n<p><strong>eGovernment Benchmark:</strong> Measures online availability and usability of public <span class=\"term-link\" data-term-id=\"service\" tabindex=\"0\">services</span> provided to citizens and businesses.</p>",
  "wordCount": 3756,
  "lastProcessed": "2026-01-24T17:29:02.207Z",
  "preambleInjected": false
}