{
  "slug": "2024-2977",
  "type": "implementing-act",
  "title": "Commission Implementing Regulation (EU) 2024/2977 of 28 November 2024 laying down rules for the application of Regulation (EU) No 910/2014 of the European Parliament and of the Council as regards person identification data and electronic attestations of attributes issued to European Digital Identity Wallets",
  "shortTitle": "PID & EAA",
  "description": "THE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC \\[OJ L 257, 28.",
  "celex": "32024R2977",
  "date": "28 November 2024",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32024R2977",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "annex",
      "title": "ANNEX",
      "level": 2
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"10\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> \\[OJ L 257, 28.8.2014, p. 73, ELI: http://data.europa.eu/eli/reg/2014/910/oj.\\], and in particular Article 5a(23) thereof,*\n\n## Recitals\n\n- (1) The European Digital Identity Framework established by <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, is a crucial component in the establishment of a secure and interoperable digital identity ecosystem across the Union. With the European Digital Identity Wallets ('wallets') as the cornerstone of the framework, it aims at facilitating access to services across Member States, while ensuring the protection of personal data and privacy.\n\n- (2) Regulation (EU) 2016/679 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to all personal data processing activities under this Regulation.\n\n- (3) Article 5a(23) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> mandates the Commission, where necessary, to establish the relevant specifications and procedures. This is achieved by means of four Implementing Regulations, dealing with protocols and interfaces: Commission Implementing Regulation (EU) 2024/2982 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Regulation 2024/2982\" data-celex=\"32024R2982\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2982\">Regulation 2024/2982</span>, integrity and core functionalities: Commission Implementing Regulation (EU) 2024/2979 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2024/2979\" data-celex=\"32024R2979\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2979\">Regulation 2024/2979</span>, person identification data and electronic attestation of attributes: Commission Implementing Regulation (EU) 2024/2977 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2024/2977\" data-celex=\"32024R2977\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2977\">Regulation 2024/2977</span>, as well as the notifications to the Commission: Commission Implementing Regulation (EU) 2024/2980 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/2980\" data-celex=\"32024R2980\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2980\">Regulation 2024/2980</span>. This Regulation lays down the relevant requirements for person identification data and electronic attestations of attributes to be issued to European Digital Identity Wallets.\n\n- (4) The Commission regularly assesses new technologies, practices, standards or technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Implementing Regulation rely on the work carried out on the basis of Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework \\[OJ L 210, 14.6.2021, p. 51, ELI: http://data.europa.eu/eli/reco/2021/946/oj.\\] and in particular the architecture and reference framework which is part of it. In accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"16\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183?section=recital-75\">Recital 75 of Regulation (EU) 2024/1183</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, the Commission should review and update this implementing regulation, if necessary, to keep it in line with global developments, the architecture and reference framework and to follow the best practices on the internal market.\n\n- (5) To ensure data protection by design and by default, the wallets should be provided with several privacy enhancing features to prevent providers of electronic identification means and electronic attestation of attributes from combining personal data obtained when providing other services with the personal data processed to provide the services falling within the scope of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>.\n\n- (6) To ensure harmonisation, certain common functionalities should be available in all wallets, including the ability to securely request, obtain, select, combine, store, delete, share, and present, under the sole control of the wallet user, person identification data and electronic attestations of attributes. To ensure that person identification data and electronic attestations of attributes can be processed via every wallet unit, technical specifications concerning person identification data attributes, the data format, and the infrastructure required to ensure appropriate trustworthiness of person identification data need to be supported by all wallet solutions. Further, common specifications in relation to attributes of person identification data aim at ensuring that this data can be used for identity matching as required.\n\n- (7) Member States are to ensure that the wallets are able to authenticate relying parties, providers of person identification data and providers of electronic attestations of attributes irrespective of where they are established in the Union. To achieve this, these entities should use wallet-relying party access certificates when they identify themselves to wallet units. To guarantee interoperability of these certificates across all wallets provided within the Union, wallet-relying parties’ access certificates should adhere to common standards. The Commission, in collaboration with Member States, should closely monitor the development of new or alternative standards on which relying-party access certificates could be built. In particular, trust models that have proven their efficacy and security in Member States should be assessed.\n\n- (8) To ensure transparency towards wallet users, Member States should publish information indicating which wallet solutions are supported by providers of person identification data established in their territories. Since the identity of the user must be as reliable as possible, a common assurance level high should be imposed on the identity proofing of wallet users prior to the issuance of person identification data, according to assurance level high as laid down for electronic identification means under <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. In this manner, the wallet units ensure the highest available degree of trustworthiness for means of identification across the Union. During enrolment of wallet users at level of assurance high, various secure processes are possible, for instance, where the wallet user has been verified to be in possession of photo or biometric identification evidence recognised but not issued by the Member State in which the application for the electronic identification means is made and that evidence represents the claimed identity, the evidence should be checked to determine that it is valid according to a relevant authoritative source.\n\n- (9) In order to support interoperability, electronic attestations of attributes should comply with harmonised requirements on the format.\n\n- (10) To protect the data of wallet users and to ensure the authenticity of electronic attestations of attributes, mechanisms for the authentication of providers of electronic attestations of attributes, and for the verification of the authenticity and validity of wallet units by that provider should apply prior to the issuance of the attestations to wallet units.\n\n- (11) In order to avoid the use of, and the reliance on, person identification data and electronic attestations of attributes that have lost their legal validity after being issued to a wallet unit, providers of person identification data and of electronic attestations of attributes should publish a policy outlining the circumstances and procedures for revocation.\n\n- (12) To ensure that the person identification data uniquely represents the wallet user, Member States should, in addition to the mandatory attributes in the person identification data set out in this Regulation, provide optional attributes needed to ensure that the set of person identification data is unique.\n\n- (13) The European Data Protection Supervisor was consulted in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"17\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Article 42(1) of Regulation (EU) 2018/1725</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"8\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span> and delivered its opinion on 30 September 2024.\n\n- (14) The measures provided for in this Regulation are in accordance with the opinion of the committee referred to in Article 48 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>,\n\n**HAS ADOPTED THIS REGULATION:**\n\n## Enacting Terms\n\n### Article 1\n**Subject matter and scope**\n\nThis Regulation lays down rules for the issuance of person identification data and electronic attestations of attributes to wallet units, to be updated on a regular basis to keep in line with technology and standards developments and with the work carried out on the basis of Recommendation (EU) 2021/946, and in particular the architecture and reference framework.\n\n### Article 2\n**Definitions**\n\nFor the purpose of this Regulation, the following definitions apply:\n\n- (1) 'wallet user' means a user who is in control of the wallet unit;\n- (2) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;\n- (3) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;\n- (4) 'provider of person identification data' means a natural or legal person responsible for issuing and revoking the person identification data and ensuring that the person identification data of a user is cryptographically bound to a wallet unit;\n- (5) 'wallet unit attestation' means a data object that describes the components of the wallet unit or allows authentication and validation of those components;\n- (6) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;\n- (7) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;\n- (8) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;\n- (9) 'wallet provider' means a natural or legal person who provides wallet solutions;\n- (10) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;\n- (11) 'wallet-relying party' means a relying party that intends to rely upon wallet units for the provision of public or private services by means of digital interaction;\n- (12) 'wallet-relying party access certificate' means a certificate for electronic seals or signatures authenticating and validating the wallet-relying party issued by a provider of wallet-relying party access certificates;\n- (13) 'provider of wallet-relying party access certificates' means a natural or legal person mandated by a Member State to issue relying party access certificates to wallet-relying parties registered in that Member State.\n\n### Article 3\n**Issuance of person identification data to wallet units**\n\n1. Providers of person identification data shall issue person identification data to wallet units in accordance with the electronic identification schemes under which wallet solutions are provided.\n\n2. Providers of person identification data shall ensure that person identification data issued to wallet units contains the information necessary for authentication and validation of the person identification data.\n\n3. Providers of person identification data shall ensure that person identification data issued to wallet units comply with the technical specifications set out in the Annex.\n\n4. Member States shall ensure that the person identification data issued to a given wallet user is unique for the Member State.\n\n5. Providers of person identification data shall ensure that person identification data that they issue is cryptographically bound to the wallet unit to which it is issued.\n\n6. Member States shall make publicly available a list of wallet solutions that are supported by providers of person identification data that is part of electronic identification schemes of that Member State.\n\n7. Member States shall enroll wallet users in accordance with the requirements relating to enrolment at assurance level high, as set out in Commission Implementing Regulation (EU) 2015/1502 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"9\" data-short=\"Regulation 2015/1502\" data-celex=\"32015R1502\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2015/1502/oj\">Regulation 2015/1502</span>. In the context of the enrolment process, providers of person identification data shall perform identity verification of the wallet user in accordance with the requirements related to identity proofing and verification before issuing the person identification data to the wallet unit of the corresponding wallet user.\n\n8. When issuing person identification data to wallet units, providers of person identification data shall identify themselves to wallet units using their wallet-relying party access certificate or by using another authentication mechanism in accordance with an electronic identity scheme notified at assurance level high.\n\n9. Before issuing person identification data to a wallet unit, providers of person identification data shall authenticate and validate the wallet unit attestation of the wallet unit and verify that the wallet unit belongs to a wallet solution the provider of person identification data accepts or use another authentication mechanism in accordance with an electronic identity scheme notified at assurance level high.\n\n### Article 4\n**Issuance of electronic attestations of attributes to wallet units**\n\n1. Electronic attestations of attributes issued to wallet units shall comply with at least one of the standards in the list set out in Annex I of Implementing Regulation (EU) 2024/2979.\n\n2. Providers of electronic attestations of attributes shall identify themselves to wallet units using their wallet-relying party access certificate.\n\n3. Providers of electronic attestations of attributes shall ensure that electronic attestations of attributes issued to wallet units contain the information necessary for authentication and validation of those electronic attestations of attributes.\n\n### Article 5\n**Revocation of person identification data**\n\n1. Providers of person identification data issued to a wallet unit shall have written and publicly accessible policies relating to validity status management, including, where applicable, the conditions under which such person identification data can be revoked without delay.\n\n2. Only providers of person identification data or electronic attestation of attributes can revoke the person identification data or electronic attestations of attributes issued by them.\n\n3. Where providers of person identification data have revoked person identification data, they shall, through dedicated and secure channels, inform wallet users subject of those person identification data within 24 hours of the revocation and of the reasons for the revocation. This shall be done in a manner that is concise, easily accessible and using clear and plain language.\n\n4. Where providers of person identification data revoke person identification data issued to wallet units, they shall do so in each of the following circumstances:\n   - (a) upon the explicit request of the wallet user to whose wallet unit the person identification data or electronic attestation of attributes were issued to;\n   - (b) where the wallet unit attestation to which the person identification data was issued to has been revoked;\n   - (c) in other situations determined by the providers of person identification data or electronic attestations of attributes in their policies referred to in paragraph 1.\n\n5. Providers of person identification data issued to a wallet unit shall ensure that revocations cannot be reverted.\n\n6. The revoked person identification data shall remain accessible for as long as required by Union law or national law.\n\n7. Where providers of person identification data revoke person identification data issued to wallet units, they shall make publicly available the validity status of person identification data they issue, in a privacy preserving manner, and indicate the location of that information in the person identification data.\n\n8. Providers of person identification data shall enable privacy preserving techniques which ensure unlinkability where the electronic attestations of attributes do not require the identification of the user.\n\n### Article 6\n**Entry into force**\n\nThis Regulation shall enter into force on the twentieth day following that of its publication in the\n\n---\n\nThis Regulation shall be binding in its entirety and directly applicable in all Member States.\n\nDone at Brussels, 28 November 2024.\n\n*For the Commission*\n\n*The President*\n\nUrsula von der Leyen\n\n\n## ANNEX\n\n**1.**Set of natural person identification data**\n\nWhere an attribute value is not known for the person or cannot otherwise be issued as part of the person identification dataset, Member States shall use an attribute value appropriate to the situation instead.\n\n**2.**Set of legal person identification data**\n\nWhere a data element is not known for the person or cannot otherwise be issued as part of the person identification dataset, Member States shall use an attribute value appropriate to the situation instead.\n\n**3.**Set of metadata about person identification data**\n\n**4.**Encoding of person identification data attributes**\n\nPerson identification data shall be issued in two formats:\n\n- (1) the format specified in ISO/IEC 18013-5:2021;\n- (2) 'Verifiable Credentials Data Model 1.1.', W3C Recommendation, 3 March 2022.\n\n**5.**Trust infrastructure details**\n\nThe list of providers of person identification data made available by the Commission in accordance with Implementing Regulation (EU) 2024/2980 laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council as regards notifications to the Commission concerning the European Digital Identity Wallet ecosystem as regards notifications shall enable authentication of person identification data.\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN COMMISSION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union,</em></p>\n<p><em>Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"10\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> [OJ L 257, 28.8.2014, p. 73, ELI: <a href=\"http://data.europa.eu/eli/reg/2014/910/oj.%5C\">http://data.europa.eu/eli/reg/2014/910/oj.\\</a>], and in particular Article 5a(23) thereof,</em></p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) The European Digital Identity Framework established by <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, is a crucial component in the establishment of a secure and interoperable digital identity ecosystem across the Union. With the European Digital Identity Wallets ('wallets') as the cornerstone of the framework, it aims at facilitating access to services across Member States, while ensuring the protection of personal data and privacy.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) Regulation (EU) 2016/679 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to all personal data processing activities under this Regulation.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) Article 5a(23) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> mandates the Commission, where necessary, to establish the relevant specifications and procedures. This is achieved by means of four Implementing Regulations, dealing with protocols and interfaces: Commission Implementing Regulation (EU) 2024/2982 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Regulation 2024/2982\" data-celex=\"32024R2982\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2982\">Regulation 2024/2982</span>, integrity and core functionalities: Commission Implementing Regulation (EU) 2024/2979 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2024/2979\" data-celex=\"32024R2979\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2979\">Regulation 2024/2979</span>, person identification data and electronic attestation of attributes: Commission Implementing Regulation (EU) 2024/2977 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2024/2977\" data-celex=\"32024R2977\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2977\">Regulation 2024/2977</span>, as well as the notifications to the Commission: Commission Implementing Regulation (EU) 2024/2980 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/2980\" data-celex=\"32024R2980\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2980\">Regulation 2024/2980</span>. This Regulation lays down the relevant requirements for person identification data and electronic attestations of attributes to be issued to European Digital Identity Wallets.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) The Commission regularly assesses new technologies, practices, standards or technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Implementing Regulation rely on the work carried out on the basis of Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework [OJ L 210, 14.6.2021, p. 51, ELI: <a href=\"http://data.europa.eu/eli/reco/2021/946/oj.%5C\">http://data.europa.eu/eli/reco/2021/946/oj.\\</a>] and in particular the architecture and reference framework which is part of it. In accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"16\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183?section=recital-75\">Recital 75 of Regulation (EU) 2024/1183</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, the Commission should review and update this implementing regulation, if necessary, to keep it in line with global developments, the architecture and reference framework and to follow the best practices on the internal market.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) To ensure data protection by design and by default, the wallets should be provided with several privacy enhancing features to prevent providers of electronic identification means and electronic attestation of attributes from combining personal data obtained when providing other services with the personal data processed to provide the services falling within the scope of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) To ensure harmonisation, certain common functionalities should be available in all wallets, including the ability to securely request, obtain, select, combine, store, delete, share, and present, under the sole control of the wallet user, person identification data and electronic attestations of attributes. To ensure that person identification data and electronic attestations of attributes can be processed via every wallet unit, technical specifications concerning person identification data attributes, the data format, and the infrastructure required to ensure appropriate trustworthiness of person identification data need to be supported by all wallet solutions. Further, common specifications in relation to attributes of person identification data aim at ensuring that this data can be used for identity matching as required.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) Member States are to ensure that the wallets are able to authenticate relying parties, providers of person identification data and providers of electronic attestations of attributes irrespective of where they are established in the Union. To achieve this, these entities should use wallet-relying party access certificates when they identify themselves to wallet units. To guarantee interoperability of these certificates across all wallets provided within the Union, wallet-relying parties’ access certificates should adhere to common standards. The Commission, in collaboration with Member States, should closely monitor the development of new or alternative standards on which relying-party access certificates could be built. In particular, trust models that have proven their efficacy and security in Member States should be assessed.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) To ensure transparency towards wallet users, Member States should publish information indicating which wallet solutions are supported by providers of person identification data established in their territories. Since the identity of the user must be as reliable as possible, a common assurance level high should be imposed on the identity proofing of wallet users prior to the issuance of person identification data, according to assurance level high as laid down for electronic identification means under <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. In this manner, the wallet units ensure the highest available degree of trustworthiness for means of identification across the Union. During enrolment of wallet users at level of assurance high, various secure processes are possible, for instance, where the wallet user has been verified to be in possession of photo or biometric identification evidence recognised but not issued by the Member State in which the application for the electronic identification means is made and that evidence represents the claimed identity, the evidence should be checked to determine that it is valid according to a relevant authoritative source.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) In order to support interoperability, electronic attestations of attributes should comply with harmonised requirements on the format.</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) To protect the data of wallet users and to ensure the authenticity of electronic attestations of attributes, mechanisms for the authentication of providers of electronic attestations of attributes, and for the verification of the authenticity and validity of wallet units by that provider should apply prior to the issuance of the attestations to wallet units.</p>\n</li>\n<li id=\"recital-11\" data-recital=\"11\" class=\"linkable-recital\">\n<p>(11) In order to avoid the use of, and the reliance on, person identification data and electronic attestations of attributes that have lost their legal validity after being issued to a wallet unit, providers of person identification data and of electronic attestations of attributes should publish a policy outlining the circumstances and procedures for revocation.</p>\n</li>\n<li id=\"recital-12\" data-recital=\"12\" class=\"linkable-recital\">\n<p>(12) To ensure that the person identification data uniquely represents the wallet user, Member States should, in addition to the mandatory attributes in the person identification data set out in this Regulation, provide optional attributes needed to ensure that the set of person identification data is unique.</p>\n</li>\n<li id=\"recital-13\" data-recital=\"13\" class=\"linkable-recital\">\n<p>(13) The European Data Protection Supervisor was consulted in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"17\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Article 42(1) of Regulation (EU) 2018/1725</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"8\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span> and delivered its opinion on 30 September 2024.</p>\n</li>\n<li id=\"recital-14\" data-recital=\"14\" class=\"linkable-recital\">\n<p>(14) The measures provided for in this Regulation are in accordance with the opinion of the committee referred to in Article 48 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>,</p>\n</li>\n</ul>\n<p><strong>HAS ADOPTED THIS REGULATION:</strong></p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Subject matter and scope</strong></p>\n<p>This Regulation lays down rules for the issuance of person identification data and electronic attestations of attributes to wallet units, to be updated on a regular basis to keep in line with technology and standards developments and with the work carried out on the basis of Recommendation (EU) 2021/946, and in particular the architecture and reference framework.</p>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>For the purpose of this Regulation, the following definitions apply:</p>\n<ul>\n<li id=\"article-2-para-1\" data-para=\"1\" data-context=\"article-2\" class=\"linkable-paragraph\">(1) 'wallet user' means a user who is in control of the wallet unit;</li>\n<li id=\"article-2-para-2\" data-para=\"2\" data-context=\"article-2\" class=\"linkable-paragraph\">(2) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;</li>\n<li id=\"article-2-para-3\" data-para=\"3\" data-context=\"article-2\" class=\"linkable-paragraph\">(3) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;</li>\n<li id=\"article-2-para-4\" data-para=\"4\" data-context=\"article-2\" class=\"linkable-paragraph\">(4) 'provider of person identification data' means a natural or legal person responsible for issuing and revoking the person identification data and ensuring that the person identification data of a user is cryptographically bound to a wallet unit;</li>\n<li id=\"article-2-para-5\" data-para=\"5\" data-context=\"article-2\" class=\"linkable-paragraph\">(5) 'wallet unit attestation' means a data object that describes the components of the wallet unit or allows authentication and validation of those components;</li>\n<li id=\"article-2-para-6\" data-para=\"6\" data-context=\"article-2\" class=\"linkable-paragraph\">(6) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;</li>\n<li id=\"article-2-para-7\" data-para=\"7\" data-context=\"article-2\" class=\"linkable-paragraph\">(7) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;</li>\n<li id=\"article-2-para-8\" data-para=\"8\" data-context=\"article-2\" class=\"linkable-paragraph\">(8) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;</li>\n<li id=\"article-2-para-9\" data-para=\"9\" data-context=\"article-2\" class=\"linkable-paragraph\">(9) 'wallet provider' means a natural or legal person who provides wallet solutions;</li>\n<li id=\"article-2-para-10\" data-para=\"10\" data-context=\"article-2\" class=\"linkable-paragraph\">(10) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;</li>\n<li id=\"article-2-para-11\" data-para=\"11\" data-context=\"article-2\" class=\"linkable-paragraph\">(11) 'wallet-relying party' means a relying party that intends to rely upon wallet units for the provision of public or private services by means of digital interaction;</li>\n<li id=\"article-2-para-12\" data-para=\"12\" data-context=\"article-2\" class=\"linkable-paragraph\">(12) 'wallet-relying party access certificate' means a certificate for electronic seals or signatures authenticating and validating the wallet-relying party issued by a provider of wallet-relying party access certificates;</li>\n<li id=\"article-2-para-13\" data-para=\"13\" data-context=\"article-2\" class=\"linkable-paragraph\">(13) 'provider of wallet-relying party access certificates' means a natural or legal person mandated by a Member State to issue relying party access certificates to wallet-relying parties registered in that Member State.</li>\n</ul>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Issuance of person identification data to wallet units</strong></p>\n<ol>\n<li id=\"article-3-para-1\" data-para=\"1\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Providers of person identification data shall issue person identification data to wallet units in accordance with the electronic identification schemes under which wallet solutions are provided.</p>\n</li>\n<li id=\"article-3-para-2\" data-para=\"2\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Providers of person identification data shall ensure that person identification data issued to wallet units contains the information necessary for authentication and validation of the person identification data.</p>\n</li>\n<li id=\"article-3-para-3\" data-para=\"3\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Providers of person identification data shall ensure that person identification data issued to wallet units comply with the technical specifications set out in the Annex.</p>\n</li>\n<li id=\"article-3-para-4\" data-para=\"4\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Member States shall ensure that the person identification data issued to a given wallet user is unique for the Member State.</p>\n</li>\n<li id=\"article-3-para-5\" data-para=\"5\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Providers of person identification data shall ensure that person identification data that they issue is cryptographically bound to the wallet unit to which it is issued.</p>\n</li>\n<li id=\"article-3-para-6\" data-para=\"6\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Member States shall make publicly available a list of wallet solutions that are supported by providers of person identification data that is part of electronic identification schemes of that Member State.</p>\n</li>\n<li id=\"article-3-para-7\" data-para=\"7\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Member States shall enroll wallet users in accordance with the requirements relating to enrolment at assurance level high, as set out in Commission Implementing Regulation (EU) 2015/1502 <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"9\" data-short=\"Regulation 2015/1502\" data-celex=\"32015R1502\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2015/1502/oj\">Regulation 2015/1502</span>. In the context of the enrolment process, providers of person identification data shall perform identity verification of the wallet user in accordance with the requirements related to identity proofing and verification before issuing the person identification data to the wallet unit of the corresponding wallet user.</p>\n</li>\n<li id=\"article-3-para-8\" data-para=\"8\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>When issuing person identification data to wallet units, providers of person identification data shall identify themselves to wallet units using their wallet-relying party access certificate or by using another authentication mechanism in accordance with an electronic identity scheme notified at assurance level high.</p>\n</li>\n<li id=\"article-3-para-9\" data-para=\"9\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Before issuing person identification data to a wallet unit, providers of person identification data shall authenticate and validate the wallet unit attestation of the wallet unit and verify that the wallet unit belongs to a wallet solution the provider of person identification data accepts or use another authentication mechanism in accordance with an electronic identity scheme notified at assurance level high.</p>\n</li>\n</ol>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>Issuance of electronic attestations of attributes to wallet units</strong></p>\n<ol>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Electronic attestations of attributes issued to wallet units shall comply with at least one of the standards in the list set out in Annex I of Implementing Regulation (EU) 2024/2979.</p>\n</li>\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Providers of electronic attestations of attributes shall identify themselves to wallet units using their wallet-relying party access certificate.</p>\n</li>\n<li id=\"article-4-para-3\" data-para=\"3\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Providers of electronic attestations of attributes shall ensure that electronic attestations of attributes issued to wallet units contain the information necessary for authentication and validation of those electronic attestations of attributes.</p>\n</li>\n</ol>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Revocation of person identification data</strong></p>\n<ol>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Providers of person identification data issued to a wallet unit shall have written and publicly accessible policies relating to validity status management, including, where applicable, the conditions under which such person identification data can be revoked without delay.</p>\n</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Only providers of person identification data or electronic attestation of attributes can revoke the person identification data or electronic attestations of attributes issued by them.</p>\n</li>\n<li id=\"article-5-para-3\" data-para=\"3\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Where providers of person identification data have revoked person identification data, they shall, through dedicated and secure channels, inform wallet users subject of those person identification data within 24 hours of the revocation and of the reasons for the revocation. This shall be done in a manner that is concise, easily accessible and using clear and plain language.</p>\n</li>\n<li id=\"article-5-para-4\" data-para=\"4\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Where providers of person identification data revoke person identification data issued to wallet units, they shall do so in each of the following circumstances:</p>\n<ul>\n<li id=\"article-5-para-4-point-a\" data-point=\"a\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(a) upon the explicit request of the wallet user to whose wallet unit the person identification data or electronic attestation of attributes were issued to;</li>\n<li id=\"article-5-para-4-point-b\" data-point=\"b\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(b) where the wallet unit attestation to which the person identification data was issued to has been revoked;</li>\n<li id=\"article-5-para-4-point-c\" data-point=\"c\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(c) in other situations determined by the providers of person identification data or electronic attestations of attributes in their policies referred to in paragraph 1.</li>\n</ul>\n</li>\n<li id=\"article-5-para-5\" data-para=\"5\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Providers of person identification data issued to a wallet unit shall ensure that revocations cannot be reverted.</p>\n</li>\n<li id=\"article-5-para-6\" data-para=\"6\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The revoked person identification data shall remain accessible for as long as required by Union law or national law.</p>\n</li>\n<li id=\"article-5-para-7\" data-para=\"7\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Where providers of person identification data revoke person identification data issued to wallet units, they shall make publicly available the validity status of person identification data they issue, in a privacy preserving manner, and indicate the location of that information in the person identification data.</p>\n</li>\n<li id=\"article-5-para-8\" data-para=\"8\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Providers of person identification data shall enable privacy preserving techniques which ensure unlinkability where the electronic attestations of attributes do not require the identification of the user.</p>\n</li>\n</ol>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Regulation shall enter into force on the twentieth day following that of its publication in the</p>\n<hr>\n<p>This Regulation shall be binding in its entirety and directly applicable in all Member States.</p>\n<p>Done at Brussels, 28 November 2024.</p>\n<p><em>For the Commission</em></p>\n<p><em>The President</em></p>\n<p>Ursula von der Leyen</p>\n<h2 id=\"annex\">ANNEX</h2>\n<p>**1.<strong>Set of natural person identification data</strong></p>\n<p>Where an attribute value is not known for the person or cannot otherwise be issued as part of the person identification dataset, Member States shall use an attribute value appropriate to the situation instead.</p>\n<p>**2.<strong>Set of legal person identification data</strong></p>\n<p>Where a data element is not known for the person or cannot otherwise be issued as part of the person identification dataset, Member States shall use an attribute value appropriate to the situation instead.</p>\n<p>**3.<strong>Set of metadata about person identification data</strong></p>\n<p>**4.<strong>Encoding of person identification data attributes</strong></p>\n<p>Person identification data shall be issued in two formats:</p>\n<ul>\n<li>(1) the format specified in ISO/IEC 18013-5:2021;</li>\n<li>(2) 'Verifiable Credentials Data Model 1.1.', W3C Recommendation, 3 March 2022.</li>\n</ul>\n<p>**5.<strong>Trust infrastructure details</strong></p>\n<p>The list of providers of person identification data made available by the Commission in accordance with Implementing Regulation (EU) 2024/2980 laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council as regards notifications to the Commission concerning the European Digital Identity Wallet ecosystem as regards notifications shall enable authentication of person identification data.</p>",
  "wordCount": 2850,
  "lastProcessed": "2026-01-17T19:09:30.649Z",
  "preambleInjected": false
}