{
  "slug": "2024-2981",
  "type": "implementing-act",
  "legalType": "regulation",
  "category": "implementing_act",
  "title": "Commission Implementing Regulation (EU) 2024/2981 of 28 November 2024 laying down rules for the application of Regulation (EU) No 910/2014 of the European Parliament and the Council as regards the certification of European Digital Identity Wallets",
  "shortTitle": "Certification",
  "description": "THE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC \\[OJ L 257, 28.",
  "celex": "32024R2981",
  "date": "28 November 2024",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32024R2981",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "article-7",
      "title": "Article 7",
      "level": 3
    },
    {
      "id": "article-8",
      "title": "Article 8",
      "level": 3
    },
    {
      "id": "article-9",
      "title": "Article 9",
      "level": 3
    },
    {
      "id": "article-10",
      "title": "Article 10",
      "level": 3
    },
    {
      "id": "article-11",
      "title": "Article 11",
      "level": 3
    },
    {
      "id": "article-12",
      "title": "Article 12",
      "level": 3
    },
    {
      "id": "article-13",
      "title": "Article 13",
      "level": 3
    },
    {
      "id": "article-14",
      "title": "Article 14",
      "level": 3
    },
    {
      "id": "article-15",
      "title": "Article 15",
      "level": 3
    },
    {
      "id": "article-16",
      "title": "Article 16",
      "level": 3
    },
    {
      "id": "article-17",
      "title": "Article 17",
      "level": 3
    },
    {
      "id": "article-18",
      "title": "Article 18",
      "level": 3
    },
    {
      "id": "article-19",
      "title": "Article 19",
      "level": 3
    },
    {
      "id": "article-20",
      "title": "Article 20",
      "level": 3
    },
    {
      "id": "article-21",
      "title": "Article 21",
      "level": 3
    },
    {
      "id": "article-22",
      "title": "Article 22",
      "level": 3
    },
    {
      "id": "annex-i",
      "title": "ANNEX I",
      "level": 2
    },
    {
      "id": "annex-ii",
      "title": "ANNEX II",
      "level": 2
    },
    {
      "id": "annex-iii",
      "title": "ANNEX III",
      "level": 2
    },
    {
      "id": "annex-iv",
      "title": "ANNEX IV",
      "level": 2
    },
    {
      "id": "annex-v",
      "title": "ANNEX V",
      "level": 2
    },
    {
      "id": "annex-vi",
      "title": "ANNEX VI",
      "level": 2
    },
    {
      "id": "annex-vii",
      "title": "ANNEX VII",
      "level": 2
    },
    {
      "id": "annex-viii",
      "title": "ANNEX VIII",
      "level": 2
    },
    {
      "id": "annex-ix",
      "title": "ANNEX IX",
      "level": 2
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"15\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> \\[OJ L 257, 28.8.2014, p. 73, ELI: http://data.europa.eu/eli/reg/2014/910/oj.\\], and in particular Article 5c(6) thereof,*\n\n## Recitals\n\n- (1) Pursuant to Article 5c of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, the certification of European Digital Identity Wallets ('wallets') is to be made in accordance with functional, cybersecurity, and data protection requirements to ensure a high level of security and trust in the wallets. Those certification requirements need to be harmonised across Member States in order to prevent market fragmentation and to build a robust framework.\n\n- (2) <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to the personal data processing activities under this Regulation.\n\n- (3) The Commission regularly assesses new technologies, practices, standards or technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Regulation rely on the work carried out on the basis of Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework \\[OJ L 210, 14.6.2021, p. 51, ELI: http://data.europa.eu/eli/reco/2021/946/oj.\\] and in particular the Architecture and Reference Framework which is part of it. In accordance with recital 75 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, the Commission should review and update this Implementing Regulation, if necessary, to keep it in line with global developments, the Architecture and Reference Framework and to follow the best practices on the internal market.\n\n- (4) In order to attest conformity to cybersecurity requirements included in the certification framework, the certification of wallet solutions should refer to, where available and relevant, European cybersecurity certification schemes established pursuant to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Regulation 2019/881</span>. In the absence of such schemes, or when they partially cover cybersecurity requirements, this Regulation sets out the general requirements applying to national certification schemes, covering functional, cybersecurity, and data protection requirements.\n\n- (5) Pursuant to Article 5a(11) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, the wallets are to be certified against assurance level high as set out in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, as well as <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2015/1502\" data-celex=\"32015R1502\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2015/1502/oj\">Regulation 2015/1502</span>. That assurance level has to be reached by the overall wallet solution. Under this Regulation, some components of the wallet solution may be certified at a lower assurance level, provided this is duly justified and without prejudice to the assurance level high reached by the overall solution.\n\n- (6) All national certification schemes should assign a scheme owner who will be responsible for the development and maintenance of the certification scheme. The scheme owner may be a conformity assessment body, a governmental body or authority, a trade association, a group of conformity assessment bodies, or any appropriate body and can be different than the body operating the national certification scheme.\n\n- (7) The object of certification should include the software components of the wallet solution, such as the wallet instance. The wallet secure cryptographic application ('WSCA'), the wallet secure cryptographic device ('WSCD') and the platforms on which these software components are executed, while being part of the operating environment, should only be included in the object of certification when they are provided by the wallet solution. In other cases, and in particular when these devices and platforms are provided by end users, providers should establish assumptions on the wallet solution’s operating environment, including on these devices and platforms, and implement measures to confirm that these assumptions are verified in practice. In order to ensure protection of critical assets through hardware and system software used to manage and protect cryptographic keys created, stored or processed by the WSCD, the WSCD needs to satisfy high standards of certification as reflected in international standards such as Common Criteria ('EUCC'), established in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/482\" data-celex=\"32024R0482\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2024/482/oj\">Regulation 2024/482</span>, by EAL4 evaluation and advanced methodical vulnerability analysis, such as comparable to AVA_VAN.5. These certification standards should be used at the latest when certification of the conformity of wallets is carried out following a European cybersecurity certification scheme adopted pursuant to Regulation (EU) 2019/881.\n\n- (8) Fully mobile, secure and user-friendly wallets are supported by the availability of standardised and certified tamper-resistant solutions, such as embedded secure elements, external devices such as smartcards, or embedded SIM platforms in mobile devices. It is important to ensure the timely access to embedded secure elements for national eID means and wallets and to coordinate efforts by Member States in this area. The European Digital Identity Cooperation Group established pursuant to Article 46e(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> ('Cooperation Group'), should therefore establish a dedicated subgroup for this purpose. Consulting relevant stakeholders, this subgroup should agree on a joint roadmap for access to embedded secure elements to be considered by the Commission for the review report on the <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. In order to facilitate the uptake of the wallet at national level, the Commission should furthermore, in cooperation with Member States, develop and continuously update a manual for use cases as part of the Architecture and Reference Framework.\n\n- (9) The object of certification of national certification schemes should also include the processes that are used to provide and operate the wallet solution, even if the definition or execution of those processes are subcontracted to third parties. In order to demonstrate that the processes satisfy the schemes’ requirements, assurance information is allowed to be used as evidence, provided that a dependency analysis is used to determine if the assurance information is sufficient. Assurance information comes in many different forms, including reports and certificates of conformity, which can be private, national, European or international, based on standards or on technical specifications. The objective of the dependency analysis is to assess the quality of the assurance information available about a wallet’s components.\n\n- (10) Following procedures established for this purpose, the Cooperation Group should be able to provide opinions and recommendations on the draft national certification schemes submitted to it. These national certification schemes should be specific to the wallet architecture and there should be specific profiles for each specific architecture supported.\n\n- (11) In order to ensure a common understanding of, and harmonised approach to, the assessment of the most critical risks that might affect the provision and operation of wallets, a register of risks and threats that should be taken into consideration when designing wallet solutions independently of their specific architecture should be drawn-up. The cybersecurity objectives described in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, such as confidentiality, integrity and availability of the wallet solution, as well as user and data privacy, should be borne in mind when identifying which risks should be included in the register. Due consideration of risks and threats included in this risk register should be part of the requirements of national certification schemes. To keep in line with the continuously evolving threat landscape, the risk register should be maintained and regularly updated in collaboration with the Cooperation Group.\n\n- (12) When establishing their certification schemes, scheme owners should perform a risk assessment to refine and complement the risks and threats listed in the register with risks and threats specific to the architecture or implementation of the wallet solution. The risk assessment should consider how the applicable risks and threats can be appropriately treated. Wallet providers should complement the scheme’s risk assessment to identify any risks and threats specific to their implementation and propose appropriate treatment measures for evaluation by the certification body.\n\n- (13) To demonstrate that a wallet solution architecture meets the applicable security requirements, each architecture-specific scheme or profile should contain at least a description of the wallet solution architecture, a list of security requirements applicable to the wallet solution architecture, an evaluation plan to confirm that a wallet solution based on this architecture meets those requirements and a risk assessment. National certification schemes should require wallet providers to demonstrate how the design of the wallet solution that they provide matches the reference architecture and details the security controls and validation plans for the specific wallet solution. National certification schemes should also define a conformity assessment activity to verify that the wallet design properly reflects the selected profile’s reference architecture. National certification schemes should comply with the requirements set out in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"30\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 51 of Regulation (EU) 2019/881</span>, except for its points (e) and (f), related to logging.\n\n- (14) Concerning the certification of products, certificates of conformity issued under the EU cybersecurity certification scheme on EUCC, and certificates of conformity issued under national certification schemes in the context of the SOG-IS Mutual Recognition Agreement, should be allowed to be used. Furthermore, other national certification schemes should be allowed to be used for less sensitive product components, such as those established following the standard CEN EN 17640 for fixed time cybersecurity evaluation methodology.\n\n- (15) The EU Digital Identity Wallet Trust Mark ('Trust Mark') should be used to indicate in a clear, simple and recognisable manner that a wallet has been provided in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. Therefore, it should be considered as a mark of conformity for a wallet solution certified under national certification schemes. National certification schemes should not define any other marks of conformity.\n\n- (16) In order to discourage fraud, national certification schemes should define actions to be taken where certification under the scheme is being claimed fraudulently.\n\n- (17) To ensure an efficient management of vulnerability notifications, providers of wallet solutions and the electronic identification scheme under which they are provided should define and implement processes to evaluate the severity and potential impact of vulnerabilities. National certification schemes should set a threshold over which the certification body is to be notified. Such notification requirement should not affect the criteria established by data protection legislation and Member States’ data protection authorities for notification on personal data breaches. Possible synergies could be established between the mandatory notification of breach or compromise of the wallet solutions and the notification of personal data breaches pursuant to Regulation (EU) 2016/679. The certification body’s assessment of a vulnerability impact analysis report should be without prejudice to a data protection authority’s assessment of a data protection impact assessment pursuant to Articles 35 and 36 of Regulation (EU) 2016/679.\n\n- (18) The providers of wallet solutions and the electronic identification scheme under which they are provided should notify the scheme owner of any justifications for exceptions to the vulnerability assessment required for the evaluation of the WSCD and WSCA, as set out in Annex IV.\n\n- (19) The cancellation of a certificate of conformity might have severe consequences such as the revocation of all deployed wallet units. Therefore, certification bodies should only consider cancellation if an unremedied vulnerability is likely to significantly affect the reliability of the wallet solution or the reliability of another wallet solution.\n\n- (20) A specific process for the update of national certification schemes should be put in place to manage the transition between successive releases of the schemes, in particular in relation to actions to be taken by the certificate holder regarding upcoming evaluations, maintenance, recertification and special evaluations.\n\n- (21) To facilitate transparency, wallet providers should publicly share security information about their wallet solution.\n\n- (22) Where national certification schemes rely on assurance information from other certification schemes or sources, a dependency analysis should be carried out to verify that the assurance documentation, for instance assurance reports and certificates of conformity, is available and adequate for the wallet solutions and the electronic identification scheme under which they are provided. The basis for this dependency analysis should be the risk assessment of the wallet solutions and the electronic identification scheme under which they are provided. The evaluation should determine whether the assurance documentation available for a given wallet solution and the electronic identification scheme under which it is provided is adequate to provide assurance corresponding to the targeted evaluation level. The evaluation should also update the dependency analysis, or entirely re-evaluate it, where necessary.\n\n- (23) Certification bodies should issue certificates of conformity in national certification schemes, together with a publicly available certification report, as referred to in Article 5d(2), point (a), of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. The associated certification assessment report should be made available to the Cooperation Group.\n\n- (24) National certification schemes should set out yearly surveillance evaluation to ensure that the processes around the management and maintenance of the wallets are operating effectively, meaning that they operate as defined in the policies determining the processes. The biennial vulnerability assessment is a requirement stemming from <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, to ensure that the wallet solution continues to cover appropriately the cybersecurity risks and threats identified in the risk register, including any evolution of the threat landscape. The notions of surveillance evaluations, recertification evaluations and special evaluations should be in accordance with EN ISO/IEC 17021-1:2015.\n\n- (25) A certification cycle ends with the expiry of the certificate of conformity, or with the issuance of a new certificate of conformity following a successful recertification evaluation. The recertification evaluation should include an evaluation of all components of the object of certification, including an evaluation of the effectiveness and, where applicable, a vulnerability assessment. During recertification, it should be possible to reuse results from previous evaluations on components that have not changed.\n\n- (26) When a European cybersecurity certification scheme is adopted, national certification schemes with the same scope should cease issuing certifications after a defined transition period as referred to in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"31\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 57(1) of Regulation (EU) 2019/881</span>.\n\n- (27) National certification schemes should rely on existing frameworks and reuse evidence as appropriate in order to ensure harmonisation and interoperability. Member States may conclude agreements for the cross-border reuse of certification schemes or parts thereof. The European Commission and ENISA should, in cooperation with the Cooperation Group, support Member States in the development and maintenance of their national certification schemes ensuring knowledge-sharing and best practices.\n\n- (28) The European Data Protection Supervisor was consulted in accordance with Article 42(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span>, and delivered its opinion on 30 September 2024.\n\n- (29) The measures provided for in this Regulation are in accordance with the opinion of the Committee referred to in Article 48(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>,\n\n**HAS ADOPTED THIS REGULATION:**\n\n## Enacting Terms\n\n### Article 1\n**Subject matter and scope**\n\nThis Regulation sets out reference standards and establishes specifications and procedures to build a robust framework for the certification of wallets to be updated on a regular basis to keep in line with technology and standards developments and with the work carried out on the basis of Recommendation (EU) 2021/946 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework, and in particular the Architecture and Reference Framework.\n\n### Article 2\n**Definitions**\n\nFor the purpose of this Regulation, the following definitions apply:\n\n- (1) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;\n- (2) 'scheme owner' means an organisation which is responsible for developing and maintaining a certification scheme;\n- (3) 'object of certification' means products, processes and services or a combination thereof to which specified requirements apply;\n- (4) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;\n- (5) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;\n- (6) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;\n- (7) 'risk register' means a record of information relevant to the certification process about identified risks;\n- (8) 'wallet provider' means a natural or legal person who provides wallet solutions;\n- (9) 'certification body' means a third-party conformity assessment body operating certification schemes;\n- (10) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;\n- (11) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;\n- (12) 'wallet user' means a user who is in control of the wallet unit;\n- (13) 'incident' means an incident as defined in point (6) of Article 6 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"8\" data-short=\"Directive 2022/2555\" data-celex=\"32022L2555\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2022/2555/oj\">Directive 2022/2555</span>;\n- (14) 'embedded disclosure policy' means a set of rules, embedded in an electronic attestation of attributes by its provider, that indicates the conditions that a wallet-relying party has to meet to access the electronic attestation of attributes.\n\n### Article 3\n**Establishment of national certification schemes**\n\n1. Member States shall assign a scheme owner for each national certification scheme.\n\n2. The object of certification defined in national certification schemes shall be the provision and operation of wallet solutions and of the electronic identification schemes under which they are provided.\n\n3. In accordance with Implementing Regulation (EU) 2015/1502, the object of certification in national certification schemes shall include the following elements:\n   - (a) the software components, including settings and configurations of a wallet solution and of the electronic identification scheme under which the wallet solutions are provided;\n   - (b) the hardware components and platforms on which the software components referred to in point (b) run on or rely upon for critical operations, in cases where they are provided directly or indirectly by the wallet solution and electronic identification scheme under which they are provided and when they are required to meet the desired level of assurance for those software components. When the hardware components and platforms are not provided by the wallet provider, national certification schemes shall formulate assumptions for evaluation of the hardware components and platforms, under which resistance against attackers with high attack potential in line with Implementing Regulation (EU) 2015/1502 can be provided, and specify the evaluation activities to confirm these assumptions as referred in Annex IV;\n   - (c) the processes that support the provision and operation of a wallet solution, including the user onboarding process as referred to in Article 5a of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, covering at least enrolment, electronic means management and organisation pursuant to section 2.1, 2.2, and 2.4 of Annex I to Implementing Regulation (EU) 2015/1502.\n\n4. National certification schemes shall include a description of the specific architecture of the wallet solutions and of the electronic identification scheme under which they are provided. When national certification schemes cover more than one specific architecture, they shall include a profile for each specific architecture.\n\n5. For each profile, national certification schemes shall set out at least the following:\n   - (a) the specific architecture of a wallet solution and of the electronic identification scheme under which they are provided;\n   - (b) the security controls associated to assurance levels set out in Article 8 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>;\n   - (c) an evaluation plan drawn-up in accordance with section 7.4.1 of EN ISO/IEC 17065;2012;\n   - (d) the security requirements necessary to address the cybersecurity risks and threats listed in the risk register set out in Annex I of this Regulation, up to the required assurance level, and to meet, where applicable, the objectives defined in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"30\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 51 of Regulation (EU) 2019/881</span>;\n   - (e) a mapping of the controls referred to in point (b) of this paragraph to the components of the architecture;\n   - (f) a description of how the security controls, the mapping, the security requirements and the evaluation plan referred to in points (b) to (c) allow providers of wallet solutions and the electronic identification scheme under which they are provided to adequately address the cybersecurity risks and threats identified in the risk register referred to in point (d), up to the required assurance level based on a risk assessment to refine and complement the risks and threats listed in the risk register with risks and threats specific to the architecture.\n\n6. The evaluation plan referred to in paragraph 5, point (c) shall list evaluation activities to be included in the evaluation of wallet solutions and of the electronic identification scheme under which they are provided.\n\n7. The evaluation activity referred to in paragraph 6 shall require providers of wallet solutions and the electronic identification scheme under which they are provided to provide information meeting the requirements listed in Annex II.\n\n### Article 4\n**General requirements**\n\n1. National certification schemes shall cover functional, cybersecurity and data protection requirements by using, when available and applicable, the following certification schemes:\n   - (a) European cybersecurity certification schemes established pursuant to Regulation (EU) 2019/881, including the EUCC;\n   - (b) national cybersecurity certification schemes covered by the EUCC, in accordance with Article 49 of Implementing Regulation (EU) 2024/482.\n\n2. National certification schemes may, in addition, when available and applicable, refer to:\n   - (a) other relevant national certification schemes;\n   - (b) international, European, and national standards;\n   - (c) technical specifications that meet the requirements set out in Annex II to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"9\" data-short=\"Regulation 1025/2012\" data-celex=\"32012R1025\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2012/1025/oj\">Regulation 1025/2012</span>.\n\n3. National certification schemes shall:\n   - (a) specify the elements listed in section 6.5 of EN ISO/IEC 17067:2013;\n   - (b) be implemented as a type 6 scheme, in accordance with section 5.3.8 of EN ISO/IEC 17067:2013.\n\n4. National certification schemes shall comply with the following requirements:\n   - (a) only providers referred to in Article 5a(2) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> are eligible to be issued certificates under the national certification schemes;\n   - (b) only the Trust Mark is used as mark of conformity;\n   - (c) providers of wallet solutions and the electronic identification scheme under which they are provided include references to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> and this Regulation when referring to the scheme;\n   - (d) providers of wallet solutions and the electronic identification scheme under which they are provided, complement the scheme’s risk assessment as referred to in Article 3, paragraph 5 point (f), to identify risks and threats specific to their implementation and propose appropriate treatment measures for all relevant risks and threats;\n   - (e) responsibilities and the legal action are established and include references to the applicable national legislation, which defines the responsibilities and possible legal action, where certification under the scheme is being used fraudulently.\n\n5. The assessment referred to in paragraph 4, point (d) shall be shared with the certification body for evaluation.\n\n### Article 5\n**Incident and vulnerability management**\n\n1. National certification schemes shall contain incident and vulnerability management requirements in accordance with paragraphs 2 to 9.\n\n2. The holder of a certificate of conformity of a wallet solution and of the electronic identification scheme under which it is provided shall notify their certification body without undue delay of any breach or compromise of the wallet solution, or of the electronic identification scheme under which it is provided, that is likely to impact its conformity with the requirements of the national certification schemes’ requirements.\n\n3. The holder of a certificate of conformity shall establish, maintain and operate a vulnerability management policy and procedures, taking into account the procedures set out in existing European and international standards, including EN ISO/IEC 30111:2019.\n\n4. The holder of the certificate of conformity shall notify the issuing certification body of the vulnerabilities and changes affecting the wallet solution, based on defined criteria on the impact of these vulnerabilities and changes.\n\n5. The holder of the certificate of conformity shall prepare a vulnerability impact analysis report for any vulnerability that affects the software components of the wallet solution. The report shall include the following information:\n   - (a) the impact of the vulnerability on the certified wallet solution;\n   - (b) possible risks associated with the proximity or likelihood of an attack;\n   - (c) whether the vulnerability can be remedied using available means;\n   - (d) where the vulnerability can be remedied using available means, possible ways to remedy the vulnerability.\n\n6. Where notification is required in paragraph 4, the holder of the certificate of conformity shall transmit, without undue delay, the vulnerability impact analysis report referred to in paragraph 5 to the certification body.\n\n7. The holder of a certificate of conformity shall establish, maintain and operate a vulnerability management policy meeting the requirements set out in Annex I to the Cyber Resilience Act <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"10\" data-short=\"Regulation 2024/2847\" data-celex=\"32024R2847\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2024/2847/oj\">Regulation 2024/2847</span>.\n\n8. National certification schemes shall establish vulnerability disclosure requirements applicable to certification bodies.\n\n9. The holder of a certificate of conformity shall disclose and register any publicly known and remediated vulnerability in the wallet solution or in one of the online repositories referred to in Annex V.\n\n### Article 6\n**Maintenance of national certification schemes**\n\n1. National certification schemes shall contain a process for reviewing their operation on a periodic basis. That process shall aim at confirming their adequacy and at identifying aspects requiring improvement, taking into account feedback from stakeholders.\n\n2. National certification schemes shall include provisions concerning their maintenance. This process shall include at least the following requirements:\n   - (a) rules for the governance of the national certification schemes’ definition and requirements;\n   - (b) the establishment of timelines for the issuance of certificates following the adoption of updated versions of the national certification schemes, both for new certificates of conformity and for previously issued ones;\n   - (c) a periodic review of the national certification schemes, to ensure that the national certification schemes’ requirements are being applied in a consistent manner, taking into account at least the following aspects:\n        - requests for clarification addressed to the scheme owner related to the national certification scheme requirements;\n        - feedback from stakeholders and other interested parties;\n        - responsiveness of the national certification scheme owner to requests of information.\n   - (d) rules for monitoring reference documents and procedures for the evolution of national certification schemes’ reference versions, including at least transition periods;\n   - (e) a process to ensure the latest cybersecurity risks and threats as listed in the risk register set out in Annex I of this Regulation are covered;\n   - (f) a process for managing other changes in national certification schemes.\n\n3. National certification schemes shall contain requirements for performing evaluations on currently certified products within a certain period after the revision of the scheme, or after the release of new specifications or standards, or new versions thereof, with which the wallet solutions and the electronic identification scheme under which they are provided shall comply.\n\n### Article 7\n**General requirements**\n\n1. Scheme owners shall develop and maintain national certification schemes and govern their operations.\n\n2. Scheme owners may subcontract all or part of their tasks to a third party. When subcontracting to a private party, scheme owners shall set out the duties and responsibilities of all parties by contract. Scheme owners shall remain responsible for all subcontracted activities performed by their subcontractors.\n\n3. Scheme owners shall perform their monitoring activities, if applicable, at least on the basis of the following information:\n   - (a) information coming from certification bodies, national accreditation bodies, and relevant market surveillance authorities;\n   - (b) information resulting from its own or another authority’s audits and investigations;\n   - (c) complaints and appeals received pursuant to Article 15.\n\n4. Scheme owners shall inform the Cooperation Group of revisions to the national certification schemes. That notification shall provide adequate information for the Cooperation Group to issue recommendations to scheme owners and opinions about the updated national certification schemes.\n\n### Article 8\n**General requirements**\n\n1. National certification schemes shall contain cybersecurity requirements based on a risk assessment of each specific supported architecture. Those cybersecurity requirements shall aim to treat the identified cybersecurity risks and threats, as established in the risk register set out in Annex I.\n\n2. In line with Article 5a(23) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, national certification schemes shall require wallet solutions, and the electronic identification schemes under which they are provided, to be resistant against attackers with high attack potential for assurance level high, as referred to Implementing Regulation (EU) 2015/1502.\n\n3. National certification schemes shall establish security criteria, which shall include the following requirements:\n   - (a) Cyber Resilience Act where applicable, or requirements meeting the security objectives set out in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"30\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 51 of Regulation (EU) 2019/881</span>;\n   - (b) the establishment and implementation of policies and procedures concerning the management of risks associated with the operation of a wallet solution, including the identification and assessment of risks and the mitigation of the identified risks;\n   - (c) the establishment and implementation of policies and procedures related to the management of changes and to the management of vulnerabilities in accordance with Article 5 of this Regulation;\n   - (d) the establishment and implementation of human resource management policies and procedures, including requirements on expertise, reliability, experience, security training, and qualifications of personnel involved in the development or operation of the wallet solution;\n   - (e) requirements relating to the wallet solution’s operating environment, including in the form of assumptions on the security of the devices and platforms on which the software components of the wallet solution run, including WSCDs and where applicable and relevant, conformity assessment requirements to confirm that those assumptions are verified on the relevant devices and platforms;\n   - (f) for each assumption that is not backed by a certificate of conformity or other acceptable assurance information, a description of the mechanism that the wallet provider uses to enforce the assumption, as well as a justification that the mechanism is sufficient to ensure that the assumption is verified;\n   - (g) the establishment and implementation of measures to ensure the use of a currently certified version of the wallet solution.\n\n4. National certification schemes shall contain functional requirements relating to update mechanisms for every software component of the wallet solutions and the electronic identification scheme under which they are provided for the operations listed in Annex III.\n\n5. National certification schemes shall require that the following information and documentation is provided or otherwise made available to the certification body by the applicant for certification:\n   - (a) evidence related to the information referred to in Annex IV, point 1, including where necessary details on the wallet solution and its source code, including:\n        - *architecture information:* for every component of the wallet solution (including product, process and service components), a description of its essential security properties, including its external dependencies;\n        - *controls and assurance levels:* for every security control of the wallet solution, a description of the control and the required assurance level, based on the Annex to Implementing Regulation (EU) 2015/1502, which sets out a number of technical specifications and procedures that apply to the various controls implemented by the electronic identification means;\n        - *mapping the controls to architecture components:* a description of how the controls of the wallet are implemented using the different components of the wallet solution, based on a rationale explaining why a given assurance level is required, and how the control is implemented with all required security aspects at the appropriate level;\n        - *rationale and justification of risk coverage:* a justification of:\n   - (b) the information listed in Annex V;\n   - (c) a complete list of the certificates of conformity and other assurance information used as evidence during the evaluation activities;\n   - (d) any other information relevant for the evaluation activities.\n\n### Article 9\n**General requirements**\n\n1. Certification bodies shall be accredited by national accreditation bodies appointed pursuant to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation 765/2008\" data-celex=\"32008R0765\" data-internal=\"true\" data-url=\"#/regulation/765-2008\">Regulation 765/2008</span> in accordance with EN ISO/IEC 17065:2012, provided that they comply with the requirements set out in national certification schemes in accordance with paragraph 2.\n\n2. For the purposes of accreditation, certification bodies shall comply with all the following competence requirements:\n   - (a) detailed and technical knowledge of the relevant architectures of a wallet solution and of the electronic identification scheme under which they are provided, as well as of the threats and risks relevant to those architectures;\n   - (b) knowledge of available security solutions and of their properties pursuant to the Annex of Implementing Regulation (EU) 2015/1502;\n   - (c) knowledge of the activities performed in virtue of certificates of conformity applied to components of the wallet solution and the electronic identification scheme under which they are provided, as being the object of certification;\n   - (d) detailed knowledge of the applicable national certification scheme as established in accordance with Chapter II.\n\n3. Certification bodies shall perform their surveillance activities in particular on the basis of the following information:\n   - (a) information coming from national accreditation bodies, and relevant market surveillance authorities;\n   - (b) information resulting from their own or another authority’s audits and investigations;\n   - (c) complaints and appeals received pursuant to Article 15.\n\n### Article 10\n**Subcontracting**\n\nCertification bodies may subcontract the evaluation activities, as set out in Article 13, to third parties. Where evaluation activities are subcontracted, national certification schemes shall establish the following:\n\n- (1) all subcontractors of the certification body performing evaluation activities shall, as applicable and appropriate for the activities to be performed, meet the requirements of harmonised standards like EN ISO/IEC 17025:2017 for testing, EN ISO/IEC 17020:2012 for inspection, EN ISO/IEC 17021-1:2015 for audit, and EN ISO/IEC 17029:2019 for validation and verification;\n- (2) certification bodies shall take responsibility for all evaluation activities outsourced to other bodies and demonstrate that they have taken appropriate measures during their accreditation, including by relying on their subcontractors’ own accreditation, when applicable;\n- (3) the degree to which prior agreement to outsourcing needs shall be obtained from scheme owners or the client whose wallet solution is being certified under the certification scheme.\n\n### Article 11\n**Notification to the supervisory body**\n\nCertification bodies shall notify the supervisory body referred to in Article 46a(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation 2024/2979\" data-celex=\"32024R2979\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2979\">Regulation 2024/2979</span> laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"13\" data-short=\"Regulation 2024/2982\" data-celex=\"32024R2982\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2982\">Regulation 2024/2982</span> laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"14\" data-short=\"Regulation 2024/2977\" data-celex=\"32024R2977\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2977\">Regulation 2024/2977</span> laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council as regards person identification data and electronic attestations of attributes issued to European Digital Identity Wallets.\n\n\n## ANNEX IV\n\n**1.**Audit of the implementation of a wallet solution**\n\nA conformity assessment activity shall consist of selecting specific evaluation activities.\n\nNational certification schemes shall specify an evaluation activity to assess the information provided, covering at least the following:\n\nThe analysis mentioned in points (a) to (b) shall rely on the rationale and justification provided by the wallet provider.\n\n- (a) an analysis of the information provided to confirm that it is suited for one of the architectures specified in national certification schemes;\n- (b) an analysis of the coverage of the cybersecurity risks and threats identified in the risk register of Annex I by the described security controls.\n\n**2.**Evaluation activities related to the wallet secure cryptographic device**\n\n- (1) Critical operations, including cryptographic computations, are not required to be fully implemented in the WSCD. However, the part implemented in the WSCD, when operating as part of the wallet solution, shall guarantee the protection of the critical operations it performs against attacks by attackers with high attack potential in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2015/1502\" data-celex=\"32015R1502\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2015/1502/oj\">Regulation 2015/1502</span>.\n- (2) The WSCD or part thereof may be within the object of certification when it is provided by the certificate holder or applicant, or outside of its scope when it is embedded in a device provided by the end user. In addition, national certification schemes shall specify the evaluation activities to verify the suitability of the WSCD, in the two following cases:\n   - (a) if the WSCA depends on the particular WSCD (i.e. if it needs to be evaluated as a composite product based on the WSCD) then the evaluation of the WSCA shall require access to additional information related to the WSCD’s certification, including, in particular, its evaluation technical report;\n   - (b) if an architecture considered in the scheme uses several WSCDs, or if some of the operations on critical assets are performed outside of the WSCD, then national certification schemes shall include evaluation activities to ensure that the overall solution offers the expected level of security.\n- (3) As a prerequisite to the certification under national certification schemes, the WSCD shall be assessed against the requirements of assurance level high as set out in Implementing Regulation (EU) 2015/1502.\n- (4) In addition, in the documentation related to each specific architecture, national certification schemes shall formulate assumptions for this evaluation of the WSCD under which resistance against attackers with high attack potential in accordance with Implementing Regulation (EU) 2015/1502 can be provided and specify the evaluation activities to confirm these assumptions and to confirm after issuance of the certificate that the assumptions are still verified. The national schemes shall also require the candidates to certification to refine these assumptions for their specific implementation, and to describe the measures in place to guarantee that the assumptions are verified throughout the certification lifecycle.\n- (5) In all cases, national certification schemes shall include an evaluation activity to verify that the assurance information available for the WSCD is suitable for the purpose of the wallet solution, through an analysis of the assurance information, such as the security target for EUCC certificates, including the following activities:\n   - (a) verifying that the scope of the evaluation is suitable, which for EUCC certificates, for instance, means verifying that the security target claims conformity to one of the protection profiles recommended in the EUCC;\n   - (b) verifying that the assumptions on the operating environment are compatible with the wallet solution, which for EUCC certificates, for instance, means that these assumptions can be found in the security target;\n   - (c) verifying that the recommendations in the user guidance or documentation are compatible with the conditions on which the WSCD is to be used in the wallet solution;\n   - (d) verifying that the assumptions made in the national certification scheme about WSCDs are verified and covered in the assurance information.\n- (6) In cases where some of the verifications are not fully conclusive, national certification schemes shall require certification bodies to specify compensating requirements for the wallet secure cryptographic application (WSCA) based on the WSCD, to be included in the evaluation of the WSCA. If this is not possible, national certification schemes shall deem the WSCD unsuitable, meaning that the wallet solution shall not be issued a certificate of conformity.\n\n**3.**Evaluation activities related to the wallet secure cryptographic application (WSCA)**\n\n- (1) National certification schemes shall require that a WSCA, as part of a wallet solution, is evaluated against the requirements of at least assurance level high as set out in Implementing Regulation (EU) 2015/1502.\n- (2) This evaluation shall include a vulnerability assessment, as set out in EN ISO/IEC 15408-3:2022 at level AVA_VAN.5, as set out in Annex I of Implementing Regulation (EU) 2024/482, unless it is duly justified to the certification body that the security characteristics of the WSCA make it possible to use a lower assessment level while keeping the same overall assurance level high as set out in Implementing Regulation (EU) 2015/1502.\n- (3) When the WSCA is not provided by the wallet provider, national certification schemes shall formulate assumptions for this evaluation of the WSCA under which resistance against attackers with high attack potential in accordance with Implementing Regulation (EU) 2015/1502 can be provided and specify the evaluation activities to confirm these assumptions and to confirm after issuance of the certificate that the assumptions are still verified. The national schemes shall also require the candidates to certification to refine these assumptions for their specific implementation, and to describe the measures in place to guarantee that the assumptions are verified throughout the certification lifecycle.\n- (4) In all cases, national certification schemes shall include an evaluation activity to verify that the assurance information available for the WSCA is suitable for the purpose of the wallet solution, through an analysis of the assurance information, such as the security target for EUCC certificates, including the following activities:\n   - (a) verifying that the scope of the evaluation is suitable, which for EUCC certificates, for instance, means verifying that the security target claims conformity to one of the protection profiles recommended in the EUCC;\n   - (b) verifying that the assumptions on the operating environment are compatible with the wallet solution, which for EUCC certificates, for instance, means that these assumptions can be found in the security target;\n   - (c) verifying that the recommendations in the user guidance or documentation are compatible with the conditions on which the WSCA is to be used in the wallet solution;\n   - (d) verifying that the assumptions made in the national certification scheme about WSCAs are verified and covered in the assurance information.\n- (5) National certification schemes shall require that the evaluation of the WSCA covers all security controls implemented by this WSCA.\n\n**4.**Evaluation activities related to the end user device**\n\nSince the risk register, as set out in Annex I of this Regulation, identifies risks that are directly linked to the security of the end user device, national certification schemes shall specify security requirements for end user devices. However, as these devices are provided by the end user and not by the wallet provider, these requirements shall be covered by assumptions.\n\nFor each assumption, the wallet solution shall include a mechanism to verify for every wallet unit that the underlying end user device satisfies the assumption. Such mechanisms shall be considered as security controls and covered by evaluation activities to demonstrate both their suitability and their effectiveness at the appropriate assurance level.\n\nTwo examples are set out below:\n\n- (a) an end user device may include a certified WSCD, which needs to be demonstrated. Typically, this would be done by using a cryptographic mechanism to verify the presence in the certified WSCD of a cryptographic secret that is only available in the certified WSCD. In this case, this cryptographic secret should be considered as a critical asset and be covered by the certification of the WSCD and/or of the WSCA;\n- (b) a typical requirement for end user devices would be that the devices must receive security updates. Since this requirement is related to the wallet instance, the mechanism used to verify the availability of security updates only needs to be covered by evaluation activities at an assurance level suitable for the wallet instance, especially as it is likely to be integrated into the wallet instance.\n\n**5.**Evaluation activities related to the wallet instance**\n\n- (1) The evaluation of the wallet instance shall consider the following two main challenges:\n   - (a) the wallet instance is likely to exist in a set of variants of the same base application, with each variant specialised for a specific category of end user devices;\n   - (b) the different variants of the wallet instance will likely need frequent updates in order to follow the development of the underlying security platform, for instance when vulnerabilities are identified that require changes to applications.\n- (2) The evaluation of the wallet instance shall take into consideration these specific challenges. One of the immediate consequences is that the Common Criteria framework may not be suitable in all cases. Therefore, alternative evaluation methodologies shall be considered where necessary. National certification schemes shall consider the use of the EN 17640:2018 methodology for the following:\n   - (a) as part of the scheme itself;\n   - (b) through national schemes based on the methodology;\n   - (c) through national schemes based on similar principles but created before the development of the EN 17640:2018 methodology.\n- (3) In addition, as there may be limited added value in performing a full dedicated evaluation of each variant, national certification schemes shall consider specifying criteria allowing sampling to be performed, in order to avoid repetition of identical evaluation activities and to focus on activities that are specific to a given variant. National certification schemes shall require all certification bodies to justify their use of sampling.\n- (4) National certification schemes shall include updates of the wallet instance in the overall change management process specified for the wallet solution. They shall also lay down rules on the procedures that shall be performed by the wallet provider for every update (e.g. analysing the impact of the changes on the security controls), and on the evaluation activities that shall be performed by the certification body on updates under specified conditions (e.g. assessing the operating effectiveness of a modified security control). The change management process is one of the processes whose operating effectiveness is required to be checked annually in accordance with Article 18(3).\n\n**6.**Evaluation activities related to the services and processes used for the provision and operation of the wallet solution**\n\n- (1) For the evaluation of services and processes that play a role in the provision and operation of the wallet solution and the electronic identification scheme under which they are provided, the evaluation team shall gather evidence by conducting evaluation activities that may include audit, inspection, verification and validation activities.\n- (2) The certification body shall confirm the sufficiency and appropriateness of the evidence to provide sufficient assurance that the services and processes meet the certification requirements, by confirming the following:\n   - (a) the accuracy of the information presented in the description of the processes and services;\n   - (b) the suitability of the design and the controls of the processes and services to meet the evaluation criteria;\n   - (c) the operating effectiveness of an implementation of these controls throughout a specified period before the evaluation.\n- (3) The accuracy of the description and the operating effectiveness of an implementation of controls may be considered as verification objectives, in the sense of ISO/IEC 17000:2020, of the corresponding claims by the wallet provider (i.e. confirmation of fairness of events that have already occurred or results that have already been obtained), whereas the suitability of the design and the controls of the services and processes to meet the evaluation criteria may be considered as a validation objective, in the sense of ISO/IEC 17000:2020, of the corresponding claim by the wallet provider (i.e. confirmation of plausibility regarding an intended future use or projected outcome).\n- (4) Considering that a wallet solution is not allowed to operate before being certified, operating effectiveness cannot be confirmed on the basis of the actual operation of the solution. Therefore, this shall be confirmed using evidence gathered during tests or pilots.\n- (5) National certification schemes may already exist for specific services and processes, for instance for the onboarding of users. The use of such schemes shall be considered by national certification schemes, if applicable.\n\n**7.**Evaluation activities related to the ICT services used for the provision and operation of the wallet solution**\n\n- (1) Some wallet architectures may rely on dedicated ICT services, including cloud services for the provision and operation of a wallet solution, and these services may host sensitive data as well as sensitive operations. In such a case, national certification schemes shall specify security requirements for these ICT services.\n- (2) Many certification schemes already exist for ICT services, cloud services, and other sources of assurance information, including those listed in Annex II. National certification schemes shall rely, when available and applicable, on those existing mechanisms, through one of the following mechanisms:\n   - (a) mandating the use of a specific scheme or of a selection of schemes, by specifying the conditions under which the ICT or cloud services is to be assessed using these schemes;\n   - (b) leaving the choice of the assessment to the wallet provider and use the dependency analysis activity to analyse the suitability of the assurance information obtained through these assessments.\n- (3) In both cases, national certification schemes shall specify additional evaluation activities as needed to analyse or supplement the information obtained through these schemes.\n\n\n## ANNEX V\n\n\n## ANNEX VI\n\n**1.**Assessing the availability of assurance documentation**\n\nEvaluators shall list the assurance documentation available for every relevant component of the wallet solution and the electronic identification scheme under which they are provided. Then, evaluators shall assess the overall relevance of each piece of assurance documentation for the dependency review.\n\nThe following aspects shall be considered in the analysis:\n\n- (1) about the assurance documentation itself:\n   - (a) the type of assurance documentation, with all required details,\n   - (b) the period covered or period of validity,\n   - (c) the applicable framework (e.g. existing standard);\n   - (d) whether the assurance documentation includes a mapping to the scheme’s requirements;\n- (2) about the assurance report issuer’s professional competence and impartiality:\n   - (a) name of the certification body and, if available, name of the lead evaluator;\n   - (b) evidence of the certification body’s and the evaluator’s competence (e.g. accreditation, personal certification, etc.);\n   - (c) evidence of the certification body’s and the evaluator’s impartiality (e.g. accreditation, etc.).\n\n**2.**Assessing assurance related to individual requirements**\n\nEvaluators shall verify that the assurance documentation available for the wallet solution and the electronic identification scheme under which they are provided is adequate to determine that the wallet solution meets the expectations relative to the certification scheme’s individual requirements.\n\nThis assessment shall be performed for every relevant component of the wallet solution and the electronic identification scheme under which they are provided, by formulating an assumption on the wallet solution’s security controls.\n\nFor each such assumption, the evaluation team shall determine whether or not the assurance provided in the available assurance documentation is adequate.\n\nThe determination that the assurance is adequate shall be based on the following:\n\n- (1) the required information is available, with the expected assurance level, in the assurance documentation;\n- (2) the information available in the assurance documentation does not cover the full scope of the requirement, but additional controls or compensating controls (i.e., internal controls that reduce the risk of existing or potential control weakness) implemented in the wallet solution or in the electronic identification scheme under which they are provided allow the evaluators to determine that the information is adequate;\n- (3) the information available in the assurance documentation does not offer the expected assurance level but the controls implemented to assess and monitor the wallet provider allow the evaluators to determine that the information is adequate;\n- (4) if the assurance documentation mentions nonconformities on the design or implementation of the controls used to meet an assumption, the remedial actions proposed and implemented by the wallet provider and reviewed by its evaluators shall be adequate to guarantee that the assumption is indeed met.\n\n\n## ANNEX VII\n\n\n## ANNEX VIII\n\n\n## ANNEX IX\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN COMMISSION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union,</em></p>\n<p><em>Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"15\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> [OJ L 257, 28.8.2014, p. 73, ELI: <a href=\"http://data.europa.eu/eli/reg/2014/910/oj.%5C\">http://data.europa.eu/eli/reg/2014/910/oj.\\</a>], and in particular Article 5c(6) thereof,</em></p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) Pursuant to Article 5c of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, the certification of European Digital Identity Wallets ('wallets') is to be made in accordance with functional, cybersecurity, and data protection requirements to ensure a high level of security and trust in the wallets. Those certification requirements need to be harmonised across Member States in order to prevent market fragmentation and to build a robust framework.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to the personal data processing activities under this Regulation.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) The Commission regularly assesses new technologies, practices, standards or technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Regulation rely on the work carried out on the basis of Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework [OJ L 210, 14.6.2021, p. 51, ELI: <a href=\"http://data.europa.eu/eli/reco/2021/946/oj.%5C\">http://data.europa.eu/eli/reco/2021/946/oj.\\</a>] and in particular the Architecture and Reference Framework which is part of it. In accordance with recital 75 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, the Commission should review and update this Implementing Regulation, if necessary, to keep it in line with global developments, the Architecture and Reference Framework and to follow the best practices on the internal market.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) In order to attest conformity to cybersecurity requirements included in the certification framework, the certification of wallet solutions should refer to, where available and relevant, European cybersecurity certification schemes established pursuant to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Regulation 2019/881</span>. In the absence of such schemes, or when they partially cover cybersecurity requirements, this Regulation sets out the general requirements applying to national certification schemes, covering functional, cybersecurity, and data protection requirements.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) Pursuant to Article 5a(11) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, the wallets are to be certified against assurance level high as set out in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, as well as <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2015/1502\" data-celex=\"32015R1502\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2015/1502/oj\">Regulation 2015/1502</span>. That assurance level has to be reached by the overall wallet solution. Under this Regulation, some components of the wallet solution may be certified at a lower assurance level, provided this is duly justified and without prejudice to the assurance level high reached by the overall solution.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) All national certification schemes should assign a scheme owner who will be responsible for the development and maintenance of the certification scheme. The scheme owner may be a conformity assessment body, a governmental body or authority, a trade association, a group of conformity assessment bodies, or any appropriate body and can be different than the body operating the national certification scheme.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) The object of certification should include the software components of the wallet solution, such as the wallet instance. The wallet secure cryptographic application ('WSCA'), the wallet secure cryptographic device ('WSCD') and the platforms on which these software components are executed, while being part of the operating environment, should only be included in the object of certification when they are provided by the wallet solution. In other cases, and in particular when these devices and platforms are provided by end users, providers should establish assumptions on the wallet solution’s operating environment, including on these devices and platforms, and implement measures to confirm that these assumptions are verified in practice. In order to ensure protection of critical assets through hardware and system software used to manage and protect cryptographic keys created, stored or processed by the WSCD, the WSCD needs to satisfy high standards of certification as reflected in international standards such as Common Criteria ('EUCC'), established in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/482\" data-celex=\"32024R0482\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2024/482/oj\">Regulation 2024/482</span>, by EAL4 evaluation and advanced methodical vulnerability analysis, such as comparable to AVA_VAN.5. These certification standards should be used at the latest when certification of the conformity of wallets is carried out following a European cybersecurity certification scheme adopted pursuant to Regulation (EU) 2019/881.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) Fully mobile, secure and user-friendly wallets are supported by the availability of standardised and certified tamper-resistant solutions, such as embedded secure elements, external devices such as smartcards, or embedded SIM platforms in mobile devices. It is important to ensure the timely access to embedded secure elements for national eID means and wallets and to coordinate efforts by Member States in this area. The European Digital Identity Cooperation Group established pursuant to Article 46e(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> ('Cooperation Group'), should therefore establish a dedicated subgroup for this purpose. Consulting relevant stakeholders, this subgroup should agree on a joint roadmap for access to embedded secure elements to be considered by the Commission for the review report on the <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. In order to facilitate the uptake of the wallet at national level, the Commission should furthermore, in cooperation with Member States, develop and continuously update a manual for use cases as part of the Architecture and Reference Framework.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) The object of certification of national certification schemes should also include the processes that are used to provide and operate the wallet solution, even if the definition or execution of those processes are subcontracted to third parties. In order to demonstrate that the processes satisfy the schemes’ requirements, assurance information is allowed to be used as evidence, provided that a dependency analysis is used to determine if the assurance information is sufficient. Assurance information comes in many different forms, including reports and certificates of conformity, which can be private, national, European or international, based on standards or on technical specifications. The objective of the dependency analysis is to assess the quality of the assurance information available about a wallet’s components.</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) Following procedures established for this purpose, the Cooperation Group should be able to provide opinions and recommendations on the draft national certification schemes submitted to it. These national certification schemes should be specific to the wallet architecture and there should be specific profiles for each specific architecture supported.</p>\n</li>\n<li id=\"recital-11\" data-recital=\"11\" class=\"linkable-recital\">\n<p>(11) In order to ensure a common understanding of, and harmonised approach to, the assessment of the most critical risks that might affect the provision and operation of wallets, a register of risks and threats that should be taken into consideration when designing wallet solutions independently of their specific architecture should be drawn-up. The cybersecurity objectives described in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, such as confidentiality, integrity and availability of the wallet solution, as well as user and data privacy, should be borne in mind when identifying which risks should be included in the register. Due consideration of risks and threats included in this risk register should be part of the requirements of national certification schemes. To keep in line with the continuously evolving threat landscape, the risk register should be maintained and regularly updated in collaboration with the Cooperation Group.</p>\n</li>\n<li id=\"recital-12\" data-recital=\"12\" class=\"linkable-recital\">\n<p>(12) When establishing their certification schemes, scheme owners should perform a risk assessment to refine and complement the risks and threats listed in the register with risks and threats specific to the architecture or implementation of the wallet solution. The risk assessment should consider how the applicable risks and threats can be appropriately treated. Wallet providers should complement the scheme’s risk assessment to identify any risks and threats specific to their implementation and propose appropriate treatment measures for evaluation by the certification body.</p>\n</li>\n<li id=\"recital-13\" data-recital=\"13\" class=\"linkable-recital\">\n<p>(13) To demonstrate that a wallet solution architecture meets the applicable security requirements, each architecture-specific scheme or profile should contain at least a description of the wallet solution architecture, a list of security requirements applicable to the wallet solution architecture, an evaluation plan to confirm that a wallet solution based on this architecture meets those requirements and a risk assessment. National certification schemes should require wallet providers to demonstrate how the design of the wallet solution that they provide matches the reference architecture and details the security controls and validation plans for the specific wallet solution. National certification schemes should also define a conformity assessment activity to verify that the wallet design properly reflects the selected profile’s reference architecture. National certification schemes should comply with the requirements set out in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"30\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 51 of Regulation (EU) 2019/881</span>, except for its points (e) and (f), related to logging.</p>\n</li>\n<li id=\"recital-14\" data-recital=\"14\" class=\"linkable-recital\">\n<p>(14) Concerning the certification of products, certificates of conformity issued under the EU cybersecurity certification scheme on EUCC, and certificates of conformity issued under national certification schemes in the context of the SOG-IS Mutual Recognition Agreement, should be allowed to be used. Furthermore, other national certification schemes should be allowed to be used for less sensitive product components, such as those established following the standard CEN EN 17640 for fixed time cybersecurity evaluation methodology.</p>\n</li>\n<li id=\"recital-15\" data-recital=\"15\" class=\"linkable-recital\">\n<p>(15) The EU Digital Identity Wallet Trust Mark ('Trust Mark') should be used to indicate in a clear, simple and recognisable manner that a wallet has been provided in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. Therefore, it should be considered as a mark of conformity for a wallet solution certified under national certification schemes. National certification schemes should not define any other marks of conformity.</p>\n</li>\n<li id=\"recital-16\" data-recital=\"16\" class=\"linkable-recital\">\n<p>(16) In order to discourage fraud, national certification schemes should define actions to be taken where certification under the scheme is being claimed fraudulently.</p>\n</li>\n<li id=\"recital-17\" data-recital=\"17\" class=\"linkable-recital\">\n<p>(17) To ensure an efficient management of vulnerability notifications, providers of wallet solutions and the electronic identification scheme under which they are provided should define and implement processes to evaluate the severity and potential impact of vulnerabilities. National certification schemes should set a threshold over which the certification body is to be notified. Such notification requirement should not affect the criteria established by data protection legislation and Member States’ data protection authorities for notification on personal data breaches. Possible synergies could be established between the mandatory notification of breach or compromise of the wallet solutions and the notification of personal data breaches pursuant to Regulation (EU) 2016/679. The certification body’s assessment of a vulnerability impact analysis report should be without prejudice to a data protection authority’s assessment of a data protection impact assessment pursuant to Articles 35 and 36 of Regulation (EU) 2016/679.</p>\n</li>\n<li id=\"recital-18\" data-recital=\"18\" class=\"linkable-recital\">\n<p>(18) The providers of wallet solutions and the electronic identification scheme under which they are provided should notify the scheme owner of any justifications for exceptions to the vulnerability assessment required for the evaluation of the WSCD and WSCA, as set out in Annex IV.</p>\n</li>\n<li id=\"recital-19\" data-recital=\"19\" class=\"linkable-recital\">\n<p>(19) The cancellation of a certificate of conformity might have severe consequences such as the revocation of all deployed wallet units. Therefore, certification bodies should only consider cancellation if an unremedied vulnerability is likely to significantly affect the reliability of the wallet solution or the reliability of another wallet solution.</p>\n</li>\n<li id=\"recital-20\" data-recital=\"20\" class=\"linkable-recital\">\n<p>(20) A specific process for the update of national certification schemes should be put in place to manage the transition between successive releases of the schemes, in particular in relation to actions to be taken by the certificate holder regarding upcoming evaluations, maintenance, recertification and special evaluations.</p>\n</li>\n<li id=\"recital-21\" data-recital=\"21\" class=\"linkable-recital\">\n<p>(21) To facilitate transparency, wallet providers should publicly share security information about their wallet solution.</p>\n</li>\n<li id=\"recital-22\" data-recital=\"22\" class=\"linkable-recital\">\n<p>(22) Where national certification schemes rely on assurance information from other certification schemes or sources, a dependency analysis should be carried out to verify that the assurance documentation, for instance assurance reports and certificates of conformity, is available and adequate for the wallet solutions and the electronic identification scheme under which they are provided. The basis for this dependency analysis should be the risk assessment of the wallet solutions and the electronic identification scheme under which they are provided. The evaluation should determine whether the assurance documentation available for a given wallet solution and the electronic identification scheme under which it is provided is adequate to provide assurance corresponding to the targeted evaluation level. The evaluation should also update the dependency analysis, or entirely re-evaluate it, where necessary.</p>\n</li>\n<li id=\"recital-23\" data-recital=\"23\" class=\"linkable-recital\">\n<p>(23) Certification bodies should issue certificates of conformity in national certification schemes, together with a publicly available certification report, as referred to in Article 5d(2), point (a), of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>. The associated certification assessment report should be made available to the Cooperation Group.</p>\n</li>\n<li id=\"recital-24\" data-recital=\"24\" class=\"linkable-recital\">\n<p>(24) National certification schemes should set out yearly surveillance evaluation to ensure that the processes around the management and maintenance of the wallets are operating effectively, meaning that they operate as defined in the policies determining the processes. The biennial vulnerability assessment is a requirement stemming from <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, to ensure that the wallet solution continues to cover appropriately the cybersecurity risks and threats identified in the risk register, including any evolution of the threat landscape. The notions of surveillance evaluations, recertification evaluations and special evaluations should be in accordance with EN ISO/IEC 17021-1:2015.</p>\n</li>\n<li id=\"recital-25\" data-recital=\"25\" class=\"linkable-recital\">\n<p>(25) A certification cycle ends with the expiry of the certificate of conformity, or with the issuance of a new certificate of conformity following a successful recertification evaluation. The recertification evaluation should include an evaluation of all components of the object of certification, including an evaluation of the effectiveness and, where applicable, a vulnerability assessment. During recertification, it should be possible to reuse results from previous evaluations on components that have not changed.</p>\n</li>\n<li id=\"recital-26\" data-recital=\"26\" class=\"linkable-recital\">\n<p>(26) When a European cybersecurity certification scheme is adopted, national certification schemes with the same scope should cease issuing certifications after a defined transition period as referred to in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"31\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 57(1) of Regulation (EU) 2019/881</span>.</p>\n</li>\n<li id=\"recital-27\" data-recital=\"27\" class=\"linkable-recital\">\n<p>(27) National certification schemes should rely on existing frameworks and reuse evidence as appropriate in order to ensure harmonisation and interoperability. Member States may conclude agreements for the cross-border reuse of certification schemes or parts thereof. The European Commission and ENISA should, in cooperation with the Cooperation Group, support Member States in the development and maintenance of their national certification schemes ensuring knowledge-sharing and best practices.</p>\n</li>\n<li id=\"recital-28\" data-recital=\"28\" class=\"linkable-recital\">\n<p>(28) The European Data Protection Supervisor was consulted in accordance with Article 42(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span>, and delivered its opinion on 30 September 2024.</p>\n</li>\n<li id=\"recital-29\" data-recital=\"29\" class=\"linkable-recital\">\n<p>(29) The measures provided for in this Regulation are in accordance with the opinion of the Committee referred to in Article 48(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>,</p>\n</li>\n</ul>\n<p><strong>HAS ADOPTED THIS REGULATION:</strong></p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Subject matter and scope</strong></p>\n<p>This Regulation sets out reference standards and establishes specifications and procedures to build a robust framework for the certification of wallets to be updated on a regular basis to keep in line with technology and standards developments and with the work carried out on the basis of Recommendation (EU) 2021/946 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework, and in particular the Architecture and Reference Framework.</p>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>For the purpose of this Regulation, the following definitions apply:</p>\n<ul>\n<li id=\"article-2-para-1\" data-para=\"1\" data-context=\"article-2\" class=\"linkable-paragraph\">(1) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;</li>\n<li id=\"article-2-para-2\" data-para=\"2\" data-context=\"article-2\" class=\"linkable-paragraph\">(2) 'scheme owner' means an organisation which is responsible for developing and maintaining a certification scheme;</li>\n<li id=\"article-2-para-3\" data-para=\"3\" data-context=\"article-2\" class=\"linkable-paragraph\">(3) 'object of certification' means products, processes and services or a combination thereof to which specified requirements apply;</li>\n<li id=\"article-2-para-4\" data-para=\"4\" data-context=\"article-2\" class=\"linkable-paragraph\">(4) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;</li>\n<li id=\"article-2-para-5\" data-para=\"5\" data-context=\"article-2\" class=\"linkable-paragraph\">(5) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;</li>\n<li id=\"article-2-para-6\" data-para=\"6\" data-context=\"article-2\" class=\"linkable-paragraph\">(6) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;</li>\n<li id=\"article-2-para-7\" data-para=\"7\" data-context=\"article-2\" class=\"linkable-paragraph\">(7) 'risk register' means a record of information relevant to the certification process about identified risks;</li>\n<li id=\"article-2-para-8\" data-para=\"8\" data-context=\"article-2\" class=\"linkable-paragraph\">(8) 'wallet provider' means a natural or legal person who provides wallet solutions;</li>\n<li id=\"article-2-para-9\" data-para=\"9\" data-context=\"article-2\" class=\"linkable-paragraph\">(9) 'certification body' means a third-party conformity assessment body operating certification schemes;</li>\n<li id=\"article-2-para-10\" data-para=\"10\" data-context=\"article-2\" class=\"linkable-paragraph\">(10) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;</li>\n<li id=\"article-2-para-11\" data-para=\"11\" data-context=\"article-2\" class=\"linkable-paragraph\">(11) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;</li>\n<li id=\"article-2-para-12\" data-para=\"12\" data-context=\"article-2\" class=\"linkable-paragraph\">(12) 'wallet user' means a user who is in control of the wallet unit;</li>\n<li id=\"article-2-para-13\" data-para=\"13\" data-context=\"article-2\" class=\"linkable-paragraph\">(13) 'incident' means an incident as defined in point (6) of Article 6 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"8\" data-short=\"Directive 2022/2555\" data-celex=\"32022L2555\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2022/2555/oj\">Directive 2022/2555</span>;</li>\n<li id=\"article-2-para-14\" data-para=\"14\" data-context=\"article-2\" class=\"linkable-paragraph\">(14) 'embedded disclosure policy' means a set of rules, embedded in an electronic attestation of attributes by its provider, that indicates the conditions that a wallet-relying party has to meet to access the electronic attestation of attributes.</li>\n</ul>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Establishment of national certification schemes</strong></p>\n<ol>\n<li id=\"article-3-para-1\" data-para=\"1\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>Member States shall assign a scheme owner for each national certification scheme.</p>\n</li>\n<li id=\"article-3-para-2\" data-para=\"2\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>The object of certification defined in national certification schemes shall be the provision and operation of wallet solutions and of the electronic identification schemes under which they are provided.</p>\n</li>\n<li id=\"article-3-para-3\" data-para=\"3\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>In accordance with Implementing Regulation (EU) 2015/1502, the object of certification in national certification schemes shall include the following elements:</p>\n<ul>\n<li id=\"article-3-para-3-point-a\" data-point=\"a\" data-context=\"article-3\" data-para=\"3\" class=\"linkable-point\">(a) the software components, including settings and configurations of a wallet solution and of the electronic identification scheme under which the wallet solutions are provided;</li>\n<li id=\"article-3-para-3-point-b\" data-point=\"b\" data-context=\"article-3\" data-para=\"3\" class=\"linkable-point\">(b) the hardware components and platforms on which the software components referred to in point (b) run on or rely upon for critical operations, in cases where they are provided directly or indirectly by the wallet solution and electronic identification scheme under which they are provided and when they are required to meet the desired level of assurance for those software components. When the hardware components and platforms are not provided by the wallet provider, national certification schemes shall formulate assumptions for evaluation of the hardware components and platforms, under which resistance against attackers with high attack potential in line with Implementing Regulation (EU) 2015/1502 can be provided, and specify the evaluation activities to confirm these assumptions as referred in Annex IV;</li>\n<li id=\"article-3-para-3-point-c\" data-point=\"c\" data-context=\"article-3\" data-para=\"3\" class=\"linkable-point\">(c) the processes that support the provision and operation of a wallet solution, including the user onboarding process as referred to in Article 5a of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, covering at least enrolment, electronic means management and organisation pursuant to section 2.1, 2.2, and 2.4 of Annex I to Implementing Regulation (EU) 2015/1502.</li>\n</ul>\n</li>\n<li id=\"article-3-para-4\" data-para=\"4\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>National certification schemes shall include a description of the specific architecture of the wallet solutions and of the electronic identification scheme under which they are provided. When national certification schemes cover more than one specific architecture, they shall include a profile for each specific architecture.</p>\n</li>\n<li id=\"article-3-para-5\" data-para=\"5\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>For each profile, national certification schemes shall set out at least the following:</p>\n<ul>\n<li id=\"article-3-para-5-point-a\" data-point=\"a\" data-context=\"article-3\" data-para=\"5\" class=\"linkable-point\">(a) the specific architecture of a wallet solution and of the electronic identification scheme under which they are provided;</li>\n<li id=\"article-3-para-5-point-b\" data-point=\"b\" data-context=\"article-3\" data-para=\"5\" class=\"linkable-point\">(b) the security controls associated to assurance levels set out in Article 8 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>;</li>\n<li id=\"article-3-para-5-point-c\" data-point=\"c\" data-context=\"article-3\" data-para=\"5\" class=\"linkable-point\">(c) an evaluation plan drawn-up in accordance with section 7.4.1 of EN ISO/IEC 17065;2012;</li>\n<li id=\"article-3-para-5-point-d\" data-point=\"d\" data-context=\"article-3\" data-para=\"5\" class=\"linkable-point\">(d) the security requirements necessary to address the cybersecurity risks and threats listed in the risk register set out in Annex I of this Regulation, up to the required assurance level, and to meet, where applicable, the objectives defined in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"30\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 51 of Regulation (EU) 2019/881</span>;</li>\n<li id=\"article-3-para-5-point-e\" data-point=\"e\" data-context=\"article-3\" data-para=\"5\" class=\"linkable-point\">(e) a mapping of the controls referred to in point (b) of this paragraph to the components of the architecture;</li>\n<li id=\"article-3-para-5-point-f\" data-point=\"f\" data-context=\"article-3\" data-para=\"5\" class=\"linkable-point\">(f) a description of how the security controls, the mapping, the security requirements and the evaluation plan referred to in points (b) to (c) allow providers of wallet solutions and the electronic identification scheme under which they are provided to adequately address the cybersecurity risks and threats identified in the risk register referred to in point (d), up to the required assurance level based on a risk assessment to refine and complement the risks and threats listed in the risk register with risks and threats specific to the architecture.</li>\n</ul>\n</li>\n<li id=\"article-3-para-6\" data-para=\"6\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>The evaluation plan referred to in paragraph 5, point (c) shall list evaluation activities to be included in the evaluation of wallet solutions and of the electronic identification scheme under which they are provided.</p>\n</li>\n<li id=\"article-3-para-7\" data-para=\"7\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>The evaluation activity referred to in paragraph 6 shall require providers of wallet solutions and the electronic identification scheme under which they are provided to provide information meeting the requirements listed in Annex II.</p>\n</li>\n</ol>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>General requirements</strong></p>\n<ol>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>National certification schemes shall cover functional, cybersecurity and data protection requirements by using, when available and applicable, the following certification schemes:</p>\n<ul>\n<li id=\"article-4-para-1-point-a\" data-point=\"a\" data-context=\"article-4\" data-para=\"1\" class=\"linkable-point\">(a) European cybersecurity certification schemes established pursuant to Regulation (EU) 2019/881, including the EUCC;</li>\n<li id=\"article-4-para-1-point-b\" data-point=\"b\" data-context=\"article-4\" data-para=\"1\" class=\"linkable-point\">(b) national cybersecurity certification schemes covered by the EUCC, in accordance with Article 49 of Implementing Regulation (EU) 2024/482.</li>\n</ul>\n</li>\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>National certification schemes may, in addition, when available and applicable, refer to:</p>\n<ul>\n<li id=\"article-4-para-2-point-a\" data-point=\"a\" data-context=\"article-4\" data-para=\"2\" class=\"linkable-point\">(a) other relevant national certification schemes;</li>\n<li id=\"article-4-para-2-point-b\" data-point=\"b\" data-context=\"article-4\" data-para=\"2\" class=\"linkable-point\">(b) international, European, and national standards;</li>\n<li id=\"article-4-para-2-point-c\" data-point=\"c\" data-context=\"article-4\" data-para=\"2\" class=\"linkable-point\">(c) technical specifications that meet the requirements set out in Annex II to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"9\" data-short=\"Regulation 1025/2012\" data-celex=\"32012R1025\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2012/1025/oj\">Regulation 1025/2012</span>.</li>\n</ul>\n</li>\n<li id=\"article-4-para-3\" data-para=\"3\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>National certification schemes shall:</p>\n<ul>\n<li id=\"article-4-para-3-point-a\" data-point=\"a\" data-context=\"article-4\" data-para=\"3\" class=\"linkable-point\">(a) specify the elements listed in section 6.5 of EN ISO/IEC 17067:2013;</li>\n<li id=\"article-4-para-3-point-b\" data-point=\"b\" data-context=\"article-4\" data-para=\"3\" class=\"linkable-point\">(b) be implemented as a type 6 scheme, in accordance with section 5.3.8 of EN ISO/IEC 17067:2013.</li>\n</ul>\n</li>\n<li id=\"article-4-para-4\" data-para=\"4\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>National certification schemes shall comply with the following requirements:</p>\n<ul>\n<li id=\"article-4-para-4-point-a\" data-point=\"a\" data-context=\"article-4\" data-para=\"4\" class=\"linkable-point\">(a) only providers referred to in Article 5a(2) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> are eligible to be issued certificates under the national certification schemes;</li>\n<li id=\"article-4-para-4-point-b\" data-point=\"b\" data-context=\"article-4\" data-para=\"4\" class=\"linkable-point\">(b) only the Trust Mark is used as mark of conformity;</li>\n<li id=\"article-4-para-4-point-c\" data-point=\"c\" data-context=\"article-4\" data-para=\"4\" class=\"linkable-point\">(c) providers of wallet solutions and the electronic identification scheme under which they are provided include references to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> and this Regulation when referring to the scheme;</li>\n<li id=\"article-4-para-4-point-d\" data-point=\"d\" data-context=\"article-4\" data-para=\"4\" class=\"linkable-point\">(d) providers of wallet solutions and the electronic identification scheme under which they are provided, complement the scheme’s risk assessment as referred to in Article 3, paragraph 5 point (f), to identify risks and threats specific to their implementation and propose appropriate treatment measures for all relevant risks and threats;</li>\n<li id=\"article-4-para-4-point-e\" data-point=\"e\" data-context=\"article-4\" data-para=\"4\" class=\"linkable-point\">(e) responsibilities and the legal action are established and include references to the applicable national legislation, which defines the responsibilities and possible legal action, where certification under the scheme is being used fraudulently.</li>\n</ul>\n</li>\n<li id=\"article-4-para-5\" data-para=\"5\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>The assessment referred to in paragraph 4, point (d) shall be shared with the certification body for evaluation.</p>\n</li>\n</ol>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Incident and vulnerability management</strong></p>\n<ol>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>National certification schemes shall contain incident and vulnerability management requirements in accordance with paragraphs 2 to 9.</p>\n</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The holder of a certificate of conformity of a wallet solution and of the electronic identification scheme under which it is provided shall notify their certification body without undue delay of any breach or compromise of the wallet solution, or of the electronic identification scheme under which it is provided, that is likely to impact its conformity with the requirements of the national certification schemes’ requirements.</p>\n</li>\n<li id=\"article-5-para-3\" data-para=\"3\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The holder of a certificate of conformity shall establish, maintain and operate a vulnerability management policy and procedures, taking into account the procedures set out in existing European and international standards, including EN ISO/IEC 30111:2019.</p>\n</li>\n<li id=\"article-5-para-4\" data-para=\"4\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The holder of the certificate of conformity shall notify the issuing certification body of the vulnerabilities and changes affecting the wallet solution, based on defined criteria on the impact of these vulnerabilities and changes.</p>\n</li>\n<li id=\"article-5-para-5\" data-para=\"5\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The holder of the certificate of conformity shall prepare a vulnerability impact analysis report for any vulnerability that affects the software components of the wallet solution. The report shall include the following information:</p>\n<ul>\n<li id=\"article-5-para-5-point-a\" data-point=\"a\" data-context=\"article-5\" data-para=\"5\" class=\"linkable-point\">(a) the impact of the vulnerability on the certified wallet solution;</li>\n<li id=\"article-5-para-5-point-b\" data-point=\"b\" data-context=\"article-5\" data-para=\"5\" class=\"linkable-point\">(b) possible risks associated with the proximity or likelihood of an attack;</li>\n<li id=\"article-5-para-5-point-c\" data-point=\"c\" data-context=\"article-5\" data-para=\"5\" class=\"linkable-point\">(c) whether the vulnerability can be remedied using available means;</li>\n<li id=\"article-5-para-5-point-d\" data-point=\"d\" data-context=\"article-5\" data-para=\"5\" class=\"linkable-point\">(d) where the vulnerability can be remedied using available means, possible ways to remedy the vulnerability.</li>\n</ul>\n</li>\n<li id=\"article-5-para-6\" data-para=\"6\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>Where notification is required in paragraph 4, the holder of the certificate of conformity shall transmit, without undue delay, the vulnerability impact analysis report referred to in paragraph 5 to the certification body.</p>\n</li>\n<li id=\"article-5-para-7\" data-para=\"7\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The holder of a certificate of conformity shall establish, maintain and operate a vulnerability management policy meeting the requirements set out in Annex I to the Cyber Resilience Act <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"10\" data-short=\"Regulation 2024/2847\" data-celex=\"32024R2847\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2024/2847/oj\">Regulation 2024/2847</span>.</p>\n</li>\n<li id=\"article-5-para-8\" data-para=\"8\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>National certification schemes shall establish vulnerability disclosure requirements applicable to certification bodies.</p>\n</li>\n<li id=\"article-5-para-9\" data-para=\"9\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The holder of a certificate of conformity shall disclose and register any publicly known and remediated vulnerability in the wallet solution or in one of the online repositories referred to in Annex V.</p>\n</li>\n</ol>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong>Maintenance of national certification schemes</strong></p>\n<ol>\n<li id=\"article-6-para-1\" data-para=\"1\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p>National certification schemes shall contain a process for reviewing their operation on a periodic basis. That process shall aim at confirming their adequacy and at identifying aspects requiring improvement, taking into account feedback from stakeholders.</p>\n</li>\n<li id=\"article-6-para-2\" data-para=\"2\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p>National certification schemes shall include provisions concerning their maintenance. This process shall include at least the following requirements:</p>\n<ul>\n<li id=\"article-6-para-2-point-a\" data-point=\"a\" data-context=\"article-6\" data-para=\"2\" class=\"linkable-point\">(a) rules for the governance of the national certification schemes’ definition and requirements;</li>\n<li id=\"article-6-para-2-point-b\" data-point=\"b\" data-context=\"article-6\" data-para=\"2\" class=\"linkable-point\">(b) the establishment of timelines for the issuance of certificates following the adoption of updated versions of the national certification schemes, both for new certificates of conformity and for previously issued ones;</li>\n<li id=\"article-6-para-2-point-c\" data-point=\"c\" data-context=\"article-6\" data-para=\"2\" class=\"linkable-point\">(c) a periodic review of the national certification schemes, to ensure that the national certification schemes’ requirements are being applied in a consistent manner, taking into account at least the following aspects:\n<ul>\n<li>requests for clarification addressed to the scheme owner related to the national certification scheme requirements;</li>\n<li>feedback from stakeholders and other interested parties;</li>\n<li>responsiveness of the national certification scheme owner to requests of information.</li>\n</ul>\n</li>\n<li id=\"article-6-para-2-point-d\" data-point=\"d\" data-context=\"article-6\" data-para=\"2\" class=\"linkable-point\">(d) rules for monitoring reference documents and procedures for the evolution of national certification schemes’ reference versions, including at least transition periods;</li>\n<li id=\"article-6-para-2-point-e\" data-point=\"e\" data-context=\"article-6\" data-para=\"2\" class=\"linkable-point\">(e) a process to ensure the latest cybersecurity risks and threats as listed in the risk register set out in Annex I of this Regulation are covered;</li>\n<li id=\"article-6-para-2-point-f\" data-point=\"f\" data-context=\"article-6\" data-para=\"2\" class=\"linkable-point\">(f) a process for managing other changes in national certification schemes.</li>\n</ul>\n</li>\n<li id=\"article-6-para-3\" data-para=\"3\" data-context=\"article-6\" class=\"linkable-paragraph\">\n<p>National certification schemes shall contain requirements for performing evaluations on currently certified products within a certain period after the revision of the scheme, or after the release of new specifications or standards, or new versions thereof, with which the wallet solutions and the electronic identification scheme under which they are provided shall comply.</p>\n</li>\n</ol>\n<h3 id=\"article-7\">Article 7</h3>\n<p><strong>General requirements</strong></p>\n<ol>\n<li id=\"article-7-para-1\" data-para=\"1\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Scheme owners shall develop and maintain national certification schemes and govern their operations.</p>\n</li>\n<li id=\"article-7-para-2\" data-para=\"2\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Scheme owners may subcontract all or part of their tasks to a third party. When subcontracting to a private party, scheme owners shall set out the duties and responsibilities of all parties by contract. Scheme owners shall remain responsible for all subcontracted activities performed by their subcontractors.</p>\n</li>\n<li id=\"article-7-para-3\" data-para=\"3\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Scheme owners shall perform their monitoring activities, if applicable, at least on the basis of the following information:</p>\n<ul>\n<li id=\"article-7-para-3-point-a\" data-point=\"a\" data-context=\"article-7\" data-para=\"3\" class=\"linkable-point\">(a) information coming from certification bodies, national accreditation bodies, and relevant market surveillance authorities;</li>\n<li id=\"article-7-para-3-point-b\" data-point=\"b\" data-context=\"article-7\" data-para=\"3\" class=\"linkable-point\">(b) information resulting from its own or another authority’s audits and investigations;</li>\n<li id=\"article-7-para-3-point-c\" data-point=\"c\" data-context=\"article-7\" data-para=\"3\" class=\"linkable-point\">(c) complaints and appeals received pursuant to Article 15.</li>\n</ul>\n</li>\n<li id=\"article-7-para-4\" data-para=\"4\" data-context=\"article-7\" class=\"linkable-paragraph\">\n<p>Scheme owners shall inform the Cooperation Group of revisions to the national certification schemes. That notification shall provide adequate information for the Cooperation Group to issue recommendations to scheme owners and opinions about the updated national certification schemes.</p>\n</li>\n</ol>\n<h3 id=\"article-8\">Article 8</h3>\n<p><strong>General requirements</strong></p>\n<ol>\n<li id=\"article-8-para-1\" data-para=\"1\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>National certification schemes shall contain cybersecurity requirements based on a risk assessment of each specific supported architecture. Those cybersecurity requirements shall aim to treat the identified cybersecurity risks and threats, as established in the risk register set out in Annex I.</p>\n</li>\n<li id=\"article-8-para-2\" data-para=\"2\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>In line with Article 5a(23) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>, national certification schemes shall require wallet solutions, and the electronic identification schemes under which they are provided, to be resistant against attackers with high attack potential for assurance level high, as referred to Implementing Regulation (EU) 2015/1502.</p>\n</li>\n<li id=\"article-8-para-3\" data-para=\"3\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>National certification schemes shall establish security criteria, which shall include the following requirements:</p>\n<ul>\n<li id=\"article-8-para-3-point-a\" data-point=\"a\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(a) Cyber Resilience Act where applicable, or requirements meeting the security objectives set out in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"30\" data-short=\"Regulation 2019/881\" data-celex=\"32019R0881\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2019/881/oj\">Article 51 of Regulation (EU) 2019/881</span>;</li>\n<li id=\"article-8-para-3-point-b\" data-point=\"b\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(b) the establishment and implementation of policies and procedures concerning the management of risks associated with the operation of a wallet solution, including the identification and assessment of risks and the mitigation of the identified risks;</li>\n<li id=\"article-8-para-3-point-c\" data-point=\"c\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(c) the establishment and implementation of policies and procedures related to the management of changes and to the management of vulnerabilities in accordance with Article 5 of this Regulation;</li>\n<li id=\"article-8-para-3-point-d\" data-point=\"d\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(d) the establishment and implementation of human resource management policies and procedures, including requirements on expertise, reliability, experience, security training, and qualifications of personnel involved in the development or operation of the wallet solution;</li>\n<li id=\"article-8-para-3-point-e\" data-point=\"e\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(e) requirements relating to the wallet solution’s operating environment, including in the form of assumptions on the security of the devices and platforms on which the software components of the wallet solution run, including WSCDs and where applicable and relevant, conformity assessment requirements to confirm that those assumptions are verified on the relevant devices and platforms;</li>\n<li id=\"article-8-para-3-point-f\" data-point=\"f\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(f) for each assumption that is not backed by a certificate of conformity or other acceptable assurance information, a description of the mechanism that the wallet provider uses to enforce the assumption, as well as a justification that the mechanism is sufficient to ensure that the assumption is verified;</li>\n<li id=\"article-8-para-3-point-g\" data-point=\"g\" data-context=\"article-8\" data-para=\"3\" class=\"linkable-point\">(g) the establishment and implementation of measures to ensure the use of a currently certified version of the wallet solution.</li>\n</ul>\n</li>\n<li id=\"article-8-para-4\" data-para=\"4\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>National certification schemes shall contain functional requirements relating to update mechanisms for every software component of the wallet solutions and the electronic identification scheme under which they are provided for the operations listed in Annex III.</p>\n</li>\n<li id=\"article-8-para-5\" data-para=\"5\" data-context=\"article-8\" class=\"linkable-paragraph\">\n<p>National certification schemes shall require that the following information and documentation is provided or otherwise made available to the certification body by the applicant for certification:</p>\n<ul>\n<li id=\"article-8-para-5-point-a\" data-point=\"a\" data-context=\"article-8\" data-para=\"5\" class=\"linkable-point\">(a) evidence related to the information referred to in Annex IV, point 1, including where necessary details on the wallet solution and its source code, including:\n<ul>\n<li><em>architecture information:</em> for every component of the wallet solution (including product, process and service components), a description of its essential security properties, including its external dependencies;</li>\n<li><em>controls and assurance levels:</em> for every security control of the wallet solution, a description of the control and the required assurance level, based on the Annex to Implementing Regulation (EU) 2015/1502, which sets out a number of technical specifications and procedures that apply to the various controls implemented by the electronic identification means;</li>\n<li><em>mapping the controls to architecture components:</em> a description of how the controls of the wallet are implemented using the different components of the wallet solution, based on a rationale explaining why a given assurance level is required, and how the control is implemented with all required security aspects at the appropriate level;</li>\n<li><em>rationale and justification of risk coverage:</em> a justification of:</li>\n</ul>\n</li>\n<li id=\"article-8-para-5-point-b\" data-point=\"b\" data-context=\"article-8\" data-para=\"5\" class=\"linkable-point\">(b) the information listed in Annex V;</li>\n<li id=\"article-8-para-5-point-c\" data-point=\"c\" data-context=\"article-8\" data-para=\"5\" class=\"linkable-point\">(c) a complete list of the certificates of conformity and other assurance information used as evidence during the evaluation activities;</li>\n<li id=\"article-8-para-5-point-d\" data-point=\"d\" data-context=\"article-8\" data-para=\"5\" class=\"linkable-point\">(d) any other information relevant for the evaluation activities.</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"article-9\">Article 9</h3>\n<p><strong>General requirements</strong></p>\n<ol>\n<li id=\"article-9-para-1\" data-para=\"1\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Certification bodies shall be accredited by national accreditation bodies appointed pursuant to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation 765/2008\" data-celex=\"32008R0765\" data-internal=\"true\" data-url=\"#/regulation/765-2008\">Regulation 765/2008</span> in accordance with EN ISO/IEC 17065:2012, provided that they comply with the requirements set out in national certification schemes in accordance with paragraph 2.</p>\n</li>\n<li id=\"article-9-para-2\" data-para=\"2\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>For the purposes of accreditation, certification bodies shall comply with all the following competence requirements:</p>\n<ul>\n<li id=\"article-9-para-2-point-a\" data-point=\"a\" data-context=\"article-9\" data-para=\"2\" class=\"linkable-point\">(a) detailed and technical knowledge of the relevant architectures of a wallet solution and of the electronic identification scheme under which they are provided, as well as of the threats and risks relevant to those architectures;</li>\n<li id=\"article-9-para-2-point-b\" data-point=\"b\" data-context=\"article-9\" data-para=\"2\" class=\"linkable-point\">(b) knowledge of available security solutions and of their properties pursuant to the Annex of Implementing Regulation (EU) 2015/1502;</li>\n<li id=\"article-9-para-2-point-c\" data-point=\"c\" data-context=\"article-9\" data-para=\"2\" class=\"linkable-point\">(c) knowledge of the activities performed in virtue of certificates of conformity applied to components of the wallet solution and the electronic identification scheme under which they are provided, as being the object of certification;</li>\n<li id=\"article-9-para-2-point-d\" data-point=\"d\" data-context=\"article-9\" data-para=\"2\" class=\"linkable-point\">(d) detailed knowledge of the applicable national certification scheme as established in accordance with Chapter II.</li>\n</ul>\n</li>\n<li id=\"article-9-para-3\" data-para=\"3\" data-context=\"article-9\" class=\"linkable-paragraph\">\n<p>Certification bodies shall perform their surveillance activities in particular on the basis of the following information:</p>\n<ul>\n<li id=\"article-9-para-3-point-a\" data-point=\"a\" data-context=\"article-9\" data-para=\"3\" class=\"linkable-point\">(a) information coming from national accreditation bodies, and relevant market surveillance authorities;</li>\n<li id=\"article-9-para-3-point-b\" data-point=\"b\" data-context=\"article-9\" data-para=\"3\" class=\"linkable-point\">(b) information resulting from their own or another authority’s audits and investigations;</li>\n<li id=\"article-9-para-3-point-c\" data-point=\"c\" data-context=\"article-9\" data-para=\"3\" class=\"linkable-point\">(c) complaints and appeals received pursuant to Article 15.</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"article-10\">Article 10</h3>\n<p><strong>Subcontracting</strong></p>\n<p>Certification bodies may subcontract the evaluation activities, as set out in Article 13, to third parties. Where evaluation activities are subcontracted, national certification schemes shall establish the following:</p>\n<ul>\n<li id=\"article-10-para-1\" data-para=\"1\" data-context=\"article-10\" class=\"linkable-paragraph\">(1) all subcontractors of the certification body performing evaluation activities shall, as applicable and appropriate for the activities to be performed, meet the requirements of harmonised standards like EN ISO/IEC 17025:2017 for testing, EN ISO/IEC 17020:2012 for inspection, EN ISO/IEC 17021-1:2015 for audit, and EN ISO/IEC 17029:2019 for validation and verification;</li>\n<li id=\"article-10-para-2\" data-para=\"2\" data-context=\"article-10\" class=\"linkable-paragraph\">(2) certification bodies shall take responsibility for all evaluation activities outsourced to other bodies and demonstrate that they have taken appropriate measures during their accreditation, including by relying on their subcontractors’ own accreditation, when applicable;</li>\n<li id=\"article-10-para-3\" data-para=\"3\" data-context=\"article-10\" class=\"linkable-paragraph\">(3) the degree to which prior agreement to outsourcing needs shall be obtained from scheme owners or the client whose wallet solution is being certified under the certification scheme.</li>\n</ul>\n<h3 id=\"article-11\">Article 11</h3>\n<p><strong>Notification to the supervisory body</strong></p>\n<p>Certification bodies shall notify the supervisory body referred to in Article 46a(1) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation 2024/2979\" data-celex=\"32024R2979\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2979\">Regulation 2024/2979</span> laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"13\" data-short=\"Regulation 2024/2982\" data-celex=\"32024R2982\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2982\">Regulation 2024/2982</span> laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"14\" data-short=\"Regulation 2024/2977\" data-celex=\"32024R2977\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2977\">Regulation 2024/2977</span> laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council as regards person identification data and electronic attestations of attributes issued to European Digital Identity Wallets.</p>\n<h2 id=\"annex-iv\">ANNEX IV</h2>\n<p>**1.<strong>Audit of the implementation of a wallet solution</strong></p>\n<p>A conformity assessment activity shall consist of selecting specific evaluation activities.</p>\n<p>National certification schemes shall specify an evaluation activity to assess the information provided, covering at least the following:</p>\n<p>The analysis mentioned in points (a) to (b) shall rely on the rationale and justification provided by the wallet provider.</p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(a) an analysis of the information provided to confirm that it is suited for one of the architectures specified in national certification schemes;</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(b) an analysis of the coverage of the cybersecurity risks and threats identified in the risk register of Annex I by the described security controls.</li>\n</ul>\n<p>**2.<strong>Evaluation activities related to the wallet secure cryptographic device</strong></p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(1) Critical operations, including cryptographic computations, are not required to be fully implemented in the WSCD. However, the part implemented in the WSCD, when operating as part of the wallet solution, shall guarantee the protection of the critical operations it performs against attacks by attackers with high attack potential in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2015/1502\" data-celex=\"32015R1502\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2015/1502/oj\">Regulation 2015/1502</span>.</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(2) The WSCD or part thereof may be within the object of certification when it is provided by the certificate holder or applicant, or outside of its scope when it is embedded in a device provided by the end user. In addition, national certification schemes shall specify the evaluation activities to verify the suitability of the WSCD, in the two following cases:\n<ul>\n<li id=\"annex-iv-para-2-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(a) if the WSCA depends on the particular WSCD (i.e. if it needs to be evaluated as a composite product based on the WSCD) then the evaluation of the WSCA shall require access to additional information related to the WSCD’s certification, including, in particular, its evaluation technical report;</li>\n<li id=\"annex-iv-para-2-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(b) if an architecture considered in the scheme uses several WSCDs, or if some of the operations on critical assets are performed outside of the WSCD, then national certification schemes shall include evaluation activities to ensure that the overall solution offers the expected level of security.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-3\" data-para=\"3\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(3) As a prerequisite to the certification under national certification schemes, the WSCD shall be assessed against the requirements of assurance level high as set out in Implementing Regulation (EU) 2015/1502.</li>\n<li id=\"annex-iv-para-4\" data-para=\"4\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(4) In addition, in the documentation related to each specific architecture, national certification schemes shall formulate assumptions for this evaluation of the WSCD under which resistance against attackers with high attack potential in accordance with Implementing Regulation (EU) 2015/1502 can be provided and specify the evaluation activities to confirm these assumptions and to confirm after issuance of the certificate that the assumptions are still verified. The national schemes shall also require the candidates to certification to refine these assumptions for their specific implementation, and to describe the measures in place to guarantee that the assumptions are verified throughout the certification lifecycle.</li>\n<li id=\"annex-iv-para-5\" data-para=\"5\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(5) In all cases, national certification schemes shall include an evaluation activity to verify that the assurance information available for the WSCD is suitable for the purpose of the wallet solution, through an analysis of the assurance information, such as the security target for EUCC certificates, including the following activities:\n<ul>\n<li id=\"annex-iv-para-5-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"5\" class=\"linkable-point\">(a) verifying that the scope of the evaluation is suitable, which for EUCC certificates, for instance, means verifying that the security target claims conformity to one of the protection profiles recommended in the EUCC;</li>\n<li id=\"annex-iv-para-5-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"5\" class=\"linkable-point\">(b) verifying that the assumptions on the operating environment are compatible with the wallet solution, which for EUCC certificates, for instance, means that these assumptions can be found in the security target;</li>\n<li id=\"annex-iv-para-5-point-c\" data-point=\"c\" data-context=\"annex-iv\" data-para=\"5\" class=\"linkable-point\">(c) verifying that the recommendations in the user guidance or documentation are compatible with the conditions on which the WSCD is to be used in the wallet solution;</li>\n<li id=\"annex-iv-para-5-point-d\" data-point=\"d\" data-context=\"annex-iv\" data-para=\"5\" class=\"linkable-point\">(d) verifying that the assumptions made in the national certification scheme about WSCDs are verified and covered in the assurance information.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-6\" data-para=\"6\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(6) In cases where some of the verifications are not fully conclusive, national certification schemes shall require certification bodies to specify compensating requirements for the wallet secure cryptographic application (WSCA) based on the WSCD, to be included in the evaluation of the WSCA. If this is not possible, national certification schemes shall deem the WSCD unsuitable, meaning that the wallet solution shall not be issued a certificate of conformity.</li>\n</ul>\n<p>**3.<strong>Evaluation activities related to the wallet secure cryptographic application (WSCA)</strong></p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(1) National certification schemes shall require that a WSCA, as part of a wallet solution, is evaluated against the requirements of at least assurance level high as set out in Implementing Regulation (EU) 2015/1502.</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(2) This evaluation shall include a vulnerability assessment, as set out in EN ISO/IEC 15408-3:2022 at level AVA_VAN.5, as set out in Annex I of Implementing Regulation (EU) 2024/482, unless it is duly justified to the certification body that the security characteristics of the WSCA make it possible to use a lower assessment level while keeping the same overall assurance level high as set out in Implementing Regulation (EU) 2015/1502.</li>\n<li id=\"annex-iv-para-3\" data-para=\"3\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(3) When the WSCA is not provided by the wallet provider, national certification schemes shall formulate assumptions for this evaluation of the WSCA under which resistance against attackers with high attack potential in accordance with Implementing Regulation (EU) 2015/1502 can be provided and specify the evaluation activities to confirm these assumptions and to confirm after issuance of the certificate that the assumptions are still verified. The national schemes shall also require the candidates to certification to refine these assumptions for their specific implementation, and to describe the measures in place to guarantee that the assumptions are verified throughout the certification lifecycle.</li>\n<li id=\"annex-iv-para-4\" data-para=\"4\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(4) In all cases, national certification schemes shall include an evaluation activity to verify that the assurance information available for the WSCA is suitable for the purpose of the wallet solution, through an analysis of the assurance information, such as the security target for EUCC certificates, including the following activities:\n<ul>\n<li id=\"annex-iv-para-4-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"4\" class=\"linkable-point\">(a) verifying that the scope of the evaluation is suitable, which for EUCC certificates, for instance, means verifying that the security target claims conformity to one of the protection profiles recommended in the EUCC;</li>\n<li id=\"annex-iv-para-4-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"4\" class=\"linkable-point\">(b) verifying that the assumptions on the operating environment are compatible with the wallet solution, which for EUCC certificates, for instance, means that these assumptions can be found in the security target;</li>\n<li id=\"annex-iv-para-4-point-c\" data-point=\"c\" data-context=\"annex-iv\" data-para=\"4\" class=\"linkable-point\">(c) verifying that the recommendations in the user guidance or documentation are compatible with the conditions on which the WSCA is to be used in the wallet solution;</li>\n<li id=\"annex-iv-para-4-point-d\" data-point=\"d\" data-context=\"annex-iv\" data-para=\"4\" class=\"linkable-point\">(d) verifying that the assumptions made in the national certification scheme about WSCAs are verified and covered in the assurance information.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-5\" data-para=\"5\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(5) National certification schemes shall require that the evaluation of the WSCA covers all security controls implemented by this WSCA.</li>\n</ul>\n<p>**4.<strong>Evaluation activities related to the end user device</strong></p>\n<p>Since the risk register, as set out in Annex I of this Regulation, identifies risks that are directly linked to the security of the end user device, national certification schemes shall specify security requirements for end user devices. However, as these devices are provided by the end user and not by the wallet provider, these requirements shall be covered by assumptions.</p>\n<p>For each assumption, the wallet solution shall include a mechanism to verify for every wallet unit that the underlying end user device satisfies the assumption. Such mechanisms shall be considered as security controls and covered by evaluation activities to demonstrate both their suitability and their effectiveness at the appropriate assurance level.</p>\n<p>Two examples are set out below:</p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(a) an end user device may include a certified WSCD, which needs to be demonstrated. Typically, this would be done by using a cryptographic mechanism to verify the presence in the certified WSCD of a cryptographic secret that is only available in the certified WSCD. In this case, this cryptographic secret should be considered as a critical asset and be covered by the certification of the WSCD and/or of the WSCA;</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(b) a typical requirement for end user devices would be that the devices must receive security updates. Since this requirement is related to the wallet instance, the mechanism used to verify the availability of security updates only needs to be covered by evaluation activities at an assurance level suitable for the wallet instance, especially as it is likely to be integrated into the wallet instance.</li>\n</ul>\n<p>**5.<strong>Evaluation activities related to the wallet instance</strong></p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(1) The evaluation of the wallet instance shall consider the following two main challenges:\n<ul>\n<li id=\"annex-iv-para-1-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"1\" class=\"linkable-point\">(a) the wallet instance is likely to exist in a set of variants of the same base application, with each variant specialised for a specific category of end user devices;</li>\n<li id=\"annex-iv-para-1-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"1\" class=\"linkable-point\">(b) the different variants of the wallet instance will likely need frequent updates in order to follow the development of the underlying security platform, for instance when vulnerabilities are identified that require changes to applications.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(2) The evaluation of the wallet instance shall take into consideration these specific challenges. One of the immediate consequences is that the Common Criteria framework may not be suitable in all cases. Therefore, alternative evaluation methodologies shall be considered where necessary. National certification schemes shall consider the use of the EN 17640:2018 methodology for the following:\n<ul>\n<li id=\"annex-iv-para-2-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(a) as part of the scheme itself;</li>\n<li id=\"annex-iv-para-2-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(b) through national schemes based on the methodology;</li>\n<li id=\"annex-iv-para-2-point-c\" data-point=\"c\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(c) through national schemes based on similar principles but created before the development of the EN 17640:2018 methodology.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-3\" data-para=\"3\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(3) In addition, as there may be limited added value in performing a full dedicated evaluation of each variant, national certification schemes shall consider specifying criteria allowing sampling to be performed, in order to avoid repetition of identical evaluation activities and to focus on activities that are specific to a given variant. National certification schemes shall require all certification bodies to justify their use of sampling.</li>\n<li id=\"annex-iv-para-4\" data-para=\"4\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(4) National certification schemes shall include updates of the wallet instance in the overall change management process specified for the wallet solution. They shall also lay down rules on the procedures that shall be performed by the wallet provider for every update (e.g. analysing the impact of the changes on the security controls), and on the evaluation activities that shall be performed by the certification body on updates under specified conditions (e.g. assessing the operating effectiveness of a modified security control). The change management process is one of the processes whose operating effectiveness is required to be checked annually in accordance with Article 18(3).</li>\n</ul>\n<p>**6.<strong>Evaluation activities related to the services and processes used for the provision and operation of the wallet solution</strong></p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(1) For the evaluation of services and processes that play a role in the provision and operation of the wallet solution and the electronic identification scheme under which they are provided, the evaluation team shall gather evidence by conducting evaluation activities that may include audit, inspection, verification and validation activities.</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(2) The certification body shall confirm the sufficiency and appropriateness of the evidence to provide sufficient assurance that the services and processes meet the certification requirements, by confirming the following:\n<ul>\n<li id=\"annex-iv-para-2-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(a) the accuracy of the information presented in the description of the processes and services;</li>\n<li id=\"annex-iv-para-2-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(b) the suitability of the design and the controls of the processes and services to meet the evaluation criteria;</li>\n<li id=\"annex-iv-para-2-point-c\" data-point=\"c\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(c) the operating effectiveness of an implementation of these controls throughout a specified period before the evaluation.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-3\" data-para=\"3\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(3) The accuracy of the description and the operating effectiveness of an implementation of controls may be considered as verification objectives, in the sense of ISO/IEC 17000:2020, of the corresponding claims by the wallet provider (i.e. confirmation of fairness of events that have already occurred or results that have already been obtained), whereas the suitability of the design and the controls of the services and processes to meet the evaluation criteria may be considered as a validation objective, in the sense of ISO/IEC 17000:2020, of the corresponding claim by the wallet provider (i.e. confirmation of plausibility regarding an intended future use or projected outcome).</li>\n<li id=\"annex-iv-para-4\" data-para=\"4\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(4) Considering that a wallet solution is not allowed to operate before being certified, operating effectiveness cannot be confirmed on the basis of the actual operation of the solution. Therefore, this shall be confirmed using evidence gathered during tests or pilots.</li>\n<li id=\"annex-iv-para-5\" data-para=\"5\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(5) National certification schemes may already exist for specific services and processes, for instance for the onboarding of users. The use of such schemes shall be considered by national certification schemes, if applicable.</li>\n</ul>\n<p>**7.<strong>Evaluation activities related to the ICT services used for the provision and operation of the wallet solution</strong></p>\n<ul>\n<li id=\"annex-iv-para-1\" data-para=\"1\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(1) Some wallet architectures may rely on dedicated ICT services, including cloud services for the provision and operation of a wallet solution, and these services may host sensitive data as well as sensitive operations. In such a case, national certification schemes shall specify security requirements for these ICT services.</li>\n<li id=\"annex-iv-para-2\" data-para=\"2\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(2) Many certification schemes already exist for ICT services, cloud services, and other sources of assurance information, including those listed in Annex II. National certification schemes shall rely, when available and applicable, on those existing mechanisms, through one of the following mechanisms:\n<ul>\n<li id=\"annex-iv-para-2-point-a\" data-point=\"a\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(a) mandating the use of a specific scheme or of a selection of schemes, by specifying the conditions under which the ICT or cloud services is to be assessed using these schemes;</li>\n<li id=\"annex-iv-para-2-point-b\" data-point=\"b\" data-context=\"annex-iv\" data-para=\"2\" class=\"linkable-point\">(b) leaving the choice of the assessment to the wallet provider and use the dependency analysis activity to analyse the suitability of the assurance information obtained through these assessments.</li>\n</ul>\n</li>\n<li id=\"annex-iv-para-3\" data-para=\"3\" data-context=\"annex-iv\" class=\"linkable-paragraph\">(3) In both cases, national certification schemes shall specify additional evaluation activities as needed to analyse or supplement the information obtained through these schemes.</li>\n</ul>\n<h2 id=\"annex-v\">ANNEX V</h2>\n<h2 id=\"annex-vi\">ANNEX VI</h2>\n<p>**1.<strong>Assessing the availability of assurance documentation</strong></p>\n<p>Evaluators shall list the assurance documentation available for every relevant component of the wallet solution and the electronic identification scheme under which they are provided. Then, evaluators shall assess the overall relevance of each piece of assurance documentation for the dependency review.</p>\n<p>The following aspects shall be considered in the analysis:</p>\n<ul>\n<li id=\"annex-vi-para-1\" data-para=\"1\" data-context=\"annex-vi\" class=\"linkable-paragraph\">(1) about the assurance documentation itself:\n<ul>\n<li id=\"annex-vi-para-1-point-a\" data-point=\"a\" data-context=\"annex-vi\" data-para=\"1\" class=\"linkable-point\">(a) the type of assurance documentation, with all required details,</li>\n<li id=\"annex-vi-para-1-point-b\" data-point=\"b\" data-context=\"annex-vi\" data-para=\"1\" class=\"linkable-point\">(b) the period covered or period of validity,</li>\n<li id=\"annex-vi-para-1-point-c\" data-point=\"c\" data-context=\"annex-vi\" data-para=\"1\" class=\"linkable-point\">(c) the applicable framework (e.g. existing standard);</li>\n<li id=\"annex-vi-para-1-point-d\" data-point=\"d\" data-context=\"annex-vi\" data-para=\"1\" class=\"linkable-point\">(d) whether the assurance documentation includes a mapping to the scheme’s requirements;</li>\n</ul>\n</li>\n<li id=\"annex-vi-para-2\" data-para=\"2\" data-context=\"annex-vi\" class=\"linkable-paragraph\">(2) about the assurance report issuer’s professional competence and impartiality:\n<ul>\n<li id=\"annex-vi-para-2-point-a\" data-point=\"a\" data-context=\"annex-vi\" data-para=\"2\" class=\"linkable-point\">(a) name of the certification body and, if available, name of the lead evaluator;</li>\n<li id=\"annex-vi-para-2-point-b\" data-point=\"b\" data-context=\"annex-vi\" data-para=\"2\" class=\"linkable-point\">(b) evidence of the certification body’s and the evaluator’s competence (e.g. accreditation, personal certification, etc.);</li>\n<li id=\"annex-vi-para-2-point-c\" data-point=\"c\" data-context=\"annex-vi\" data-para=\"2\" class=\"linkable-point\">(c) evidence of the certification body’s and the evaluator’s impartiality (e.g. accreditation, etc.).</li>\n</ul>\n</li>\n</ul>\n<p>**2.<strong>Assessing assurance related to individual requirements</strong></p>\n<p>Evaluators shall verify that the assurance documentation available for the wallet solution and the electronic identification scheme under which they are provided is adequate to determine that the wallet solution meets the expectations relative to the certification scheme’s individual requirements.</p>\n<p>This assessment shall be performed for every relevant component of the wallet solution and the electronic identification scheme under which they are provided, by formulating an assumption on the wallet solution’s security controls.</p>\n<p>For each such assumption, the evaluation team shall determine whether or not the assurance provided in the available assurance documentation is adequate.</p>\n<p>The determination that the assurance is adequate shall be based on the following:</p>\n<ul>\n<li id=\"annex-vi-para-1\" data-para=\"1\" data-context=\"annex-vi\" class=\"linkable-paragraph\">(1) the required information is available, with the expected assurance level, in the assurance documentation;</li>\n<li id=\"annex-vi-para-2\" data-para=\"2\" data-context=\"annex-vi\" class=\"linkable-paragraph\">(2) the information available in the assurance documentation does not cover the full scope of the requirement, but additional controls or compensating controls (i.e., internal controls that reduce the risk of existing or potential control weakness) implemented in the wallet solution or in the electronic identification scheme under which they are provided allow the evaluators to determine that the information is adequate;</li>\n<li id=\"annex-vi-para-3\" data-para=\"3\" data-context=\"annex-vi\" class=\"linkable-paragraph\">(3) the information available in the assurance documentation does not offer the expected assurance level but the controls implemented to assess and monitor the wallet provider allow the evaluators to determine that the information is adequate;</li>\n<li id=\"annex-vi-para-4\" data-para=\"4\" data-context=\"annex-vi\" class=\"linkable-paragraph\">(4) if the assurance documentation mentions nonconformities on the design or implementation of the controls used to meet an assumption, the remedial actions proposed and implemented by the wallet provider and reviewed by its evaluators shall be adequate to guarantee that the assumption is indeed met.</li>\n</ul>\n<h2 id=\"annex-vii\">ANNEX VII</h2>\n<h2 id=\"annex-viii\">ANNEX VIII</h2>\n<h2 id=\"annex-ix\">ANNEX IX</h2>",
  "wordCount": 8798,
  "lastProcessed": "2026-01-18T00:22:18.253Z",
  "preambleInjected": false
}