{
  "slug": "2024-2980",
  "type": "implementing-act",
  "legalType": "regulation",
  "category": "implementing_act",
  "title": "Commission Implementing Regulation (EU) 2024/2980 of 28 November 2024 laying down rules for the application of Regulation (EU) No 910/2014 of the European Parliament and of the Council as regards notifications to the Commission concerning the European Digital Identity Wallet ecosystem",
  "shortTitle": "Dashboard Requirements",
  "description": "THE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC \\[OJ L 257, 28.",
  "celex": "32024R2980",
  "date": "28 November 2024",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32024R2980",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "annex-i",
      "title": "ANNEX I",
      "level": 2
    },
    {
      "id": "annex-ii",
      "title": "ANNEX II",
      "level": 2
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"10\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> \\[OJ L 257, 28.8.2014, p. 73, ELI: http://data.europa.eu/eli/reg/2014/910/oj.\\], and in particular Article 5a(23) thereof,*\n\n## Recitals\n\n- (1) The European Digital Identity Framework established by <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> is a crucial component in the establishment of a secure and interoperable digital identity ecosystem across the Union. With the European Digital Identity Wallets ('wallets') being the cornerstone of the framework, it aims at facilitating access to services across Member States, while ensuring the protection of personal data and privacy.\n\n- (2) Regulation (EU) 2016/679 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span>, or Regulation (EU) 2018/1725 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to all personal data processing activities under this Regulation.\n\n- (3) Article 5a(23) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> mandates the Commission, where necessary, to establish relevant specifications and procedures. This is achieved by means of four Implementing Regulations, dealing with protocols and interfaces: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2024/2982\" data-celex=\"32024R2982\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2982\">Commission Implementing Regulation (EU) 2024/2982</span>, integrity and core functionalities: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2024/2979\" data-celex=\"32024R2979\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2979\">Commission Implementing Regulation (EU) 2024/2979</span>, person identification data and electronic attestation of attributes: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/2977\" data-celex=\"32024R2977\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2977\">Commission Implementing Regulation (EU) 2024/2977</span>, as well as the notifications to the Commission: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Regulation 2024/2980\" data-celex=\"32024R2980\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2980\">Commission Implementing Regulation (EU) 2024/2980</span>. This Regulation lays down the relevant requirements for Member States’ notifications of trusted entities that establish trustworthiness of the European Digital Identity Framework.\n\n- (4) The Commission regularly assesses new technologies, practices, standards or technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Regulation rely on the work carried out on the basis of Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Framework \\[OJ L 210, 14.6.2021, p. 51, ELI: http://data.europa.eu/eli/reco/2021/946/oj.\\] and in particular the architecture and reference framework. In accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"16\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183?section=recital-75\">Recital 75 of Regulation (EU) 2024/1183</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"8\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, the Commission should review and update this Implementing Regulation, if necessary, to keep it in line with global developments, the architecture and reference framework, and to follow the best practices on the internal market.\n\n- (5) To meet the objective of establishing a transparent and reliable source of information for authenticating entities in the European Digital Identity Wallet ecosystem, such as wallet providers, providers of person identification data and wallet-relying parties, Member States should notify the required information to the electronic system provided by the Commission. In line with the approach taken by <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"9\" data-short=\"Decision 2015/1984\" data-celex=\"32015D1984\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dec_impl/2015/1984/oj\">Commission Implementing Decision (EU) 2015/1984</span> defining the circumstances, formats and procedures of notification with respect to electronic identification schemes applicable to electronic identification means, information should be provided by the Member States to the Commission in English. In this manner, descriptions of electronic identification schemes are available in English for all such schemes, irrespective of whether they relate to electronic identification means or to wallets.\n\n- (6) For the same objective of establishing information sources that enable the authentication of entities in the European Digital Identity Wallet ecosystem, the Commission should establish an infrastructure to make the information available to the public in a secure, human-readable, clear, and easily accessible manner, as well as in an electronically signed or sealed form suitable for automated processing, including by offering an application programming interface.\n\n- (7) The European Data Protection Supervisor was consulted in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Article 42(1) of Regulation (EU) 2018/1725</span>, and delivered its opinion on 30 September 2024.\n\n- (8) The measures provided for in this Regulation are in accordance with the opinion of the Committee referred to in Article 48 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>,\n\n**HAS ADOPTED THIS REGULATION:**\n\n## Enacting Terms\n\n### Article 1\n**Subject matter and scope**\n\nThis Regulation establishes obligations in relation to notifications that enable the validation of:\n\n- (1) the electronic registers used by a Member State to publish information on wallet-relying parties registered in that Member State in accordance with Article 5b(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> ('registers of wallet-relying parties'), the location of the registers of wallet-relying parties, and the identification of the registrars of wallet-relying parties;\n- (2) the identity of the registered wallet-relying parties;\n- (3) the authenticity and validity of wallet units;\n- (4) the identification of the wallet providers;\n- (5) the authenticity of person identification data;\n- (6) the identification of the providers of person identification data;\n\n  > to be updated on a regular basis to keep in line with technology and standards developments and with the work carried out on the basis of Recommendation (EU) 2021/946, and in particular the architecture and reference framework.\n\n### Article 2\n**Definitions**\n\nFor the purpose of this Regulation, the following definitions apply:\n\n- (1) 'wallet provider' means a natural or legal person who provides wallet solutions;\n- (2) 'provider of person identification data' means a natural or legal person responsible for issuing and revoking the person identification data and ensuring that the person identification data of a user is cryptographically bound to a wallet unit;\n- (3) 'wallet-relying party' means a relying party that intends to rely upon wallet units for the provision of public or private services by means of digital interaction;\n- (4) 'register of wallet-relying parties' means an electronic register used by a Member State to make information on wallet-relying parties registered in that Member State publicly available as set out in Article 5b(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>;\n- (5) 'registrar of wallet-relying parties' means the body responsible for establishing and maintaining the list of registered wallet-relying parties established in their territory who has been designated by a Member State;\n- (6) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;\n- (7) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;\n- (8) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;\n- (9) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;\n- (10) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;\n- (11) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;\n- (12) 'wallet user' means a user who is in control of the wallet unit;\n- (13) 'provider of wallet-relying party access certificates' means a natural or legal person mandated by a Member State to issue relying party access certificates to wallet-relying parties registered in that Member State;\n- (14) 'wallet-relying party access certificate' means a certificate for electronic seals or signatures authenticating and validating the wallet-relying party issued by a provider of wallet-relying party access certificates.\n\n### Article 3\n**Notification system**\n\n1. The Commission shall make available to Member States a secure electronic notification system, no later than twelve months after the publication of this Regulation in the *Official Journal of the European Union*, enabling Member States to notify the information on the bodies and mechanisms referred to in Article 5a(18) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>.\n\n2. The secure electronic notification system shall comply with the technical requirements laid down in Annex I.\n\n### Article 4\n**Notifications by Member States**\n\n1. Member States shall submit, through the secure electronic notification system referred to in Article 3(1), at least the information specified in Annex II.\n\n2. Member States shall make the notifications at least in English. Member States shall not be obliged to translate any document supporting the notifications where this would create an unreasonable administrative or financial burden.\n\n3. The Commission may request additional information or clarifications from the Member States for the purpose of verifying the completeness and consistency of the notified information.\n\n### Article 5\n**Publications by the Commission**\n\n1. The Commission shall establish, maintain and publish a list compiling the information notified by Member States on registrars of wallet-relying parties and registers of wallet-relying parties as referred to in Annex II section 1.\n\n2. The Commission shall establish, maintain and publish a list compiling the information notified by Member States on wallet providers, providers of person identification data and providers of wallet-relying party access certificates, as referred to in Annex II sections 2, 3 and 4.\n\n3. The Commission shall ensure the lists referred to in paragraphs 1 and 2 of this Article can be accessed:\n   - (a) in both electronically signed or sealed form suitable for automated processing and through a human readable website available in at least English;\n   - (b) without the need to register or to be authenticated to obtain or read the lists;\n   - (c) securely by using state of the art transport layer encryption.\n\n4. In addition to the publications of the lists referred to in paragraphs 1 and 2, the Commission shall publish:\n   - (a) the technical specifications the Commission uses for the structure of the lists;\n   - (b) the details of the URL where the lists are published;\n   - (c) the certificates to be used to verify the signature or seal on the lists;\n   - (d) the details on mechanisms used to validate changes to the location referred to in point (b) or to the certificates referred to in point (c).\n\n### Article 6\n**Entry into force**\n\nThis Regulation shall enter into force on the twentieth day following that of its publication in the\n\n---\n\nThis Regulation shall be binding in its entirety and directly applicable in all Member States.\n\nDone at Brussels, 28 November 2024.\n\n*For the Commission*\n\n*The President*\n\nUrsula von der Leyen\n\n\n## ANNEX I\n\n\n## ANNEX II\n\n**1.**Notifications of information on registrars and registers**\n\n- (1) Member States shall provide the following information to the Commission on their registrars and registers:\n   - (a) the name of the register;\n   - (b) at least one URL where the register is available for access, which shall use state of the art transport layer encryption;\n   - (c) the name of the registrar that is responsible for that register;\n   - (d) where applicable, the registration number of the registrar;\n   - (e) the Member State in which the registrar is established;\n   - (f) the contact email and contact phone number of the registrar, for matters related to the register;\n   - (g) where applicable, the URL of a webpage for additional information about the registrar and the register;\n   - (h) the URL of the webpage where the registration policy that applies to the register and related information are located;\n   - (i) one or more certificates compliant with IETF RFC 3647 which can be used to verify the signature or seal created by the registrar on the register data and for which the certified identity data include the name of the registrar, and where applicable, the registration number of the registrar, as provided in points (c) and (d), respectively.\n- (2) That information referred to in point (1) shall be provided per register and registrar.\n\n**2.**Notifications of information on wallet providers and on the mechanisms by which to validate the authenticity and validity of wallet units**\n\n- (1) Member States shall provide the following information to the Commission on wallet providers:\n   - (a) the name of the wallet provider;\n   - (b) where applicable, the registration number of the wallet provider;\n   - (c) where applicable, the name of the body responsible for the provision of the wallet solution;\n   - (d) the Member State in which the wallet provider is established;\n   - (e) the contact email and contact phone number of the wallet provider, for matters related to the wallet solutions it provides;\n   - (f) where applicable, the URL of the webpage for additional information about the wallet provider and the wallet solution;\n   - (g) the URL of the webpage where the policies, terms and conditions of the wallet provider that apply to the provision and use of the wallet solution it provides are located;\n   - (h) one or more certificates compliant with IETF RFC 3647 that can be used to authenticate and validate the components of the wallet unit the wallet provides, and for which the certified identity data includes the name, and where applicable, the registration number of the wallet provider, as specified in points (a) and (b), respectively;\n   - (i) for each wallet solution provided by the wallet provider, the name and the reference number of the wallet solution it provides, as the Commission shall publish this information in the *Official Journal of the European Union* pursuant to Article 5d of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>.\n- (2) That information referred to in point (1) shall be provided per provider.\n\n**3.**Notifications of information on providers of person identification data and on the mechanisms enabling the authentication and validation of person identification data**\n\n- (1) Member States shall provide the following information to the Commission on providers of person identification data:\n   - (a) the name of the provider of person identification data;\n   - (b) where applicable, a registration number of the provider of person identification data;\n   - (c) where applicable, the name of the body responsible for ensuring that the person identification data is associated with the wallet unit;\n   - (d) the Member State in which the provider of person identification data is established;\n   - (e) the contact email and contact phone number of the provider of person identification data, for matters related to the person identification data it provides;\n   - (f) where applicable, the URL of the webpage that contains additional information about the person identification data provider;\n   - (g) the URL of the webpage that contains the policies, terms and conditions of the provider of person identification data that apply to the provision and use of the person identification data it provides;\n   - (h) one or more certificates compliant with IETF RFC 3647 that can be used to verify the signature or seal created by the provider of person identification data on the person identification data it provides, and for which the certified identity data include the name, and where applicable, the registration number of the person identification data provider, as specified in points (a) and (b), respectively.\n- (2) That information referred to in point (1) shall be provided per provider.\n\n**4.**Notifications of information on providers of wallet-relying party access certificates**\n\n- (1) Member States shall provide the following information to the Commission on providers of wallet-relying party access certificates:\n   - (a) the name of the provider of wallet-relying party access certificates;\n   - (b) where applicable, a registration number of the provider of wallet-relying party access certificates;\n   - (c) the Member State in which the provider of wallet-relying party access certificates is established;\n   - (d) the contact email and contact phone number of the provider of wallet-relying party access certificates, for matters related to the access certificates it provides to wallet-relying parties;\n   - (e) where applicable, the URL of the webpage of the provider of wallet-relying party access certificates that contains additional information about the provider and the access certificates it provides to wallet-relying parties;\n   - (f) the URL of the webpage that contains the policies, terms and conditions that apply to the provision and use of the access certificates it provides to wallet-relying parties;\n   - (g) one or more certificates compliant with IETF RFC 3647 that can be used to verify the signature or seal created by the provider of wallet-relying party access certificates on the access certificate it provides to wallet-relying parties, with, where applicable, the information required to distinguish wallet-relying party access certificates from other certificates.\n- (2) The information referred to in point (1) shall be provided per provider of wallet-relying party access certificates.\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN COMMISSION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union,</em></p>\n<p><em>Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"10\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> [OJ L 257, 28.8.2014, p. 73, ELI: <a href=\"http://data.europa.eu/eli/reg/2014/910/oj.%5C\">http://data.europa.eu/eli/reg/2014/910/oj.\\</a>], and in particular Article 5a(23) thereof,</em></p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) The European Digital Identity Framework established by <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> is a crucial component in the establishment of a secure and interoperable digital identity ecosystem across the Union. With the European Digital Identity Wallets ('wallets') being the cornerstone of the framework, it aims at facilitating access to services across Member States, while ensuring the protection of personal data and privacy.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) Regulation (EU) 2016/679 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span>, or Regulation (EU) 2018/1725 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to all personal data processing activities under this Regulation.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) Article 5a(23) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> mandates the Commission, where necessary, to establish relevant specifications and procedures. This is achieved by means of four Implementing Regulations, dealing with protocols and interfaces: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2024/2982\" data-celex=\"32024R2982\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2982\">Commission Implementing Regulation (EU) 2024/2982</span>, integrity and core functionalities: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2024/2979\" data-celex=\"32024R2979\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2979\">Commission Implementing Regulation (EU) 2024/2979</span>, person identification data and electronic attestation of attributes: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/2977\" data-celex=\"32024R2977\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2977\">Commission Implementing Regulation (EU) 2024/2977</span>, as well as the notifications to the Commission: <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Regulation 2024/2980\" data-celex=\"32024R2980\" data-internal=\"true\" data-url=\"#/implementing-acts/2024-2980\">Commission Implementing Regulation (EU) 2024/2980</span>. This Regulation lays down the relevant requirements for Member States’ notifications of trusted entities that establish trustworthiness of the European Digital Identity Framework.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) The Commission regularly assesses new technologies, practices, standards or technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Regulation rely on the work carried out on the basis of Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Framework [OJ L 210, 14.6.2021, p. 51, ELI: <a href=\"http://data.europa.eu/eli/reco/2021/946/oj.%5C\">http://data.europa.eu/eli/reco/2021/946/oj.\\</a>] and in particular the architecture and reference framework. In accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"16\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183?section=recital-75\">Recital 75 of Regulation (EU) 2024/1183</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"8\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, the Commission should review and update this Implementing Regulation, if necessary, to keep it in line with global developments, the architecture and reference framework, and to follow the best practices on the internal market.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) To meet the objective of establishing a transparent and reliable source of information for authenticating entities in the European Digital Identity Wallet ecosystem, such as wallet providers, providers of person identification data and wallet-relying parties, Member States should notify the required information to the electronic system provided by the Commission. In line with the approach taken by <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"9\" data-short=\"Decision 2015/1984\" data-celex=\"32015D1984\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dec_impl/2015/1984/oj\">Commission Implementing Decision (EU) 2015/1984</span> defining the circumstances, formats and procedures of notification with respect to electronic identification schemes applicable to electronic identification means, information should be provided by the Member States to the Commission in English. In this manner, descriptions of electronic identification schemes are available in English for all such schemes, irrespective of whether they relate to electronic identification means or to wallets.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) For the same objective of establishing information sources that enable the authentication of entities in the European Digital Identity Wallet ecosystem, the Commission should establish an infrastructure to make the information available to the public in a secure, human-readable, clear, and easily accessible manner, as well as in an electronically signed or sealed form suitable for automated processing, including by offering an application programming interface.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) The European Data Protection Supervisor was consulted in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"18\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Article 42(1) of Regulation (EU) 2018/1725</span>, and delivered its opinion on 30 September 2024.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) The measures provided for in this Regulation are in accordance with the opinion of the Committee referred to in Article 48 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>,</p>\n</li>\n</ul>\n<p><strong>HAS ADOPTED THIS REGULATION:</strong></p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Subject matter and scope</strong></p>\n<p>This Regulation establishes obligations in relation to notifications that enable the validation of:</p>\n<ul>\n<li id=\"article-1-para-1\" data-para=\"1\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>(1) the electronic registers used by a Member State to publish information on wallet-relying parties registered in that Member State in accordance with Article 5b(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span> ('registers of wallet-relying parties'), the location of the registers of wallet-relying parties, and the identification of the registrars of wallet-relying parties;</p>\n</li>\n<li id=\"article-1-para-2\" data-para=\"2\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>(2) the identity of the registered wallet-relying parties;</p>\n</li>\n<li id=\"article-1-para-3\" data-para=\"3\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>(3) the authenticity and validity of wallet units;</p>\n</li>\n<li id=\"article-1-para-4\" data-para=\"4\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>(4) the identification of the wallet providers;</p>\n</li>\n<li id=\"article-1-para-5\" data-para=\"5\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>(5) the authenticity of person identification data;</p>\n</li>\n<li id=\"article-1-para-6\" data-para=\"6\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>(6) the identification of the providers of person identification data;</p>\n<blockquote>\n<p>to be updated on a regular basis to keep in line with technology and standards developments and with the work carried out on the basis of Recommendation (EU) 2021/946, and in particular the architecture and reference framework.</p>\n</blockquote>\n</li>\n</ul>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>For the purpose of this Regulation, the following definitions apply:</p>\n<ul>\n<li id=\"article-2-para-1\" data-para=\"1\" data-context=\"article-2\" class=\"linkable-paragraph\">(1) 'wallet provider' means a natural or legal person who provides wallet solutions;</li>\n<li id=\"article-2-para-2\" data-para=\"2\" data-context=\"article-2\" class=\"linkable-paragraph\">(2) 'provider of person identification data' means a natural or legal person responsible for issuing and revoking the person identification data and ensuring that the person identification data of a user is cryptographically bound to a wallet unit;</li>\n<li id=\"article-2-para-3\" data-para=\"3\" data-context=\"article-2\" class=\"linkable-paragraph\">(3) 'wallet-relying party' means a relying party that intends to rely upon wallet units for the provision of public or private services by means of digital interaction;</li>\n<li id=\"article-2-para-4\" data-para=\"4\" data-context=\"article-2\" class=\"linkable-paragraph\">(4) 'register of wallet-relying parties' means an electronic register used by a Member State to make information on wallet-relying parties registered in that Member State publicly available as set out in Article 5b(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>;</li>\n<li id=\"article-2-para-5\" data-para=\"5\" data-context=\"article-2\" class=\"linkable-paragraph\">(5) 'registrar of wallet-relying parties' means the body responsible for establishing and maintaining the list of registered wallet-relying parties established in their territory who has been designated by a Member State;</li>\n<li id=\"article-2-para-6\" data-para=\"6\" data-context=\"article-2\" class=\"linkable-paragraph\">(6) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;</li>\n<li id=\"article-2-para-7\" data-para=\"7\" data-context=\"article-2\" class=\"linkable-paragraph\">(7) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;</li>\n<li id=\"article-2-para-8\" data-para=\"8\" data-context=\"article-2\" class=\"linkable-paragraph\">(8) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;</li>\n<li id=\"article-2-para-9\" data-para=\"9\" data-context=\"article-2\" class=\"linkable-paragraph\">(9) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;</li>\n<li id=\"article-2-para-10\" data-para=\"10\" data-context=\"article-2\" class=\"linkable-paragraph\">(10) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;</li>\n<li id=\"article-2-para-11\" data-para=\"11\" data-context=\"article-2\" class=\"linkable-paragraph\">(11) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;</li>\n<li id=\"article-2-para-12\" data-para=\"12\" data-context=\"article-2\" class=\"linkable-paragraph\">(12) 'wallet user' means a user who is in control of the wallet unit;</li>\n<li id=\"article-2-para-13\" data-para=\"13\" data-context=\"article-2\" class=\"linkable-paragraph\">(13) 'provider of wallet-relying party access certificates' means a natural or legal person mandated by a Member State to issue relying party access certificates to wallet-relying parties registered in that Member State;</li>\n<li id=\"article-2-para-14\" data-para=\"14\" data-context=\"article-2\" class=\"linkable-paragraph\">(14) 'wallet-relying party access certificate' means a certificate for electronic seals or signatures authenticating and validating the wallet-relying party issued by a provider of wallet-relying party access certificates.</li>\n</ul>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Notification system</strong></p>\n<ol>\n<li id=\"article-3-para-1\" data-para=\"1\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>The Commission shall make available to Member States a secure electronic notification system, no later than twelve months after the publication of this Regulation in the <em>Official Journal of the European Union</em>, enabling Member States to notify the information on the bodies and mechanisms referred to in Article 5a(18) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>.</p>\n</li>\n<li id=\"article-3-para-2\" data-para=\"2\" data-context=\"article-3\" class=\"linkable-paragraph\">\n<p>The secure electronic notification system shall comply with the technical requirements laid down in Annex I.</p>\n</li>\n</ol>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>Notifications by Member States</strong></p>\n<ol>\n<li id=\"article-4-para-1\" data-para=\"1\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Member States shall submit, through the secure electronic notification system referred to in Article 3(1), at least the information specified in Annex II.</p>\n</li>\n<li id=\"article-4-para-2\" data-para=\"2\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>Member States shall make the notifications at least in English. Member States shall not be obliged to translate any document supporting the notifications where this would create an unreasonable administrative or financial burden.</p>\n</li>\n<li id=\"article-4-para-3\" data-para=\"3\" data-context=\"article-4\" class=\"linkable-paragraph\">\n<p>The Commission may request additional information or clarifications from the Member States for the purpose of verifying the completeness and consistency of the notified information.</p>\n</li>\n</ol>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Publications by the Commission</strong></p>\n<ol>\n<li id=\"article-5-para-1\" data-para=\"1\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The Commission shall establish, maintain and publish a list compiling the information notified by Member States on registrars of wallet-relying parties and registers of wallet-relying parties as referred to in Annex II section 1.</p>\n</li>\n<li id=\"article-5-para-2\" data-para=\"2\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The Commission shall establish, maintain and publish a list compiling the information notified by Member States on wallet providers, providers of person identification data and providers of wallet-relying party access certificates, as referred to in Annex II sections 2, 3 and 4.</p>\n</li>\n<li id=\"article-5-para-3\" data-para=\"3\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>The Commission shall ensure the lists referred to in paragraphs 1 and 2 of this Article can be accessed:</p>\n<ul>\n<li id=\"article-5-para-3-point-a\" data-point=\"a\" data-context=\"article-5\" data-para=\"3\" class=\"linkable-point\">(a) in both electronically signed or sealed form suitable for automated processing and through a human readable website available in at least English;</li>\n<li id=\"article-5-para-3-point-b\" data-point=\"b\" data-context=\"article-5\" data-para=\"3\" class=\"linkable-point\">(b) without the need to register or to be authenticated to obtain or read the lists;</li>\n<li id=\"article-5-para-3-point-c\" data-point=\"c\" data-context=\"article-5\" data-para=\"3\" class=\"linkable-point\">(c) securely by using state of the art transport layer encryption.</li>\n</ul>\n</li>\n<li id=\"article-5-para-4\" data-para=\"4\" data-context=\"article-5\" class=\"linkable-paragraph\">\n<p>In addition to the publications of the lists referred to in paragraphs 1 and 2, the Commission shall publish:</p>\n<ul>\n<li id=\"article-5-para-4-point-a\" data-point=\"a\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(a) the technical specifications the Commission uses for the structure of the lists;</li>\n<li id=\"article-5-para-4-point-b\" data-point=\"b\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(b) the details of the URL where the lists are published;</li>\n<li id=\"article-5-para-4-point-c\" data-point=\"c\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(c) the certificates to be used to verify the signature or seal on the lists;</li>\n<li id=\"article-5-para-4-point-d\" data-point=\"d\" data-context=\"article-5\" data-para=\"4\" class=\"linkable-point\">(d) the details on mechanisms used to validate changes to the location referred to in point (b) or to the certificates referred to in point (c).</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Regulation shall enter into force on the twentieth day following that of its publication in the</p>\n<hr>\n<p>This Regulation shall be binding in its entirety and directly applicable in all Member States.</p>\n<p>Done at Brussels, 28 November 2024.</p>\n<p><em>For the Commission</em></p>\n<p><em>The President</em></p>\n<p>Ursula von der Leyen</p>\n<h2 id=\"annex-i\">ANNEX I</h2>\n<h2 id=\"annex-ii\">ANNEX II</h2>\n<p>**1.<strong>Notifications of information on registrars and registers</strong></p>\n<ul>\n<li id=\"annex-ii-para-1\" data-para=\"1\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(1) Member States shall provide the following information to the Commission on their registrars and registers:\n<ul>\n<li id=\"annex-ii-para-1-point-a\" data-point=\"a\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(a) the name of the register;</li>\n<li id=\"annex-ii-para-1-point-b\" data-point=\"b\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(b) at least one URL where the register is available for access, which shall use state of the art transport layer encryption;</li>\n<li id=\"annex-ii-para-1-point-c\" data-point=\"c\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(c) the name of the registrar that is responsible for that register;</li>\n<li id=\"annex-ii-para-1-point-d\" data-point=\"d\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(d) where applicable, the registration number of the registrar;</li>\n<li id=\"annex-ii-para-1-point-e\" data-point=\"e\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(e) the Member State in which the registrar is established;</li>\n<li id=\"annex-ii-para-1-point-f\" data-point=\"f\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(f) the contact email and contact phone number of the registrar, for matters related to the register;</li>\n<li id=\"annex-ii-para-1-point-g\" data-point=\"g\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(g) where applicable, the URL of a webpage for additional information about the registrar and the register;</li>\n<li id=\"annex-ii-para-1-point-h\" data-point=\"h\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(h) the URL of the webpage where the registration policy that applies to the register and related information are located;</li>\n<li id=\"annex-ii-para-1-point-i\" data-point=\"i\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(i) one or more certificates compliant with IETF RFC 3647 which can be used to verify the signature or seal created by the registrar on the register data and for which the certified identity data include the name of the registrar, and where applicable, the registration number of the registrar, as provided in points (c) and (d), respectively.</li>\n</ul>\n</li>\n<li id=\"annex-ii-para-2\" data-para=\"2\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(2) That information referred to in point (1) shall be provided per register and registrar.</li>\n</ul>\n<p>**2.<strong>Notifications of information on wallet providers and on the mechanisms by which to validate the authenticity and validity of wallet units</strong></p>\n<ul>\n<li id=\"annex-ii-para-1\" data-para=\"1\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(1) Member States shall provide the following information to the Commission on wallet providers:\n<ul>\n<li id=\"annex-ii-para-1-point-a\" data-point=\"a\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(a) the name of the wallet provider;</li>\n<li id=\"annex-ii-para-1-point-b\" data-point=\"b\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(b) where applicable, the registration number of the wallet provider;</li>\n<li id=\"annex-ii-para-1-point-c\" data-point=\"c\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(c) where applicable, the name of the body responsible for the provision of the wallet solution;</li>\n<li id=\"annex-ii-para-1-point-d\" data-point=\"d\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(d) the Member State in which the wallet provider is established;</li>\n<li id=\"annex-ii-para-1-point-e\" data-point=\"e\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(e) the contact email and contact phone number of the wallet provider, for matters related to the wallet solutions it provides;</li>\n<li id=\"annex-ii-para-1-point-f\" data-point=\"f\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(f) where applicable, the URL of the webpage for additional information about the wallet provider and the wallet solution;</li>\n<li id=\"annex-ii-para-1-point-g\" data-point=\"g\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(g) the URL of the webpage where the policies, terms and conditions of the wallet provider that apply to the provision and use of the wallet solution it provides are located;</li>\n<li id=\"annex-ii-para-1-point-h\" data-point=\"h\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(h) one or more certificates compliant with IETF RFC 3647 that can be used to authenticate and validate the components of the wallet unit the wallet provides, and for which the certified identity data includes the name, and where applicable, the registration number of the wallet provider, as specified in points (a) and (b), respectively;</li>\n<li id=\"annex-ii-para-1-point-i\" data-point=\"i\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(i) for each wallet solution provided by the wallet provider, the name and the reference number of the wallet solution it provides, as the Commission shall publish this information in the <em>Official Journal of the European Union</em> pursuant to Article 5d of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"12\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/910-2014\">Regulation (EU) No 910/2014</span>.</li>\n</ul>\n</li>\n<li id=\"annex-ii-para-2\" data-para=\"2\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(2) That information referred to in point (1) shall be provided per provider.</li>\n</ul>\n<p>**3.<strong>Notifications of information on providers of person identification data and on the mechanisms enabling the authentication and validation of person identification data</strong></p>\n<ul>\n<li id=\"annex-ii-para-1\" data-para=\"1\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(1) Member States shall provide the following information to the Commission on providers of person identification data:\n<ul>\n<li id=\"annex-ii-para-1-point-a\" data-point=\"a\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(a) the name of the provider of person identification data;</li>\n<li id=\"annex-ii-para-1-point-b\" data-point=\"b\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(b) where applicable, a registration number of the provider of person identification data;</li>\n<li id=\"annex-ii-para-1-point-c\" data-point=\"c\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(c) where applicable, the name of the body responsible for ensuring that the person identification data is associated with the wallet unit;</li>\n<li id=\"annex-ii-para-1-point-d\" data-point=\"d\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(d) the Member State in which the provider of person identification data is established;</li>\n<li id=\"annex-ii-para-1-point-e\" data-point=\"e\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(e) the contact email and contact phone number of the provider of person identification data, for matters related to the person identification data it provides;</li>\n<li id=\"annex-ii-para-1-point-f\" data-point=\"f\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(f) where applicable, the URL of the webpage that contains additional information about the person identification data provider;</li>\n<li id=\"annex-ii-para-1-point-g\" data-point=\"g\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(g) the URL of the webpage that contains the policies, terms and conditions of the provider of person identification data that apply to the provision and use of the person identification data it provides;</li>\n<li id=\"annex-ii-para-1-point-h\" data-point=\"h\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(h) one or more certificates compliant with IETF RFC 3647 that can be used to verify the signature or seal created by the provider of person identification data on the person identification data it provides, and for which the certified identity data include the name, and where applicable, the registration number of the person identification data provider, as specified in points (a) and (b), respectively.</li>\n</ul>\n</li>\n<li id=\"annex-ii-para-2\" data-para=\"2\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(2) That information referred to in point (1) shall be provided per provider.</li>\n</ul>\n<p>**4.<strong>Notifications of information on providers of wallet-relying party access certificates</strong></p>\n<ul>\n<li id=\"annex-ii-para-1\" data-para=\"1\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(1) Member States shall provide the following information to the Commission on providers of wallet-relying party access certificates:\n<ul>\n<li id=\"annex-ii-para-1-point-a\" data-point=\"a\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(a) the name of the provider of wallet-relying party access certificates;</li>\n<li id=\"annex-ii-para-1-point-b\" data-point=\"b\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(b) where applicable, a registration number of the provider of wallet-relying party access certificates;</li>\n<li id=\"annex-ii-para-1-point-c\" data-point=\"c\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(c) the Member State in which the provider of wallet-relying party access certificates is established;</li>\n<li id=\"annex-ii-para-1-point-d\" data-point=\"d\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(d) the contact email and contact phone number of the provider of wallet-relying party access certificates, for matters related to the access certificates it provides to wallet-relying parties;</li>\n<li id=\"annex-ii-para-1-point-e\" data-point=\"e\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(e) where applicable, the URL of the webpage of the provider of wallet-relying party access certificates that contains additional information about the provider and the access certificates it provides to wallet-relying parties;</li>\n<li id=\"annex-ii-para-1-point-f\" data-point=\"f\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(f) the URL of the webpage that contains the policies, terms and conditions that apply to the provision and use of the access certificates it provides to wallet-relying parties;</li>\n<li id=\"annex-ii-para-1-point-g\" data-point=\"g\" data-context=\"annex-ii\" data-para=\"1\" class=\"linkable-point\">(g) one or more certificates compliant with IETF RFC 3647 that can be used to verify the signature or seal created by the provider of wallet-relying party access certificates on the access certificate it provides to wallet-relying parties, with, where applicable, the information required to distinguish wallet-relying party access certificates from other certificates.</li>\n</ul>\n</li>\n<li id=\"annex-ii-para-2\" data-para=\"2\" data-context=\"annex-ii\" class=\"linkable-paragraph\">(2) The information referred to in point (1) shall be provided per provider of wallet-relying party access certificates.</li>\n</ul>",
  "wordCount": 2959,
  "lastProcessed": "2026-01-18T00:34:52.120Z",
  "preambleInjected": false
}