{
  "slug": "2025-2532",
  "type": "implementing-act",
  "legalType": "regulation",
  "category": "implementing_act",
  "title": "Commission Implementing Regulation (EU) 2025/2532 of 16 December 2025 laying down rules for the application of Regulation (EU) No 910/2014 of the European Parliament and of the Council as regards reference standards and specifications for qualified electronic archiving services",
  "shortTitle": "Archiving Services",
  "sidebarTitle": null,
  "description": "Commission Implementing Regulation (EU) 2025/2532 of 16 December 2025 laying down rules for the application of Regulation (EU) No 910/2014 of the European Parliament and of the Council as regards reference standards and specifications for qualified electronic archiving services",
  "celex": "32025R2532",
  "date": "16 December 2025",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32025R2532",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "annex",
      "title": "ANNEX",
      "level": 2
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> \\[OJ L 257, 28.8.2014, p. 73, ELI: http://data.europa.eu/eli/reg/2014/910/oj.\\], and in particular Article 45j(2) thereof,*\n\n## Recitals\n\n- (1) By Regulation (EU) 2024/1183 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, a list of new trust services and qualified trust services, including the qualified electronic archiving service, was introduced in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>. The Commission is to establish a list of reference standards and, where necessary, establish specifications for such services.\n\n- (2) Electronic archiving is a service for the receipt, storage, retrieval and deletion of electronic data and electronic documents to ensure their durability and legibility as well as to preserve their integrity, confidentiality and proof of origin throughout the preservation period. Qualified electronic archiving services play a crucial role in the digital business environment by promoting the transition from traditional paper-based processes to electronic equivalents. To ensure that electronic data and electronic documents preserve the presumption of their integrity and of their origin for the duration of the preservation period by the qualified trust service provider, and to achieve a high level of transparency and confidence among all participants in the information lifecycle, it is necessary to establish a common set of specifications for qualified electronic archiving services.\n\n- (3) To increase the evidentiary value, security and trustworthiness of qualified electronic archiving services, where electronic signatures, electronic seals or electronic time stamps are used to create, sign, seal or attest the date and time of, for example, archiving evidences, evidence records, records of events, records of the correct implementation of procedures, or archiving confirmation reports, qualified trust services should be used.\n\n- (4) The presumption of compliance laid down in Article 45j(2) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> should only apply where qualified electronic archiving services comply with the requirements set out in this Regulation. The reference standards for qualified electronic archiving services should reflect established practices and be widely recognised within the relevant sectors. They should be adapted to include additional controls ensuring the security and trustworthiness of the qualified electronic archiving services.\n\n- (5) If a trust service provider adheres to the requirements set out in this Regulation, supervisory bodies should presume compliance with the relevant requirements of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> and duly consider such presumption for granting or confirming the qualified status of the trust service. However, a qualified trust services provider may still rely on other practices to demonstrate compliance with the requirements of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>.\n\n- (6) In order to preserve the integrity and proof of origin of electronic data and electronic documents containing one or more qualified electronic signatures or seals, qualified electronic archiving services should use procedures and technologies capable of extending the trustworthiness of those electronic signatures and seals beyond the technological validity period, at least throughout the preservation period.\n\n- (7) The Commission regularly assesses new technologies, practices, standards or technical specifications. In accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"15\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183?section=recital-75\">recital 75 of Regulation (EU) 2024/1183</span>, the Commission should review and, if necessary, update this Regulation, to keep it in line with global developments, new technologies, practices, standards or technical specifications and to follow the best practices on the internal market.\n\n- (8) Regulation (EU) 2016/679 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to the personal data processing activities under this Regulation.\n\n- (9) The European Data Protection Supervisor was consulted in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"16\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Article 42(1) of Regulation (EU) 2018/1725</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span> and delivered its opinion on 21 October 2025 \\[EDPS Formal comments on the draft Implementing Regulation laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> as regards reference standards and specifications for qualified electronic archiving services.\\].\n\n- (10) The measures provided for in this Regulation are in accordance with the opinion of the committee established by Article 48 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>,\n\n**HAS ADOPTED THIS REGULATION:**\n\n## Enacting Terms\n\n### Article 1\n**Electronic archiving of documents bearing a qualified electronic signature or a qualified electronic seal**\n\n1. When archiving electronic data or electronic documents that contain qualified electronic signatures or qualified electronic seals, providers of qualified electronic archiving services shall ensure that the trustworthiness of those qualified electronic signatures or qualified electronic seals is maintained, including beyond their technological validity period, and that the integrity and the accuracy of the origin of the qualified electronic signatures and seals is maintained, at least until the end of the legal or contractual preservation period.\n\n2. For the purposes of paragraph 1, providers of qualified electronic archiving services may rely on a qualified preservation service for qualified electronic signatures or on a qualified preservation service for qualified electronic seals.\n\n### Article 2\n**Reference standards and specifications for the provision of qualified electronic archiving services**\n\nThe reference standards and specifications referred to in Article 45j(2) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> are set out in the Annex to this Regulation.\n\n### Article 3\n**Entry into force**\n\nThis Regulation shall enter into force on the twentieth day following that of its publication in the\n\n---\n\nThis Regulation shall be binding in its entirety and directly applicable in all Member States.\n\nDone at Brussels, 16 December 2025.\n\n*For the Commission*\n\n*The President*\n\nUrsula von der Leyen\n\n\n## ANNEX\n\nCEN/TS 18170:2025 ('CEN/TS 18170') applies with the following adaptations:\n\n- (a) Normative references (clause 2)\n     - ETSI EN 319401 V3.1.1 (2024-06), Electronic Signatures and Trust Infrastructures (ESI); General Policy Requirements for Trust Service Providers\n     - ETSI EN 319421 V1.3.1 (2025-07), Electronic Signatures and Infrastructures (ESI); Policy and Security Requirements for Trust Service Providers issuing Time-Stamps\n     - ISO 14721:2025, Space Data System Practices – Reference model for an open archival information system (OAIS)\n     - ACM-ECCG, European Cybersecurity Certification Group, Sub-group on Cryptography: 'Agreed Cryptographic Mechanisms' published by the European Union Agency for Cybersecurity ('ENISA').\n     - CIR (EU) 2024/482, <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2024/482\" data-celex=\"32024R0482\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2024/482/oj\">Commission Implementing Regulation (EU) 2024/482</span>.\n     - CIR (EU) 2024/3144, <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/3144\" data-celex=\"32024R3144\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2024/3144/oj\">Commission Implementing Regulation (EU) 2024/3144</span>.\n     - ISO/IEC 15408:2022 (parts 1 to 5), 'Information security, cybersecurity and privacy protection – Evaluation criteria for IT security'.\n     - FIPS PUB 140-3 (2019), Security Requirements for Cryptographic Modules.\n- (b) Policy and practice statement (clause 6.1)\n     - The requirements of CEN/TS 18170, clause 6.1 shall apply.\n     - The requirements of ETSI EN 319401, clause 5 shall apply.\n     - The EATSP shall establish procedures to notify the supervisory body of any changes in the provision of the electronic archiving trust service and on the intention to cease those activities, in accordance with business requirements and relevant laws and regulations, including in accordance with the requirements of the implementing acts adopted pursuant to Article 24(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> [i.2].\n     - The EATSP shall notify the competent supervisory body at least:\n- (c) Terms and Conditions (clause 6.2)\n     - The requirements of CEN/TS 18170, clause 6.2 shall apply.\n     - Subscribers and parties relying on the electronic archiving trust service shall be informed, in a clear, comprehensive and easily accessible manner, in a publicly accessible space and individually, of precise terms and conditions, before entering into a contractual relationship.\n- (d) Human resources (clause 7.3)\n     - The requirements of CEN/TS 18170, clause 7.3 shall apply.\n     - EATSP’s personnel in trusted roles, and if applicable its subcontractors in trusted roles, shall be able to fulfil the requirement of 'expert knowledge, experience and qualifications' through formal training and credentials, or actual experience, or a combination of the two. This shall include regular updates (at least every 12 months) on new threats and current security practices.\n- (e) Cryptographic controls and monitoring (clause 7.6)\n     - The archiving system must guarantee the confidentiality of data and documents through the lifecycle of the archive from its deposit to its elimination.\n     - The requirements specified in ETSI EN 319401, sub-clause 7.5 \"Cryptographic controls\" shall apply.\n     - The origin of the data to be archived in the electronic archiving system shall be established by the EATSP If they use electronic signatures or electronic seals to do so, those electronic signatures or electronic seals shall be qualified.\n   - (a) Common Criteria for Information Technology Security Evaluation, as set out in ISO/IEC 15408 or in Common Criteria for Information Technology Security Evaluation, version CC:2022, Parts 1 through 5, published by the participants of the Arrangement on the Recognition of Common Criteria Certificates in the field of IT Security, and certified to EAL 4 or higher; or\n     - This certification shall be to a security target or protection profile, or to a module design and security documentation, which meets the requirements of the present document, based on a risk analysis and taking into account physical and other non-technical security measures.\n     - If the secure cryptographic device benefits from an EUCC certification (IR (EU) 2024/482, CIR (EU) 2024/3144), then this device shall be configured and used in accordance with that certification.\n     - The EATSP shall monitor the strength of cryptographic algorithm that was and are used. In case, one of the used algorithms or parameters is thought to become not suitable as defined in the risk management, the EATSP shall either update the related archiving policy or create a new archiving profile to handle the AIPs and define and perform appropriate measures.\n     - The evaluation of the cryptographic algorithms and their use by the EATSP shall be compliant with the Agreed Cryptographic Mechanisms endorsed by the European Cybersecurity Certification Group and published by ENISA (ACM-ECCG).\n     - Technical components of the EATS shall authenticate each other based on cryptographic techniques before communicating.\n- (f) Network (clause 7.9)\n     - The requirements specified in ETSI EN 319401, sub-clause 7.8 \"Network security\" shall apply.\n     - The vulnerability scan requested by REQ-7.8-13 of ETSI EN 319401 shall be performed at least once per quarter.\n     - The penetration test requested by REQ-7.8-17X of ETSI EN 319401 shall be performed at least once per year.\n     - Firewalls shall be configured to prevent all protocols and accesses not required for the operation of the EATSP.\n- (g) Collection of evidence (clause 7.11)\n     - The requirements specified in ETSI EN 319401, sub-clause 7.10 \"Collection of evidence\" shall apply, including for critical and non-critical events (see subclause 13.2)\n- (h) EATSP termination and termination plan (clause 7.13)\n     - The requirements of CEN/TS 18170, clause 7.13) shall apply.\n     - The EATSP’s termination plan shall comply with the requirements set out in the implementing acts adopted pursuant to Article 24(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>.\n- (i) Reliable time of events (clause 13.3.1)\n     - The requirements of CEN/TS 18170, clause 13.3.1) shall apply.\n     - When using timestamps the EATSP shall use a qualified timestamp.\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN COMMISSION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union,</em></p>\n<p><em>Having regard to <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> of the European Parliament and of the Council of 23 July 2014 on <span class=\"term-link\" data-term-id=\"electronic-identification\" tabindex=\"0\">electronic identification</span> and <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> for electronic transactions in the internal market and repealing <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"7\" data-short=\"Directive 1999/93/EC\" data-celex=\"31999L0093\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:31999L0093\">Directive 1999/93/EC</span> [OJ L 257, 28.8.2014, p. 73, ELI: <a href=\"http://data.europa.eu/eli/reg/2014/910/oj.%5C\">http://data.europa.eu/eli/reg/2014/910/oj.\\</a>], and in particular Article 45j(2) thereof,</em></p>\n<h2 id=\"recitals\">Recitals</h2>\n<ul>\n<li id=\"recital-1\" data-recital=\"1\" class=\"linkable-recital\">\n<p>(1) By Regulation (EU) 2024/1183 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"1\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183\">Regulation 2024/1183</span>, a list of new <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> and <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span>, including the <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving service</span>, was introduced in <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>. The Commission is to establish a list of reference <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and, where necessary, establish specifications for such services.</p>\n</li>\n<li id=\"recital-2\" data-recital=\"2\" class=\"linkable-recital\">\n<p>(2) <span class=\"term-link\" data-term-id=\"electronic-archiving\" tabindex=\"0\">Electronic archiving</span> is a service for the receipt, storage, retrieval and deletion of electronic data and <span class=\"term-link\" data-term-id=\"electronic-document\" tabindex=\"0\">electronic documents</span> to ensure their durability and legibility as well as to preserve their integrity, confidentiality and proof of origin throughout the preservation period. <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">Qualified electronic archiving services</span> play a crucial role in the digital business environment by promoting the transition from traditional paper-based processes to electronic equivalents. To ensure that electronic data and <span class=\"term-link\" data-term-id=\"electronic-document\" tabindex=\"0\">electronic documents</span> preserve the presumption of their integrity and of their origin for the duration of the preservation period by the <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service provider</span>, and to achieve a high level of transparency and confidence among all participants in the information lifecycle, it is necessary to establish a common set of specifications for <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span>.</p>\n</li>\n<li id=\"recital-3\" data-recital=\"3\" class=\"linkable-recital\">\n<p>(3) To increase the evidentiary value, security and trustworthiness of <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span>, where <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>, <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> or <span class=\"term-link\" data-term-id=\"electronic-time-stamp\" tabindex=\"0\">electronic time stamps</span> are used to create, sign, seal or attest the date and time of, for example, archiving evidences, evidence records, records of events, records of the correct implementation of procedures, or archiving confirmation reports, <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> should be used.</p>\n</li>\n<li id=\"recital-4\" data-recital=\"4\" class=\"linkable-recital\">\n<p>(4) The presumption of compliance laid down in Article 45j(2) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> should only apply where <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span> comply with the requirements set out in this Regulation. The reference <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span> should reflect established practices and be widely recognised within the relevant sectors. They should be adapted to include additional controls ensuring the security and trustworthiness of the <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span>.</p>\n</li>\n<li id=\"recital-5\" data-recital=\"5\" class=\"linkable-recital\">\n<p>(5) If a <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">trust service provider</span> adheres to the requirements set out in this Regulation, supervisory bodies should presume compliance with the relevant requirements of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> and duly consider such presumption for granting or confirming the qualified status of the <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust service</span>. However, a <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> provider may still rely on other practices to demonstrate compliance with the requirements of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>.</p>\n</li>\n<li id=\"recital-6\" data-recital=\"6\" class=\"linkable-recital\">\n<p>(6) In order to preserve the integrity and proof of origin of electronic data and <span class=\"term-link\" data-term-id=\"electronic-document\" tabindex=\"0\">electronic documents</span> containing one or more <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> or seals, <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span> should use procedures and technologies capable of extending the trustworthiness of those <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> and seals beyond the technological validity period, at least throughout the preservation period.</p>\n</li>\n<li id=\"recital-7\" data-recital=\"7\" class=\"linkable-recital\">\n<p>(7) The Commission regularly assesses new technologies, practices, <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> or <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span>. In accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"15\" data-short=\"Regulation 2024/1183\" data-celex=\"32024R1183\" data-internal=\"true\" data-url=\"#/regulation/2024-1183?section=recital-75\">recital 75 of Regulation (EU) 2024/1183</span>, the Commission should review and, if necessary, update this Regulation, to keep it in line with global developments, new technologies, practices, <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> or <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> and to follow the best practices on the internal market.</p>\n</li>\n<li id=\"recital-8\" data-recital=\"8\" class=\"linkable-recital\">\n<p>(8) Regulation (EU) 2016/679 of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"2\" data-short=\"Regulation 2016/679\" data-celex=\"32016R0679\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2016/679/oj\">Regulation 2016/679</span> and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"3\" data-short=\"Directive 2002/58\" data-celex=\"32002L0058\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/dir/2002/58/oj\">Directive 2002/58</span> apply to the <span class=\"term-link\" data-term-id=\"personal-data\" tabindex=\"0\">personal data</span> <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span> activities under this Regulation.</p>\n</li>\n<li id=\"recital-9\" data-recital=\"9\" class=\"linkable-recital\">\n<p>(9) The European Data Protection Supervisor was consulted in accordance with <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"16\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Article 42(1) of Regulation (EU) 2018/1725</span> of the European Parliament and of the Council <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"4\" data-short=\"Regulation 2018/1725\" data-celex=\"32018R1725\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg/2018/1725/oj\">Regulation 2018/1725</span> and delivered its opinion on 21 October 2025 [EDPS Formal comments on the draft Implementing Regulation laying down rules for the application of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> as regards reference <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and specifications for <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span>.].</p>\n</li>\n<li id=\"recital-10\" data-recital=\"10\" class=\"linkable-recital\">\n<p>(10) The measures provided for in this Regulation are in accordance with the opinion of the committee established by Article 48 of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>,</p>\n</li>\n</ul>\n<p><strong>HAS ADOPTED THIS REGULATION:</strong></p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong><span class=\"term-link\" data-term-id=\"electronic-archiving\" tabindex=\"0\">Electronic archiving</span> of documents bearing a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> or a <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span></strong></p>\n<ol>\n<li id=\"article-1-para-1\" data-para=\"1\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>When archiving electronic data or <span class=\"term-link\" data-term-id=\"electronic-document\" tabindex=\"0\">electronic documents</span> that contain <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> or <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seals</span>, providers of <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span> shall ensure that the trustworthiness of those <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> or <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seals</span> is maintained, including beyond their technological validity period, and that the integrity and the accuracy of the origin of the <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> and seals is maintained, at least until the end of the legal or contractual preservation period.</p>\n</li>\n<li id=\"article-1-para-2\" data-para=\"2\" data-context=\"article-1\" class=\"linkable-paragraph\">\n<p>For the purposes of paragraph 1, providers of <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span> may rely on a qualified preservation service for <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> or on a qualified preservation service for <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seals</span>.</p>\n</li>\n</ol>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Reference <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and specifications for the provision of <span class=\"term-link\" data-term-id=\"qualified-electronic-archiving-service\" tabindex=\"0\">qualified electronic archiving services</span></strong></p>\n<p>The reference <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> and specifications referred to in Article 45j(2) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> are set out in the Annex to this Regulation.</p>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Regulation shall enter into force on the twentieth day following that of its publication in the</p>\n<hr>\n<p>This Regulation shall be binding in its entirety and directly applicable in all Member States.</p>\n<p>Done at Brussels, 16 December 2025.</p>\n<p><em>For the Commission</em></p>\n<p><em>The President</em></p>\n<p>Ursula von der Leyen</p>\n<h2 id=\"annex\">ANNEX</h2>\n<p>CEN/TS 18170:2025 ('CEN/TS 18170') applies with the following adaptations:</p>\n<ul>\n<li>(a) Normative references (clause 2)\n<ul>\n<li>ETSI EN 319401 V3.1.1 (2024-06), <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">Electronic Signatures</span> and Trust Infrastructures (ESI); General Policy Requirements for <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">Trust Service Providers</span></li>\n<li>ETSI EN 319421 V1.3.1 (2025-07), <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">Electronic Signatures</span> and Infrastructures (ESI); Policy and Security Requirements for <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">Trust Service Providers</span> issuing Time-Stamps</li>\n<li>ISO 14721:2025, Space Data System Practices – Reference model for an open archival information system (OAIS)</li>\n<li>ACM-ECCG, European <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">Cybersecurity</span> Certification Group, Sub-group on Cryptography: 'Agreed Cryptographic Mechanisms' published by the European Union Agency for <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">Cybersecurity</span> ('ENISA').</li>\n<li>CIR (EU) 2024/482, <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"5\" data-short=\"Regulation 2024/482\" data-celex=\"32024R0482\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2024/482/oj\">Commission Implementing Regulation (EU) 2024/482</span>.</li>\n<li>CIR (EU) 2024/3144, <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"6\" data-short=\"Regulation 2024/3144\" data-celex=\"32024R3144\" data-internal=\"false\" data-url=\"https://eur-lex.europa.eu/eli/reg_impl/2024/3144/oj\">Commission Implementing Regulation (EU) 2024/3144</span>.</li>\n<li>ISO/IEC 15408:2022 (parts 1 to 5), 'Information security, <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">cybersecurity</span> and privacy protection – Evaluation criteria for IT security'.</li>\n<li>FIPS PUB 140-3 (2019), Security Requirements for Cryptographic Modules.</li>\n</ul>\n</li>\n<li>(b) Policy and practice statement (clause 6.1)\n<ul>\n<li>The requirements of CEN/TS 18170, clause 6.1 shall apply.</li>\n<li>The requirements of ETSI EN 319401, clause 5 shall apply.</li>\n<li>The EATSP shall establish procedures to notify the supervisory body of any changes in the provision of the <span class=\"term-link\" data-term-id=\"electronic-archiving\" tabindex=\"0\">electronic archiving</span> <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust service</span> and on the intention to cease those activities, in accordance with business requirements and relevant laws and regulations, including in accordance with the requirements of the implementing acts adopted pursuant to Article 24(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span> [i.2].</li>\n<li>The EATSP shall notify the competent supervisory body at least:</li>\n</ul>\n</li>\n<li>(c) Terms and Conditions (clause 6.2)\n<ul>\n<li>The requirements of CEN/TS 18170, clause 6.2 shall apply.</li>\n<li>Subscribers and parties relying on the <span class=\"term-link\" data-term-id=\"electronic-archiving\" tabindex=\"0\">electronic archiving</span> <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust service</span> shall be informed, in a clear, comprehensive and easily accessible manner, in a publicly accessible space and individually, of precise terms and conditions, before entering into a contractual relationship.</li>\n</ul>\n</li>\n<li>(d) Human resources (clause 7.3)\n<ul>\n<li>The requirements of CEN/TS 18170, clause 7.3 shall apply.</li>\n<li>EATSP’s personnel in trusted roles, and if applicable its subcontractors in trusted roles, shall be able to fulfil the requirement of 'expert knowledge, experience and qualifications' through formal training and credentials, or actual experience, or a combination of the two. This shall include regular updates (at least every 12 months) on new threats and current security practices.</li>\n</ul>\n</li>\n<li>(e) Cryptographic controls and monitoring (clause 7.6)\n<ul>\n<li>The archiving system must guarantee the confidentiality of data and documents through the lifecycle of the archive from its deposit to its elimination.</li>\n<li>The requirements specified in ETSI EN 319401, sub-clause 7.5 \"Cryptographic controls\" shall apply.</li>\n<li>The origin of the data to be archived in the <span class=\"term-link\" data-term-id=\"electronic-archiving\" tabindex=\"0\">electronic archiving</span> system shall be established by the EATSP If they use <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> or <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> to do so, those <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> or <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> shall be qualified.</li>\n<li>(a) Common Criteria for Information Technology Security Evaluation, as set out in ISO/IEC 15408 or in Common Criteria for Information Technology Security Evaluation, version CC:2022, Parts 1 through 5, published by the participants of the Arrangement on the Recognition of Common Criteria Certificates in the field of IT Security, and certified to EAL 4 or higher; or\n<ul>\n<li>This certification shall be to a security target or protection profile, or to a module design and security documentation, which meets the requirements of the present document, based on a <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> analysis and taking into account physical and other non-technical security measures.</li>\n<li>If the secure cryptographic device benefits from an EUCC certification (IR (EU) 2024/482, CIR (EU) 2024/3144), then this device shall be configured and used in accordance with that certification.</li>\n<li>The EATSP shall monitor the strength of cryptographic algorithm that was and are used. In case, one of the used algorithms or parameters is thought to become not suitable as defined in the <span class=\"term-link\" data-term-id=\"risk\" tabindex=\"0\">risk</span> management, the EATSP shall either update the related archiving policy or create a new archiving profile to handle the AIPs and define and perform appropriate measures.</li>\n<li>The evaluation of the cryptographic algorithms and their use by the EATSP shall be compliant with the Agreed Cryptographic Mechanisms endorsed by the European <span class=\"term-link\" data-term-id=\"cybersecurity\" tabindex=\"0\">Cybersecurity</span> Certification Group and published by ENISA (ACM-ECCG).</li>\n<li>Technical components of the EATS shall authenticate each other based on cryptographic techniques before communicating.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>(f) Network (clause 7.9)\n<ul>\n<li>The requirements specified in ETSI EN 319401, sub-clause 7.8 \"Network security\" shall apply.</li>\n<li>The <span class=\"term-link\" data-term-id=\"vulnerability\" tabindex=\"0\">vulnerability</span> scan requested by REQ-7.8-13 of ETSI EN 319401 shall be performed at least once per quarter.</li>\n<li>The penetration test requested by REQ-7.8-17X of ETSI EN 319401 shall be performed at least once per year.</li>\n<li>Firewalls shall be configured to prevent all protocols and accesses not required for the operation of the EATSP.</li>\n</ul>\n</li>\n<li>(g) Collection of evidence (clause 7.11)\n<ul>\n<li>The requirements specified in ETSI EN 319401, sub-clause 7.10 \"Collection of evidence\" shall apply, including for critical and non-critical events (see subclause 13.2)</li>\n</ul>\n</li>\n<li>(h) EATSP termination and termination plan (clause 7.13)\n<ul>\n<li>The requirements of CEN/TS 18170, clause 7.13) shall apply.</li>\n<li>The EATSP’s termination plan shall comply with the requirements set out in the implementing acts adopted pursuant to Article 24(5) of <span class=\"citation-ref\" tabindex=\"0\" role=\"button\" data-idx=\"11\" data-short=\"Regulation (EU) No 910/2014\" data-celex=\"32014R0910\" data-internal=\"true\" data-url=\"#/regulation/2014-910\">Regulation (EU) No 910/2014</span>.</li>\n</ul>\n</li>\n<li>(i) Reliable time of events (clause 13.3.1)\n<ul>\n<li>The requirements of CEN/TS 18170, clause 13.3.1) shall apply.</li>\n<li>When using timestamps the EATSP shall use a qualified timestamp.</li>\n</ul>\n</li>\n</ul>",
  "wordCount": 2009,
  "lastProcessed": "2026-01-21T15:11:04.880Z",
  "preambleInjected": false
}