{
  "slug": "2025-0848",
  "type": "implementing-act",
  "title": "Commission Implementing Regulation (EU) 2025/848 of 6 May 2025 laying down rules for the application of Regulation (EU) No 910/2014 of the European Parliament and of the Council as regards the registration of wallet-relying parties",
  "shortTitle": "Relying Party Registration",
  "description": "THE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC [OJ L 257, 28.",
  "celex": "32025R0848",
  "date": "6 May 2025",
  "source": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32025R0848",
  "version": null,
  "toc": [
    {
      "id": "preamble",
      "title": "Preamble",
      "level": 2
    },
    {
      "id": "recitals",
      "title": "Recitals",
      "level": 2
    },
    {
      "id": "enacting-terms",
      "title": "Enacting Terms",
      "level": 2
    },
    {
      "id": "article-1",
      "title": "Article 1",
      "level": 3
    },
    {
      "id": "article-2",
      "title": "Article 2",
      "level": 3
    },
    {
      "id": "article-3",
      "title": "Article 3",
      "level": 3
    },
    {
      "id": "article-4",
      "title": "Article 4",
      "level": 3
    },
    {
      "id": "article-5",
      "title": "Article 5",
      "level": 3
    },
    {
      "id": "article-6",
      "title": "Article 6",
      "level": 3
    },
    {
      "id": "article-7",
      "title": "Article 7",
      "level": 3
    },
    {
      "id": "article-8",
      "title": "Article 8",
      "level": 3
    },
    {
      "id": "article-9",
      "title": "Article 9",
      "level": 3
    },
    {
      "id": "article-10",
      "title": "Article 10",
      "level": 3
    },
    {
      "id": "article-11",
      "title": "Article 11",
      "level": 3
    }
  ],
  "contentMarkdown": "## Preamble\n\nTHE EUROPEAN COMMISSION,\n\n*Having regard to the Treaty on the Functioning of the European Union,*\n\n*Having regard to Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC [OJ L 257, 28.8.2014, p. 73, ELI: http://data.europa.eu/eli/reg/2014/910/oj.], in particular Article 5b(11) thereof,*\n\n## Recitals\n\n(1) For the purposes of registering relying parties that intend to rely on European Digital Identity Wallets ('wallets') for the provision of digital public or private services, as required by Regulation (EU) No 910/2014, Member States should establish and maintain national registers of wallet-relying parties established in their territory.\n\n(2) The Commission regularly assesses new technologies, practices, standards and technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Regulation rely on the work carried out on under Commission Recommendation (EU) 2021/946 [Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework (OJ L 210, 14.6.2021, p. 51, ELI: http://data.europa.eu/eli/reco/2021/946/oj).] and in particular the Architecture and Reference Framework which is part of it. In accordance with recital 75 of Regulation (EU) 2024/1183 of the European Parliament and of the Council [Regulation (EU) 2024/1183 of the European Parliament and of the Council of 11 April 2024 amending Regulation (EU) No 910/2014 as regards establishing the European Digital Identity Framework (OJ L, 2024/1183, 30.4.2024, ELI: http://data.europa.eu/eli/reg/2024/1183/oj).], the Commission should review and, if necessary, update this Regulation, to keep it in line with global developments, the Architecture and Reference Framework and to follow the best practices on the internal market.\n\n(3) To ensure broad access to the registers and to achieve interoperability, Member States should set up both human and machine-readable interfaces that meet the technical specifications set out in this Regulation. Providers of wallet-relying party access certificates and wallet-relying party registration certificates, where available, should, for the purpose of issuing those certificates, also be able to rely upon these interfaces.\n\n(4) As registration policies provide clear guidance to the wallet-relying parties on the registration process, Member States should set out and publish the registration policies applicable to the national registers established in their territory.\n\n(5) The purpose of registering wallet-relying parties is to build trust in the use of the wallets through greater transparency. Therefore, Member States should make the relevant information available to the public in a manner that is both human and machine-readable. To this end, wallet-relying parties should provide the necessary information, including their entitlement or entitlements, to the national registers.\n\n(6) Further, for the purpose of transparency, wallet-relying parties should declare, whether they intend to rely upon electronic identification of natural persons.\n\n(7) To ensure that the registration process is cost-effective and proportionate to risk, registrars should set up online and, where applicable, automated registration processes for wallet-relying parties that are easy to use. Registrars should verify applications for registration without undue delay.\n\n(8) Member States are to ensure that the wallets are able to authenticate wallet-relying parties, irrespective of where they are established in the Union. For this purpose, wallet-relying parties should use wallet-relying party access certificates when they identify themselves to wallet units. To guarantee interoperability of those certificates across all wallets provided within the Union, wallet-relying party access certificates should adhere to common requirements set out in the Annex. The Commission should develop harmonized certificate policies and certificate practice statements that should be implemented by the Member States. The Commission, in collaboration with Member States, should closely monitor the development of new or alternative standards on which relying-party access certificates could be implemented. In particular, trust models that have proven their efficacy and security in Member States should be assessed.\n\n(9) As set out in Regulation (EU) No 910/2014, wallet-relying parties are not to request users to provide any data other than those indicated for the intended use of wallets during the registration process. Wallet users should be able to verify the registration data of wallet-relying parties. To enable wallet users to verify that the attributes being requested by the wallet-relying party are within the scope of their registered attributes, Member States may require the issuance of wallet-relying party registration certificates to registered wallet-relying parties. To ensure the interoperability of the wallet-relying party registration certificates, Member States should ensure that those certificates meet the requirements and standards set out in the Annex. In particular, wallet-relying parties should declare, whether they intend to rely upon electronic identification of natural persons to meet one of the requirements set out in paragraph 1 of Article 6 of Regulation (EU) 2016/679 of the European Parliament and of the Council [Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation) (OJ L 119, 4.5.2016, p. 1, ELI: http://data.europa.eu/eli/reg/2016/679/oj).] for the purpose of transparency. Further, relying parties are not to refuse the use of pseudonyms, where the identification of the user is not required by Union or national law.\n\n(10) To protect users against oversharing information with wallet-relying parties and warn them in such cases, Member States should include common access policies in their certificate policies that would enable a wallet solution to inform the wallet user whenever a wallet-relying party is asking for more information than what they have registered or been authorised to access.\n\n(11) To protect wallet users, registrars should be able to suspend or cancel the registration of any wallet-relying party without prior notice where the registrars have reason to believe that the registration contains information which is inaccurate, out of date or misleading; that the wallet-relying party is not complying with the registration policy; or that the wallet-relying party is otherwise acting in breach of Union or national law or of the European Declaration on Digital Rights and Principles for the Digital Decade [OJ C 23, 23.1.2023, p. 1.] in a way that relates to their role as a wallet-relying party, for example if the wallet-relying party has not rightfully minimised the set of attributes it requests access to. To safeguard the stability of the European Digital Identity Wallet ecosystem ('wallet ecosystem'), the decision to suspend or cancel a registration should be proportionate to the service disruption caused by the suspension or cancellation and the associated cost and inconvenience for the service provider and the user. Pursuant to Article 46a(4), point (f) of Regulation (EU) No 910/2014, supervisory bodies are also to be empowered to suspend and cancel the registration if required.\n\n(12) For the purpose of *ex post* monitoring, investigations by law enforcement and dispute handling, registrars should keep records of all the information provided by wallet-relying parties established in their national register for 10 years.\n\n(13) Regulation (EU) 2016/679 and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council [Directive 2002/58/EC of the European Parliament and of the Council of 12 July 2002 concerning the processing of personal data and the protection of privacy in the electronic communications sector (Directive on privacy and electronic communications) (OJ L 201, 31.7.2002, p. 37, ELI: http://data.europa.eu/eli/dir/2002/58/oj).] apply to the personal data processing activities under this Regulation.\n\n(14) The European Data Protection Supervisor was consulted in accordance with Article 42(1) of Regulation (EU) 2018/1725 of the European Parliament and of the Council [Regulation (EU) 2018/1725 of the European Parliament and of the Council of 23 October 2018 on the protection of natural persons with regard to the processing of personal data by the Union institutions, bodies, offices and agencies and on the free movement of such data, and repealing Regulation (EC) No 45/2001 and Decision No 1247/2002/EC (OJ L 295, 21.11.2018, p. 39, ELI: http://data.europa.eu/eli/reg/2018/1725/oj).], and delivered its opinion on 31 January 2025.\n\n(15) The measures provided for in this Regulation are in accordance with the opinion of the committee established by Article 48 of Regulation (EU) No 910/2014,\n\n**HAS ADOPTED THIS REGULATION:**\n\n## Enacting Terms\n\n### Article 1\n**Subject matter and scope**\n\nThis Regulation lays down rules for the registration of wallet-relying parties.\n\n### Article 2\n**Definitions**\n\nFor the purposes of this Regulation, the following definitions apply:\n\n(1) 'wallet-relying party' means a relying party that intends to rely upon wallet units for the provision of public or private services by means of digital interaction;\n(2) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;\n(3) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;\n(4) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;\n(5) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;\n(6) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;\n(7) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;\n(8) 'wallet provider' means a natural or legal person who provides wallet solutions;\n(9) 'wallet user' means a user who is in control of the wallet unit;\n(10) 'national register of wallet-relying parties' means a national electronic register used by a Member State to make information on wallet-relying parties registered in that Member State publicly available as set out in Article 5b(5) of Regulation (EU) No 910/2014;\n(11) 'provider of wallet-relying party access certificates' means a natural or legal person mandated by a Member State to issue wallet-relying party access certificates to wallet-relying parties registered in that Member State;\n(12) 'wallet-relying party access certificate' means a certificate for electronic seals or signatures authenticating and validating the wallet-relying party issued by a provider of wallet-relying party access certificates;\n(13) 'provider of person identification data' means a natural or legal person responsible for issuing and revoking the person identification data and ensuring that the person identification data of a user is cryptographically bound to a wallet unit;\n(14) 'registrar of wallet-relying parties' means the body responsible for establishing and maintaining the list of registered wallet-relying parties established in their territory and who has been designated by a Member State;\n(15) 'wallet-relying party registration certificate' means a data object that describes the intended use of the relying party and indicates the attributes the relying party has registered to intend to request from users;\n(16) 'provider of wallet-relying party registration certificates' means a natural or legal person mandated by a Member State to issue wallet-relying party registration certificates to wallet-relying parties registered in that Member State.\n\n### Article 3\n**National registers**\n\n1. Member States shall establish and maintain at least one national register of wallet-relying parties with information regarding registered wallet-relying parties established in that Member State.\n\n2. The register shall include at least the information set out in Annex I.\n\n3. Member States shall designate at least one registrar to manage and operate at least one national register of wallet-relying parties.\n\n4. Member States shall make the information set out in Annex I on registered wallet-relying parties publicly available online, both in human-readable form and in a form suitable for automated processing.\n\n5. The information referred to in paragraph 2 shall be available through a single common application programming interface (\n\n>  API '\n\n6. Member States shall ensure that the API referred to in paragraph 5 complies with the common requirements set out in Section 2 of Annex II.\n\n7. Member States shall ensure that the registers comply with the relevant common registration policies set out in Article 4.\n\n### Article 4\n**Registration policies**\n\n1. Member States shall lay down and publish one or more national registration policies applicable to the national registers established in their territory.\n\n2. Member States may include or reuse existing sectoral or national registration policies.\n\n3. The national registration policy shall include at least information on:\n\n(a) the identification and authentication procedures applicable to wallet-relying parties during the registration process;\n(b) the required supporting documentation, regarding the identity, business registration, applicable entitlement or entitlements, and other relevant information on the wallet-relying party;\n(c) the authentic sources or other official electronic records and where those sources or records can be relied upon to provide accurate data;\n(d) any other information or other evidence required as part of the registration process;\n(e) where applicable, the automated means of enabling wallet-relying parties to register or to update an existing registration;\n(f) the redress mechanism available to wallet-relying parties under the laws and procedures of the Member State where the national register is established;\n(g) the rules and procedures for the verification of the identity of the registered wallet-relying parties and of any other relevant information provided by that party.\n\n4. The procedures and documentation referred to in paragraph 3, points (a) and (b), shall enable the wallet-relying parties to indicate which specific entitlement or entitlements it is acting under, as set out in Annex I.\n\n5. Where appropriate, the requirements set out in the national registration policy shall not impede an automated registration process.\n\n### Article 5\n**Information to be provided to the national registers**\n\n1. Wallet-relying parties shall at least provide the information set out in Annex I to national registers.\n\n2. Wallet-relying parties shall ensure that the information provided is accurate at the time of registration.\n\n3. Wallet-relying parties shall update any information previously registered in the national register of wallet-relying parties without undue delay.\n\n### Article 6\n**Registration processes**\n\n1. Registrars shall establish easy to use electronic, and where possible, automated registration processes for wallet-relying parties.\n\n2. Registrars shall process applications for registration without undue delay and provide a response to the application for registration to the applicant within the timeframe defined in the applicable registration policy, using appropriate means and in accordance with the laws and procedures of the Member State where the national register is established.\n\n3. Where possible, registrars shall verify in an automated manner:\n\n(a) the accuracy, validity, authenticity and integrity of the information required under Article 5;\n(b) where applicable, the power of attorney of representatives of the wallet-relying parties drawn up and submitted in accordance with the laws and procedures of the Member State where the national register is established;\n(c) the type of entitlement or entitlements of the wallet-relying parties as set out in Annex I;\n(d) the absence of an existing registration in another national register.\n\n4. Registrars shall verify the information set out in paragraph 3 against the supporting documentation provided by the wallet-relying parties or against appropriate authentic sources or other official electronic records in the Member State where the national register is established and to which the registrars have access in accordance with the applicable national laws and procedures.\n\n5. The verification of entitlements of wallet-relying parties referred to in paragraph 3, point (c) shall be carried out in accordance with Annex III.\n\n6. Where the registrar cannot verify the information in accordance with paragraphs 3 to 5, the registrar shall reject the registration.\n\n7. When a wallet-relying party no longer intends to rely upon wallet units for the provision of public or private services under a specific registration, it shall notify the relevant registrar without undue delay and request the cancellation of that registration.\n\n### Article 7\n**Wallet-relying party access certificates**\n\n1. Member States shall authorise at least one certificate authority to issue wallet-relying party access certificates.\n\n2. Member States shall ensure that providers of wallet-relying party access certificates issue wallet-relying party access certificates exclusively to registered wallet-relying parties.\n\n3. Member States shall implement in a syntactically and semantically harmonised manner the certificate policies and certificate practice statements for the wallet-relying party access certificates, in accordance with the requirements set out in Annex IV.\n\n### Article 8\n**Wallet-relying party registration certificates**\n\n1. Member States may authorise at least one certificate authority to issue wallet-relying party registration certificates.\n\n2. Where a Member State authorised the issuance of a wallet-relying party registration certificate, that Member State shall;\n\n(a) require providers of wallet-relying party registration certificates to issue wallet-relying party registration certificates exclusively to registered wallet-relying parties;\n(b) ensure that each intended use is expressed in the wallet-relying party registration certificates;\n(c) ensure that wallet-relying party registration certificates include a general access policy, being syntactically and semantically harmonised across the Union, informing users that the wallet-relying party is only allowed to request the data specified in the registration certificates for the intended use registered in the registration certificates;\n(d) ensure that providers of wallet solutions established in that Member State comply with the general access policy by informing users when a wallet-relying party requests data that is not specified in the registration certificates;\n(e) implement wallet-relying party registration certificates in a syntactically and semantically harmonised manner and in line with the requirements set out in Annex V;\n(f) implement dedicated certificate policies and certificate practice statements for the wallet-relying party registration certificates in accordance with the requirements set out in Annex V;\n(g) ensure that wallet-relying parties provide a URL to the privacy policy regarding the intended use.\n\n3. The policy referred to in point (g) shall be expressed in the wallet-relying party registration certificate.\n\n### Article 9\n**Suspension and cancellation of registration**\n\n1. Registrars shall suspend or cancel a registration of a wallet-relying party where such a suspension or cancellation is requested by a supervisory body pursuant to Article 46a(4), point (f) of Regulation (EU) No 910/2014.\n\n2. Registrars may suspend or cancel a registration of a wallet-relying party where the registrars have reasons to believe one of the following:\n\n(a) the registration contains information, which is inaccurate, out of date or misleading;\n(b) the wallet-relying party is not compliant with the registration policy;\n(c) the wallet-relying party is requesting more attributes than they have registered in accordance with Article 5 and Article 6;\n(d) the wallet-relying party is otherwise acting in breach of Union or national law in a manner related to their role as wallet-relying party.\n\n3. Registrars shall suspend or cancel a registration of a wallet-relying party where the request for cancellation or suspension is made by the same wallet-relying party.\n\n4. When considering the suspension or cancellation in accordance with paragraph 2, the registrar shall conduct a proportionality assessment, taking into account the impact on the fundamental rights, security and confidentiality of the users in the ecosystem, as well as the severity of the disruption envisaged to be caused by the suspension or cancellation and the associated costs, both for the wallet-relying party and the user. Based on the result of this assessment, the registrar may suspend or cancel the registration with or without prior notice to the affected wallet-relying party.\n\n5. Where the registration of a wallet-relying party is suspended or cancelled, the registrar shall inform the provider of the relevant wallet-relying party access certificates, the provider of the relevant wallet-relying party registration certificates, and the affected wallet-relying party of this action without undue delay and not later than 24 hours after the suspension or cancellation. This notification shall include information on the reasons for the suspension or cancellation and on the available means of redress or appeal.\n\n6. The provider of wallet-relying party access certificates and the provider of wallet-relying registration certificates, shall, where applicable, revoke without undue delay the wallet-relying party access certificates, and the wallet-relying party registration certificates, respectively, of the wallet-relying party for which registration has been suspended or cancelled.\n\n### Article 10\n**Record keeping**\n\nRegistrars shall keep records of the information provided by wallet-relying parties and registered in accordance with Annex I for the registration of a wallet-relying party and the issuance of the wallet-relying party access certificates and the wallet-relying party registration certificates, and of any subsequent changes to this information, for 10 years.\n\n### Article 11\n**Entry into force**\n\nThis Regulation shall enter into force on the twentieth day following that of its publication in the\n\nIt shall apply from the\n\nThis Regulation shall be binding in its entirety and directly applicable in all Member States.\n\n---\n\nDone at Brussels, 6 May 2025.\n\n*For the Commission*\n\n*The President*\n\nUrsula von der Leyen\n",
  "contentHtml": "<h2 id=\"preamble\">Preamble</h2>\n<p>THE EUROPEAN COMMISSION,</p>\n<p><em>Having regard to the Treaty on the Functioning of the European Union,</em></p>\n<p><em>Having regard to Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC [OJ L 257, 28.8.2014, p. 73, ELI: <a href=\"http://data.europa.eu/eli/reg/2014/910/oj\">http://data.europa.eu/eli/reg/2014/910/oj</a>.], in particular Article 5b(11) thereof,</em></p>\n<h2 id=\"recitals\">Recitals</h2>\n<p>(1) For the purposes of registering relying parties that intend to rely on European Digital Identity Wallets ('wallets') for the provision of digital public or private services, as required by Regulation (EU) No 910/2014, Member States should establish and maintain national registers of wallet-relying parties established in their territory.</p>\n<p>(2) The Commission regularly assesses new technologies, practices, standards and technical specifications. To ensure the highest level of harmonisation among Member States for the development and certification of the wallets, the technical specifications set out in this Regulation rely on the work carried out on under Commission Recommendation (EU) 2021/946 [Commission Recommendation (EU) 2021/946 of 3 June 2021 on a common Union Toolbox for a coordinated approach towards a European Digital Identity Framework (OJ L 210, 14.6.2021, p. 51, ELI: <a href=\"http://data.europa.eu/eli/reco/2021/946/oj\">http://data.europa.eu/eli/reco/2021/946/oj</a>).] and in particular the Architecture and Reference Framework which is part of it. In accordance with recital 75 of Regulation (EU) 2024/1183 of the European Parliament and of the Council [Regulation (EU) 2024/1183 of the European Parliament and of the Council of 11 April 2024 amending Regulation (EU) No 910/2014 as regards establishing the European Digital Identity Framework (OJ L, 2024/1183, 30.4.2024, ELI: <a href=\"http://data.europa.eu/eli/reg/2024/1183/oj\">http://data.europa.eu/eli/reg/2024/1183/oj</a>).], the Commission should review and, if necessary, update this Regulation, to keep it in line with global developments, the Architecture and Reference Framework and to follow the best practices on the internal market.</p>\n<p>(3) To ensure broad access to the registers and to achieve interoperability, Member States should set up both human and machine-readable interfaces that meet the technical specifications set out in this Regulation. Providers of wallet-relying party access certificates and wallet-relying party registration certificates, where available, should, for the purpose of issuing those certificates, also be able to rely upon these interfaces.</p>\n<p>(4) As registration policies provide clear guidance to the wallet-relying parties on the registration process, Member States should set out and publish the registration policies applicable to the national registers established in their territory.</p>\n<p>(5) The purpose of registering wallet-relying parties is to build trust in the use of the wallets through greater transparency. Therefore, Member States should make the relevant information available to the public in a manner that is both human and machine-readable. To this end, wallet-relying parties should provide the necessary information, including their entitlement or entitlements, to the national registers.</p>\n<p>(6) Further, for the purpose of transparency, wallet-relying parties should declare, whether they intend to rely upon electronic identification of natural persons.</p>\n<p>(7) To ensure that the registration process is cost-effective and proportionate to risk, registrars should set up online and, where applicable, automated registration processes for wallet-relying parties that are easy to use. Registrars should verify applications for registration without undue delay.</p>\n<p>(8) Member States are to ensure that the wallets are able to authenticate wallet-relying parties, irrespective of where they are established in the Union. For this purpose, wallet-relying parties should use wallet-relying party access certificates when they identify themselves to wallet units. To guarantee interoperability of those certificates across all wallets provided within the Union, wallet-relying party access certificates should adhere to common requirements set out in the Annex. The Commission should develop harmonized certificate policies and certificate practice statements that should be implemented by the Member States. The Commission, in collaboration with Member States, should closely monitor the development of new or alternative standards on which relying-party access certificates could be implemented. In particular, trust models that have proven their efficacy and security in Member States should be assessed.</p>\n<p>(9) As set out in Regulation (EU) No 910/2014, wallet-relying parties are not to request users to provide any data other than those indicated for the intended use of wallets during the registration process. Wallet users should be able to verify the registration data of wallet-relying parties. To enable wallet users to verify that the attributes being requested by the wallet-relying party are within the scope of their registered attributes, Member States may require the issuance of wallet-relying party registration certificates to registered wallet-relying parties. To ensure the interoperability of the wallet-relying party registration certificates, Member States should ensure that those certificates meet the requirements and standards set out in the Annex. In particular, wallet-relying parties should declare, whether they intend to rely upon electronic identification of natural persons to meet one of the requirements set out in paragraph 1 of Article 6 of Regulation (EU) 2016/679 of the European Parliament and of the Council [Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation) (OJ L 119, 4.5.2016, p. 1, ELI: <a href=\"http://data.europa.eu/eli/reg/2016/679/oj\">http://data.europa.eu/eli/reg/2016/679/oj</a>).] for the purpose of transparency. Further, relying parties are not to refuse the use of pseudonyms, where the identification of the user is not required by Union or national law.</p>\n<p>(10) To protect users against oversharing information with wallet-relying parties and warn them in such cases, Member States should include common access policies in their certificate policies that would enable a wallet solution to inform the wallet user whenever a wallet-relying party is asking for more information than what they have registered or been authorised to access.</p>\n<p>(11) To protect wallet users, registrars should be able to suspend or cancel the registration of any wallet-relying party without prior notice where the registrars have reason to believe that the registration contains information which is inaccurate, out of date or misleading; that the wallet-relying party is not complying with the registration policy; or that the wallet-relying party is otherwise acting in breach of Union or national law or of the European Declaration on Digital Rights and Principles for the Digital Decade [OJ C 23, 23.1.2023, p. 1.] in a way that relates to their role as a wallet-relying party, for example if the wallet-relying party has not rightfully minimised the set of attributes it requests access to. To safeguard the stability of the European Digital Identity Wallet ecosystem ('wallet ecosystem'), the decision to suspend or cancel a registration should be proportionate to the service disruption caused by the suspension or cancellation and the associated cost and inconvenience for the service provider and the user. Pursuant to Article 46a(4), point (f) of Regulation (EU) No 910/2014, supervisory bodies are also to be empowered to suspend and cancel the registration if required.</p>\n<p>(12) For the purpose of <em>ex post</em> monitoring, investigations by law enforcement and dispute handling, registrars should keep records of all the information provided by wallet-relying parties established in their national register for 10 years.</p>\n<p>(13) Regulation (EU) 2016/679 and, where relevant, Directive 2002/58/EC of the European Parliament and of the Council [Directive 2002/58/EC of the European Parliament and of the Council of 12 July 2002 concerning the processing of personal data and the protection of privacy in the electronic communications sector (Directive on privacy and electronic communications) (OJ L 201, 31.7.2002, p. 37, ELI: <a href=\"http://data.europa.eu/eli/dir/2002/58/oj\">http://data.europa.eu/eli/dir/2002/58/oj</a>).] apply to the personal data processing activities under this Regulation.</p>\n<p>(14) The European Data Protection Supervisor was consulted in accordance with Article 42(1) of Regulation (EU) 2018/1725 of the European Parliament and of the Council [Regulation (EU) 2018/1725 of the European Parliament and of the Council of 23 October 2018 on the protection of natural persons with regard to the processing of personal data by the Union institutions, bodies, offices and agencies and on the free movement of such data, and repealing Regulation (EC) No 45/2001 and Decision No 1247/2002/EC (OJ L 295, 21.11.2018, p. 39, ELI: <a href=\"http://data.europa.eu/eli/reg/2018/1725/oj\">http://data.europa.eu/eli/reg/2018/1725/oj</a>).], and delivered its opinion on 31 January 2025.</p>\n<p>(15) The measures provided for in this Regulation are in accordance with the opinion of the committee established by Article 48 of Regulation (EU) No 910/2014,</p>\n<p><strong>HAS ADOPTED THIS REGULATION:</strong></p>\n<h2 id=\"enacting-terms\">Enacting Terms</h2>\n<h3 id=\"article-1\">Article 1</h3>\n<p><strong>Subject matter and scope</strong></p>\n<p>This Regulation lays down rules for the registration of wallet-relying parties.</p>\n<h3 id=\"article-2\">Article 2</h3>\n<p><strong>Definitions</strong></p>\n<p>For the purposes of this Regulation, the following definitions apply:</p>\n<p>(1) 'wallet-relying party' means a relying party that intends to rely upon wallet units for the provision of public or private services by means of digital interaction;\n(2) 'wallet unit' means a unique configuration of a wallet solution that includes wallet instances, wallet secure cryptographic applications and wallet secure cryptographic devices provided by a wallet provider to an individual wallet user;\n(3) 'wallet solution' means a combination of software, hardware, services, settings, and configurations, including wallet instances, one or more wallet secure cryptographic applications and one or more wallet secure cryptographic devices;\n(4) 'wallet instance' means the application installed and configured on a wallet user’s device or environment, which is part of a wallet unit, and that the wallet user uses to interact with the wallet unit;\n(5) 'wallet secure cryptographic application' means an application that manages critical assets by being linked to and using the cryptographic and non-cryptographic functions provided by the wallet secure cryptographic device;\n(6) 'wallet secure cryptographic device' means a tamper-resistant device that provides an environment that is linked to and used by the wallet secure cryptographic application to protect critical assets and provide cryptographic functions for the secure execution of critical operations;\n(7) 'critical assets' means assets within or in relation to a wallet unit of such extraordinary importance that where their availability, confidentiality or integrity are compromised, this would have a very serious, debilitating effect on the ability to rely on the wallet unit;\n(8) 'wallet provider' means a natural or legal person who provides wallet solutions;\n(9) 'wallet user' means a user who is in control of the wallet unit;\n(10) 'national register of wallet-relying parties' means a national electronic register used by a Member State to make information on wallet-relying parties registered in that Member State publicly available as set out in Article 5b(5) of Regulation (EU) No 910/2014;\n(11) 'provider of wallet-relying party access certificates' means a natural or legal person mandated by a Member State to issue wallet-relying party access certificates to wallet-relying parties registered in that Member State;\n(12) 'wallet-relying party access certificate' means a certificate for electronic seals or signatures authenticating and validating the wallet-relying party issued by a provider of wallet-relying party access certificates;\n(13) 'provider of person identification data' means a natural or legal person responsible for issuing and revoking the person identification data and ensuring that the person identification data of a user is cryptographically bound to a wallet unit;\n(14) 'registrar of wallet-relying parties' means the body responsible for establishing and maintaining the list of registered wallet-relying parties established in their territory and who has been designated by a Member State;\n(15) 'wallet-relying party registration certificate' means a data object that describes the intended use of the relying party and indicates the attributes the relying party has registered to intend to request from users;\n(16) 'provider of wallet-relying party registration certificates' means a natural or legal person mandated by a Member State to issue wallet-relying party registration certificates to wallet-relying parties registered in that Member State.</p>\n<h3 id=\"article-3\">Article 3</h3>\n<p><strong>National registers</strong></p>\n<ol>\n<li>\n<p>Member States shall establish and maintain at least one national register of wallet-relying parties with information regarding registered wallet-relying parties established in that Member State.</p>\n</li>\n<li>\n<p>The register shall include at least the information set out in Annex I.</p>\n</li>\n<li>\n<p>Member States shall designate at least one registrar to manage and operate at least one national register of wallet-relying parties.</p>\n</li>\n<li>\n<p>Member States shall make the information set out in Annex I on registered wallet-relying parties publicly available online, both in human-readable form and in a form suitable for automated processing.</p>\n</li>\n<li>\n<p>The information referred to in paragraph 2 shall be available through a single common application programming interface (</p>\n</li>\n</ol>\n<blockquote>\n<p>API '</p>\n</blockquote>\n<ol start=\"6\">\n<li>\n<p>Member States shall ensure that the API referred to in paragraph 5 complies with the common requirements set out in Section 2 of Annex II.</p>\n</li>\n<li>\n<p>Member States shall ensure that the registers comply with the relevant common registration policies set out in Article 4.</p>\n</li>\n</ol>\n<h3 id=\"article-4\">Article 4</h3>\n<p><strong>Registration policies</strong></p>\n<ol>\n<li>\n<p>Member States shall lay down and publish one or more national registration policies applicable to the national registers established in their territory.</p>\n</li>\n<li>\n<p>Member States may include or reuse existing sectoral or national registration policies.</p>\n</li>\n<li>\n<p>The national registration policy shall include at least information on:</p>\n</li>\n</ol>\n<p>(a) the identification and authentication procedures applicable to wallet-relying parties during the registration process;\n(b) the required supporting documentation, regarding the identity, business registration, applicable entitlement or entitlements, and other relevant information on the wallet-relying party;\n(c) the authentic sources or other official electronic records and where those sources or records can be relied upon to provide accurate data;\n(d) any other information or other evidence required as part of the registration process;\n(e) where applicable, the automated means of enabling wallet-relying parties to register or to update an existing registration;\n(f) the redress mechanism available to wallet-relying parties under the laws and procedures of the Member State where the national register is established;\n(g) the rules and procedures for the verification of the identity of the registered wallet-relying parties and of any other relevant information provided by that party.</p>\n<ol start=\"4\">\n<li>\n<p>The procedures and documentation referred to in paragraph 3, points (a) and (b), shall enable the wallet-relying parties to indicate which specific entitlement or entitlements it is acting under, as set out in Annex I.</p>\n</li>\n<li>\n<p>Where appropriate, the requirements set out in the national registration policy shall not impede an automated registration process.</p>\n</li>\n</ol>\n<h3 id=\"article-5\">Article 5</h3>\n<p><strong>Information to be provided to the national registers</strong></p>\n<ol>\n<li>\n<p>Wallet-relying parties shall at least provide the information set out in Annex I to national registers.</p>\n</li>\n<li>\n<p>Wallet-relying parties shall ensure that the information provided is accurate at the time of registration.</p>\n</li>\n<li>\n<p>Wallet-relying parties shall update any information previously registered in the national register of wallet-relying parties without undue delay.</p>\n</li>\n</ol>\n<h3 id=\"article-6\">Article 6</h3>\n<p><strong>Registration processes</strong></p>\n<ol>\n<li>\n<p>Registrars shall establish easy to use electronic, and where possible, automated registration processes for wallet-relying parties.</p>\n</li>\n<li>\n<p>Registrars shall process applications for registration without undue delay and provide a response to the application for registration to the applicant within the timeframe defined in the applicable registration policy, using appropriate means and in accordance with the laws and procedures of the Member State where the national register is established.</p>\n</li>\n<li>\n<p>Where possible, registrars shall verify in an automated manner:</p>\n</li>\n</ol>\n<p>(a) the accuracy, validity, authenticity and integrity of the information required under Article 5;\n(b) where applicable, the power of attorney of representatives of the wallet-relying parties drawn up and submitted in accordance with the laws and procedures of the Member State where the national register is established;\n(c) the type of entitlement or entitlements of the wallet-relying parties as set out in Annex I;\n(d) the absence of an existing registration in another national register.</p>\n<ol start=\"4\">\n<li>\n<p>Registrars shall verify the information set out in paragraph 3 against the supporting documentation provided by the wallet-relying parties or against appropriate authentic sources or other official electronic records in the Member State where the national register is established and to which the registrars have access in accordance with the applicable national laws and procedures.</p>\n</li>\n<li>\n<p>The verification of entitlements of wallet-relying parties referred to in paragraph 3, point (c) shall be carried out in accordance with Annex III.</p>\n</li>\n<li>\n<p>Where the registrar cannot verify the information in accordance with paragraphs 3 to 5, the registrar shall reject the registration.</p>\n</li>\n<li>\n<p>When a wallet-relying party no longer intends to rely upon wallet units for the provision of public or private services under a specific registration, it shall notify the relevant registrar without undue delay and request the cancellation of that registration.</p>\n</li>\n</ol>\n<h3 id=\"article-7\">Article 7</h3>\n<p><strong>Wallet-relying party access certificates</strong></p>\n<ol>\n<li>\n<p>Member States shall authorise at least one certificate authority to issue wallet-relying party access certificates.</p>\n</li>\n<li>\n<p>Member States shall ensure that providers of wallet-relying party access certificates issue wallet-relying party access certificates exclusively to registered wallet-relying parties.</p>\n</li>\n<li>\n<p>Member States shall implement in a syntactically and semantically harmonised manner the certificate policies and certificate practice statements for the wallet-relying party access certificates, in accordance with the requirements set out in Annex IV.</p>\n</li>\n</ol>\n<h3 id=\"article-8\">Article 8</h3>\n<p><strong>Wallet-relying party registration certificates</strong></p>\n<ol>\n<li>\n<p>Member States may authorise at least one certificate authority to issue wallet-relying party registration certificates.</p>\n</li>\n<li>\n<p>Where a Member State authorised the issuance of a wallet-relying party registration certificate, that Member State shall;</p>\n</li>\n</ol>\n<p>(a) require providers of wallet-relying party registration certificates to issue wallet-relying party registration certificates exclusively to registered wallet-relying parties;\n(b) ensure that each intended use is expressed in the wallet-relying party registration certificates;\n(c) ensure that wallet-relying party registration certificates include a general access policy, being syntactically and semantically harmonised across the Union, informing users that the wallet-relying party is only allowed to request the data specified in the registration certificates for the intended use registered in the registration certificates;\n(d) ensure that providers of wallet solutions established in that Member State comply with the general access policy by informing users when a wallet-relying party requests data that is not specified in the registration certificates;\n(e) implement wallet-relying party registration certificates in a syntactically and semantically harmonised manner and in line with the requirements set out in Annex V;\n(f) implement dedicated certificate policies and certificate practice statements for the wallet-relying party registration certificates in accordance with the requirements set out in Annex V;\n(g) ensure that wallet-relying parties provide a URL to the privacy policy regarding the intended use.</p>\n<ol start=\"3\">\n<li>The policy referred to in point (g) shall be expressed in the wallet-relying party registration certificate.</li>\n</ol>\n<h3 id=\"article-9\">Article 9</h3>\n<p><strong>Suspension and cancellation of registration</strong></p>\n<ol>\n<li>\n<p>Registrars shall suspend or cancel a registration of a wallet-relying party where such a suspension or cancellation is requested by a supervisory body pursuant to Article 46a(4), point (f) of Regulation (EU) No 910/2014.</p>\n</li>\n<li>\n<p>Registrars may suspend or cancel a registration of a wallet-relying party where the registrars have reasons to believe one of the following:</p>\n</li>\n</ol>\n<p>(a) the registration contains information, which is inaccurate, out of date or misleading;\n(b) the wallet-relying party is not compliant with the registration policy;\n(c) the wallet-relying party is requesting more attributes than they have registered in accordance with Article 5 and Article 6;\n(d) the wallet-relying party is otherwise acting in breach of Union or national law in a manner related to their role as wallet-relying party.</p>\n<ol start=\"3\">\n<li>\n<p>Registrars shall suspend or cancel a registration of a wallet-relying party where the request for cancellation or suspension is made by the same wallet-relying party.</p>\n</li>\n<li>\n<p>When considering the suspension or cancellation in accordance with paragraph 2, the registrar shall conduct a proportionality assessment, taking into account the impact on the fundamental rights, security and confidentiality of the users in the ecosystem, as well as the severity of the disruption envisaged to be caused by the suspension or cancellation and the associated costs, both for the wallet-relying party and the user. Based on the result of this assessment, the registrar may suspend or cancel the registration with or without prior notice to the affected wallet-relying party.</p>\n</li>\n<li>\n<p>Where the registration of a wallet-relying party is suspended or cancelled, the registrar shall inform the provider of the relevant wallet-relying party access certificates, the provider of the relevant wallet-relying party registration certificates, and the affected wallet-relying party of this action without undue delay and not later than 24 hours after the suspension or cancellation. This notification shall include information on the reasons for the suspension or cancellation and on the available means of redress or appeal.</p>\n</li>\n<li>\n<p>The provider of wallet-relying party access certificates and the provider of wallet-relying registration certificates, shall, where applicable, revoke without undue delay the wallet-relying party access certificates, and the wallet-relying party registration certificates, respectively, of the wallet-relying party for which registration has been suspended or cancelled.</p>\n</li>\n</ol>\n<h3 id=\"article-10\">Article 10</h3>\n<p><strong>Record keeping</strong></p>\n<p>Registrars shall keep records of the information provided by wallet-relying parties and registered in accordance with Annex I for the registration of a wallet-relying party and the issuance of the wallet-relying party access certificates and the wallet-relying party registration certificates, and of any subsequent changes to this information, for 10 years.</p>\n<h3 id=\"article-11\">Article 11</h3>\n<p><strong>Entry into force</strong></p>\n<p>This Regulation shall enter into force on the twentieth day following that of its publication in the</p>\n<p>It shall apply from the</p>\n<p>This Regulation shall be binding in its entirety and directly applicable in all Member States.</p>\n<hr>\n<p>Done at Brussels, 6 May 2025.</p>\n<p><em>For the Commission</em></p>\n<p><em>The President</em></p>\n<p>Ursula von der Leyen</p>",
  "wordCount": 3531,
  "lastProcessed": "2026-01-14T20:38:59.106Z"
}