{
  "slug": "ec-esignature-faq",
  "type": "regulation",
  "legalType": "faq",
  "category": "supplementary",
  "title": "eSignature FAQ",
  "shortTitle": "eSignature FAQ",
  "sidebarTitle": "eSignature FAQ",
  "description": "eSignature FAQ",
  "celex": null,
  "date": null,
  "source": "https://ec.europa.eu/digital-building-blocks/sites/spaces/DIGITAL/pages/880312429/eSignature+FAQ",
  "version": null,
  "toc": [
    {
      "id": "general-questions",
      "title": "General Questions",
      "level": 2
    },
    {
      "id": "what-is-an-electronic-signature",
      "title": "What is an electronic signature?",
      "level": 3
    },
    {
      "id": "what-is-an-electronic-seal",
      "title": "What is an electronic seal?",
      "level": 3
    },
    {
      "id": "what-is-the-difference-between-an-electronic-signature-and-a-digital-signature",
      "title": "What is the difference between an electronic signature and a digital signature?",
      "level": 3
    },
    {
      "id": "what-are-the-levels-simple-advanced-and-qualified-of-electronic-signatures",
      "title": "What are the levels (simple, advanced and qualified) of electronic signatures?",
      "level": 3
    },
    {
      "id": "simple-electronic-signatures",
      "title": "'Simple' electronic signatures",
      "level": 4
    },
    {
      "id": "advanced-electronic-signatures-ades",
      "title": "Advanced electronic signatures (AdES)",
      "level": 4
    },
    {
      "id": "qualified-electronic-signatures-qes",
      "title": "Qualified electronic signatures (QES)",
      "level": 4
    },
    {
      "id": "what-are-the-levels-simple-advanced-and-qualified-of-electronic-seals",
      "title": "What are the levels (simple, advanced and qualified) of electronic seals?",
      "level": 3
    },
    {
      "id": "simple-electronic-seals",
      "title": "'Simple' electronic seals",
      "level": 4
    },
    {
      "id": "advanced-electronic-seals-ades",
      "title": "Advanced electronic seals (AdES)",
      "level": 4
    },
    {
      "id": "qualified-electronic-seals-qes",
      "title": "Qualified electronic seals (QES)",
      "level": 4
    },
    {
      "id": "what-is-a-certificate-for-electronic-signatures",
      "title": "What is a certificate for electronic signatures?",
      "level": 3
    },
    {
      "id": "what-is-a-certificate-for-electronic-seals",
      "title": "What is a certificate for electronic seals?",
      "level": 3
    },
    {
      "id": "what-is-a-qualified-signatureseal-creation-device-qscd",
      "title": "What is a qualified signature/seal creation device (QSCD)?",
      "level": 3
    },
    {
      "id": "what-are-the-legal-effects-of-an-electronic-signature",
      "title": "What are the legal effects of an electronic signature?",
      "level": 3
    },
    {
      "id": "what-are-the-legal-effects-of-an-electronic-seal",
      "title": "What are the legal effects of an electronic seal?",
      "level": 3
    },
    {
      "id": "do-i-need-a-qualified-electronic-signature",
      "title": "Do I need a qualified electronic signature?",
      "level": 3
    },
    {
      "id": "do-i-need-a-qualified-electronic-seal",
      "title": "Do I need a qualified electronic seal?",
      "level": 3
    },
    {
      "id": "how-can-i-create-an-advanced-or-qualified-electronic-signature",
      "title": "How can I create an advanced or qualified electronic signature?",
      "level": 3
    },
    {
      "id": "how-can-i-create-an-advanced-or-qualified-electronic-seal",
      "title": "How can I create an advanced or qualified electronic seal?",
      "level": 3
    },
    {
      "id": "when-signingsealing-a-document-which-format-of-signature-should-i-use",
      "title": "When signing/sealing a document, which format of signature should I use?",
      "level": 3
    },
    {
      "id": "what-is-an-electronic-time-stamp-and-do-i-need-one",
      "title": "What is an electronic time stamp, and do I need one?",
      "level": 3
    },
    {
      "id": "what-are-the-legal-effects-of-an-electronic-time-stamp",
      "title": "What are the legal effects of an electronic time stamp?",
      "level": 3
    },
    {
      "id": "how-can-i-get-a-qualified-electronic-time-stamp",
      "title": "How can I get a qualified electronic time stamp?",
      "level": 3
    },
    {
      "id": "what-is-the-validation-of-a-qualified-electronic-signature",
      "title": "What is the validation of a qualified electronic signature?",
      "level": 3
    },
    {
      "id": "how-do-i-validate-an-electronic-signatureseal-as-qualified",
      "title": "How do I validate an electronic signature/seal as qualified?",
      "level": 3
    },
    {
      "id": "using-dss-demonstration-webapp",
      "title": "Using DSS Demonstration WebApp",
      "level": 4
    },
    {
      "id": "using-adobe-acrobat-reader-for-signatures-only",
      "title": "Using Adobe Acrobat Reader (for signatures only)",
      "level": 4
    },
    {
      "id": "via-a-qualified-trust-service",
      "title": "Via a qualified trust service",
      "level": 4
    },
    {
      "id": "when-validating-a-qualified-certificate-what-is-the-related-trust-anchor",
      "title": "When validating a qualified certificate, what is the related Trust Anchor?",
      "level": 3
    },
    {
      "id": "glossary",
      "title": "Glossary",
      "level": 2
    },
    {
      "id": "what-does-ades-mean",
      "title": "What does AdES mean?",
      "level": 3
    },
    {
      "id": "what-does-qes-mean",
      "title": "What does QES mean?",
      "level": 3
    },
    {
      "id": "what-does-qtspqts-mean",
      "title": "What does (Q)TSP/(Q)TS mean?",
      "level": 3
    },
    {
      "id": "what-does-qc-mean",
      "title": "What does QC mean?",
      "level": 3
    },
    {
      "id": "what-does-qscd-mean",
      "title": "What does QSCD mean?",
      "level": 3
    },
    {
      "id": "what-does-adesqc-mean",
      "title": "What does AdES/QC mean?",
      "level": 3
    },
    {
      "id": "trusted-list-browser",
      "title": "Trusted List Browser",
      "level": 2
    },
    {
      "id": "what-is-the-trusted-list-browser",
      "title": "What is the Trusted List Browser?",
      "level": 3
    },
    {
      "id": "what-is-a-trusted-list",
      "title": "What is a Trusted List?",
      "level": 3
    },
    {
      "id": "what-is-the-list-of-member-states-trusted-lists-also-named-list-of-trusted-lists-lotl",
      "title": "What is the List of Member States Trusted Lists, also named List of Trusted Lists (LOTL)?",
      "level": 3
    },
    {
      "id": "which-trust-service-providers-can-i-find-using-trusted-list-browser",
      "title": "Which trust service providers can I find using Trusted List Browser?",
      "level": 3
    },
    {
      "id": "what-is-a-qualified-trust-service",
      "title": "What is a qualified trust service?",
      "level": 3
    },
    {
      "id": "what-is-the-difference-between-non-qualified-and-qualified-trust-service-providers",
      "title": "What is the difference between non-qualified and qualified trust service providers?",
      "level": 3
    },
    {
      "id": "why-is-a-qualified-trust-service-provider-tagged-with-non-qualified-trust-services",
      "title": "Why is a qualified trust service provider tagged with non-qualified trust services?",
      "level": 3
    },
    {
      "id": "what-are-the-tags-granted-and-withdrawn",
      "title": "What are the tags \"granted\" and \"withdrawn\"?",
      "level": 3
    },
    {
      "id": "what-are-the-tags-non-regulatory-and-undefined",
      "title": "What are the tags \"Non-Regulatory\" and \"Undefined\"?",
      "level": 3
    },
    {
      "id": "what-are-the-tags-recognised-at-national-level-and-deprecated-at-national-level",
      "title": "What are the tags \"Recognised at national level\" and \"Deprecated at national level\"?",
      "level": 3
    },
    {
      "id": "i-cant-find-a-trust-service-provider-in-your-trusted-list-browser-why-so",
      "title": "I can't find a trust service provider in your Trusted List Browser, why so?",
      "level": 3
    }
  ],
  "contentMarkdown": "Frequently asked questions about electronic signatures, electronic seals, and trust services under the eIDAS Regulation.\n\n---\n\n## General Questions\n\n### What is an electronic signature?\n\nAn electronic signature is a data in electronic form which is attached to or logically associated with other data in electronic form and which is used by the signatory to sign, where the signatory is a natural person.\n\nLike its handwritten counterpart in the offline world, an electronic signature can be used, for instance, to electronically indicate that the signatory has written the document, agreed with the content of the document, or that the signatory was present as a witness.\n\nIn case you want to seal a document as a legal person (e.g. as a business or organisation), you might be instead interested in an electronic seal.\n\n---\n\n### What is an electronic seal?\n\nAn electronic seal is a data in electronic form, which is attached to or logically associated with other data in electronic form to ensure the latter's origin and integrity, where the creator of a seal is a legal person (unlike the electronic signature that is issued by a natural person).\n\nIn this purpose, electronic seals might serve as evidence that an electronic document was issued by a legal person, ensuring certainty of the document's origin and integrity. Nevertheless, across the European Union, when a transaction requires a qualified electronic seal from a legal person, a qualified electronic signature from the authorised representative of the legal person is equally acceptable.\n\n---\n\n### What is the difference between an electronic signature and a digital signature?\n\nAn **'electronic signature'** is a legal concept that is defined in eIDAS by the following:\n\n> \"'electronic signature' means data in electronic form which is attached to or logically associated with other data in electronic form and which is used by the signatory to sign;\" (eIDAS Article 3.10)\n\nA **digital signature**, on the other hand, refers to a mathematical and cryptographic concept that is widely used to provide concrete and practical instances of electronic signature. The definition given by ETSI TR 119 100 is that of data appended to, or a cryptographic transformation of a data unit that allows a recipient of the data unit to prove the source and integrity of the data unit and protect against forgery e.g. by the recipient.\n\nThese two concepts should be distinguished, as **all electronic signatures are not necessarily digital signatures**.\n\n---\n\n### What are the levels (simple, advanced and qualified) of electronic signatures?\n\nThe eIDAS Regulation defines three levels of electronic signature: 'simple' electronic signature, advanced electronic signature and qualified electronic signature. The requirements of each level are built on the requirements of the level below it, such that a qualified electronic signature meets the most requirements and a 'simple' electronic signature the least.\n\n#### 'Simple' electronic signatures\n\nAn electronic signature is defined as \"data in electronic form which is attached to or logically associated with other data in electronic form and which is used by the signatory to sign\". Thus, something as simple as writing your name under an e-mail might constitute an electronic signature.\n\n#### Advanced electronic signatures (AdES)\n\nAn advanced electronic signature is an electronic signature which is additionally:\n\n- uniquely linked to and capable of identifying the signatory;\n- created in a way that allows the signatory to retain control;\n- linked to the document in a way that any subsequent change of the data is detectable.\n\nThe most commonly used technology able to provide these requirements relies on the use of a public-key infrastructure (PKI), which involves the use of certificates and cryptographic keys.\n\n#### Qualified electronic signatures (QES)\n\nA qualified electronic signature is an advanced electronic signature which is additionally:\n\n- created by a qualified signature creation device (QSCD);\n- and is based on a qualified certificate for electronic signatures.\n\n---\n\n### What are the levels (simple, advanced and qualified) of electronic seals?\n\nLike the electronic signature, the eIDAS Regulation defines three levels of electronic seal: 'simple' electronic seal, advanced electronic seal and qualified electronic seal. The requirements of each level are built on the requirements of the level below it, such that a qualified electronic seal meets the most requirements and a 'simple' electronic seal the least.\n\nNevertheless, levels of electronic seals don't have the same definitions, requirements, nor legal effects than levels of electronic signatures:\n\n#### 'Simple' electronic seals\n\nAn electronic seal is defined as \"data in electronic form, which is attached to or logically associated with other data in electronic form to ensure the latter's origin and integrity\".\n\n#### Advanced electronic seals (AdES)\n\nAn advanced electronic seal is an electronic seal which is additionally:\n\n- uniquely linked to the creator of the seal;\n- capable of identifying the creator of the seal;\n- created using electronic seal creation data that the creator of the seal can, with a high level of confidence under its control, use for electronic seal creation; and\n- linked to the data to which it relates in such a way that any subsequent change in the data is detectable.\n\nThe most commonly used technology able to provide these requirements relies on the use of a public-key infrastructure (PKI), which involves the use of certificates and cryptographic keys.\n\n#### Qualified electronic seals (QES)\n\nSimilar to a qualified electronic signature, a qualified electronic seal is an advanced electronic seal which is additionally:\n\n- created by a qualified seal creation device (QSCD);\n- and is based on a qualified certificate for electronic seals.\n\n---\n\n### What is a certificate for electronic signatures?\n\nWhen signing a document, a pair of keys might be needed (i.e. when the signature relies on the use of public-key infrastructure), namely a 'public key' and a 'private key'. The public key can be publicly shared while the private key shall be securely stored. Especially, the private key is used by the signatory to sign a document while the public key is used by anyone verifying that it is actually the private key of the signatory that has been used to sign the document.\n\nA **certificate for electronic signatures**, issued by a Certificate Authority (CA), is an electronic attestation which links electronic signature validation data to a natural person and confirms at least the name or the pseudonym of that person. This way, the certificate, usually linked to the signed document, can be used to verify the identity of the signatory and whether the document has been signed using the corresponding private key.\n\n**Qualified certificates** for electronic signatures, by following stricter requirements laid down in eIDAS, provide, for instance, higher guarantees regarding the identity of the signatory and therefore higher legal certainty regarding the created electronic signatures. Especially, qualified certificates are provided by qualified trust service providers (QTSP) which have been audited as such and granted a qualified status by a national competent authority, as reflected in the national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers).\n\nThose lists, and therefore QTSPs listed in it, can be browsed in a user-friendly way using the [Trusted List Browser](https://eidas.ec.europa.eu/efda/trust-services/browse/eidas/tls).\n\nUsually, providers of qualified certificates for electronic signatures deliver the corresponding private key on a qualified signature creation device (QSCD).\n\n---\n\n### What is a certificate for electronic seals?\n\nWhen sealing a document, a pair of keys might be needed (i.e. when the seal relies on the use of public-key infrastructure), namely a 'public key' and a 'private key'. The public key can be publicly shared while the private key shall be securely stored. Especially, the private key is used by the creator of the seal to seal a document while the public key is used by anyone verifying that it is actually the private key of the creator of the seal that has been used to seal the document.\n\nA **certificate for electronic seals**, issued by a Certificate Authority (CA), is an electronic attestation that links electronic seal validation data to a legal person and confirms the name of that person. This way, the certificate, usually linked to the sealed document, can be used to verify the identity of the creator of the seal and whether the document has been sealed using the corresponding private key.\n\nLike qualified certificates for electronic signatures, **qualified certificates for electronic seals**, by following stricter requirements laid down in eIDAS, provide, for instance, higher guarantees regarding the identity of the creator of the seal and therefore higher legal certainty regarding the created electronic seals. Especially, qualified certificates are provided by qualified trust service providers (QTSP) which have been audited as such and granted a qualified status by a national competent authority, as reflected in the national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers).\n\nThose lists, and therefore QTSPs listed in it, can be browsed in a user-friendly way using the [Trusted List Browser](https://eidas.ec.europa.eu/efda/trust-services/browse/eidas/tls).\n\nUsually, providers of qualified certificates for electronic seals deliver the corresponding private key on a qualified seal creation device (QSCD).\n\n---\n\n### What is a qualified signature/seal creation device (QSCD)?\n\nSignature/seal creation devices come in many forms to protect the electronic signature/seal creation data (e.g. private key) of the signatory/creator of the seal, such as smartcards, SIM cards, USB sticks.\n\nA **qualified signature/seal creation device (QSCD)**, by following stricter requirements laid down in eIDAS, offers higher guarantees regarding the protection (e.g. mitigating any kind of replication or forgery) of the electronic signature/seal creation data (such as the private key) and therefore higher legal certainty regarding the created qualified electronic signatures/seals.\n\nFor example, a smartcard (e.g. ID card), when following specific requirements, can be seen as a QSCD as, in order to \"unlock\" the electronic signature creation data, the signatory shall physically possess the smartcard and know the associated PIN code.\n\nA QSCD is not necessarily in the physical possession of the signatory/creator of the seal but can also be **remotely managed** by a qualified trust service provider (QTSP). This kind of QSCD is known as \"remote QSCD\". Those remote QSCD offer an improved user experience while maintaining the legal certainty offered by qualified electronic signatures/seals.\n\n---\n\n### What are the legal effects of an electronic signature?\n\nAcross all EU Member States, the legal effects of electronic signatures are laid down in **Article 25 of eIDAS**.\n\nAn electronic signature (either simple, advanced or qualified) shall not be denied legal effect and admissibility as evidence in legal proceedings solely on the grounds that it is in an electronic form or that it does not meet the requirements for qualified electronic signatures.\n\nRegarding **qualified electronic signatures**, they explicitly have the **equivalent legal effect of handwritten signatures** across all EU Member States.\n\n---\n\n### What are the legal effects of an electronic seal?\n\nAcross all EU Member States, the legal effects of electronic seals are laid down in **Article 35 of eIDAS**.\n\nLike an electronic signature, an electronic seal shall not be denied legal effect and admissibility as evidence in legal proceedings solely on the grounds that it is in an electronic form or that it does not meet the requirements for qualified electronic seals.\n\nRegarding **qualified electronic seals**, they explicitly enjoy the **presumption of integrity of the data and of correctness of the origin** of that data to which the qualified electronic seal is linked across all EU Member States.\n\n---\n\n### Do I need a qualified electronic signature?\n\nWhile different levels of electronic signatures may be appropriate in different contexts, only **qualified electronic signatures are explicitly recognized to have the equivalent legal effect of hand-written signatures** all over EU Member States.\n\nMoreover, as a general rule, if a certain level of electronic signature (e.g. advanced signature) is required, a higher level will probably be accepted (e.g. advanced signature with a qualified certificate, qualified electronic signature).\n\n---\n\n### Do I need a qualified electronic seal?\n\nWhile different levels of electronic seals may be appropriate in different contexts, only **qualified electronic seals explicitly enjoy the presumption of integrity of the data and of correctness of the origin** of that data to which the qualified electronic seal is linked, all over EU Member States.\n\nMoreover, as a general rule, if a certain level of electronic seal (e.g. advanced seal) is required, a higher level will probably be accepted (e.g. advanced signature with a qualified seal, qualified electronic seal).\n\nNevertheless, when a transaction requires a qualified electronic seal from a legal person, a qualified electronic signature from the authorised representative of the legal person is equally acceptable.\n\n---\n\n### How can I create an advanced or qualified electronic signature?\n\nIn the first place, in order to sign documents as a natural person (in order to seal documents as a legal person, you might be instead interested in electronic seals), a certificate for electronic signatures is needed. And, using this certificate, electronic signatures can be created. As part of the eIDAS Regulation, these certificates can be purchased from specific providers, named Trust Service Providers (TSP).\n\n**1. Obtain a digital certificate from a TSP**\n\nIn the case of an 'advanced electronic signature', the certificate can be or not qualified. In the case of a 'qualified electronic signature', the certificate shall be qualified and the private key related to the certificate shall be stored on a 'qualified electronic signature creation device' (QSCD).\n\nAs a general rule, if a certain level of electronic signature (e.g. advanced signature) is required, a higher level will probably be accepted (e.g. advanced signature with a qualified certificate, qualified electronic signature).\n\nAs laid down in eIDAS, a qualified electronic signature explicitly has the equivalent legal effect of a handwritten signature.\n\nProviders of qualified certificates for electronic signatures, as an eIDAS legal obligation, are mandatorily listed in the corresponding national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers). But providers of non-qualified certificates for electronic signatures could be but are not mandatorily listed in these Trusted Lists.\n\n**2. Choose your TSP using Trusted List Browser**\n\nUsing [Trusted List Browser](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home), go to \"[Search by Type of service](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1)\" (top left of the screen).\n\nSelect \"Certificate for electronic signature\" and/or \"Qualified certificate for electronic signature\" and click \"Next\".\n\nThen, select any country you may found appropriate and click \"Search\".\n\nFinally, click on any TSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website providing more information about this provider and the products it provides.\n\n**3. Sign your document**\n\nOnce you have a certificate for electronic signature, you will be able to sign documents. TSPs might offer their own step-by-step process for signing digitally.\n\nThe European Commission also proposes a [demo of DSS](https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/sign-a-document), a tool enabling, among other features, the signature of documents. This demo is based on the open-source library Digital Signature Software (DSS). DSS supports the creation and verification of interoperable and secure electronic signatures in line with the eIDAS Regulation. More information is available in the [DSS documentation](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation).\n\n---\n\n### How can I create an advanced or qualified electronic seal?\n\nIn the first place, in order to seal documents as a legal person, a certificate for electronic seals is actually needed. And, using this certificate, electronic seals can be created. As part of the eIDAS Regulation, these certificates can be purchased from specific providers, named Trust Service Providers (TSP).\n\n**1. Obtain a digital certificate from a TSP**\n\nIn the case of an 'advanced electronic seal', the certificate can be or not qualified. In the case of a 'qualified electronic seal', the certificate shall be qualified and the private key related to the certificate shall be stored on a 'qualified electronic seal creation device' (QSCD).\n\nAs a general rule, if a certain level of electronic seal (e.g. advanced seal) is required, a higher level will probably be accepted (e.g. advanced seal with a qualified certificate, qualified electronic seal).\n\nAs laid down in eIDAS, a qualified electronic seal explicitly enjoys the presumption of integrity of the data and of correctness of the origin of that data to which the qualified electronic seal is linked.\n\nProviders of qualified certificates for electronic seals, as an eIDAS legal obligation, are mandatorily listed in the corresponding national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers). But providers of non-qualified certificates for electronic seals could be but are not mandatorily listed in these Trusted Lists.\n\n**2. Choose your TSP using Trusted List Browser**\n\nUsing [Trusted List Browser](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home), go to \"[Search by Type of service](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1)\" (top left of the screen).\n\nSelect \"Certificate for electronic seal\" and/or \"Qualified certificate for electronic seal\" and click \"Next\".\n\nThen, select any country you may found appropriate and click \"Search\".\n\nFinally, click on any TSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website providing more information about this provider and the products it provides.\n\n**3. Seal your document**\n\nOnce you have a certificate for electronic seal, you will be able to seal documents. TSPs might offer their own step-by-step process for sealing digitally.\n\nThe European Commission also proposes a [demo of DSS](https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/sign-a-document), a tool enabling, among other features, the signature and seal of documents. This demo is based on the open-source library Digital Signature Software (DSS). DSS supports the creation and verification of interoperable and secure electronic signatures/seals in line with the eIDAS Regulation. More information is available in the [DSS documentation](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation).\n\n---\n\n### When signing/sealing a document, which format of signature should I use?\n\nThree formats of advanced signature and one format of signature container are specified in the European Telecommunications Standards Institute (ETSI) standards, namely:\n\n- **XML advanced electronic signature (XAdES)**, based on XML signatures;\n- **PDF advanced electronic signature (PAdES)**, based on PDF signatures;\n- **CMS advanced electronic signature (CAdES)**, based on Cryptographic Message Syntax (CMS);\n- **Associated Signature Container (ASiC)** based on ZIP format and supporting XAdES and CAdES signature formats.\n\nEspecially, following [CID 2015/1506](https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=OJ%3AJOL_2015_235_R_0006), these formats shall be recognised by European public sector bodies.\n\nAdvanced electronic signatures and advanced electronic seals being similar from the technical point of view, the standards for formats of advanced electronic signatures apply *mutatis mutandis* to formats for advanced electronic seals.\n\n**When signing/sealing a single document**, the format of signature to choose typically depends on the format of the document to sign:\n\n- **XML documents** are suggested to be signed/sealed using XAdES signature format (either with enveloped or enveloping packaging);\n- **PDF documents** are suggested to be signed/sealed using PAdES signature format;\n- **Binary files** are suggested to be signed/sealed with XAdES or CAdES signature formats (with enveloping packaging).\n\n**When signing/sealing multiple documents**, it is suggested to use ASiC containers.\n\nAbove suggestions are intended for basic usage of the signature/seal of documents. Other formats of signatures might be more appropriate in other specific contexts.\n\n---\n\n### What is an electronic time stamp, and do I need one?\n\nAn **electronic time stamp** is a data in electronic form which binds other data in electronic form to a particular time establishing evidence that the latter data existed at that time.\n\nFor example, a signatory can use an electronic time stamp to bind a signed document to a particular date and time and prove in the future that the signed document existed at this particular date and time.\n\nAs part of eIDAS, a time stamp can be qualified. Following stricter requirements laid down in eIDAS, a **qualified electronic time stamp** enjoys the presumption of the accuracy of the date and the time it indicates and the integrity of the data (e.g. signed document) to which the date and time are bound.\n\n---\n\n### What are the legal effects of an electronic time stamp?\n\nAcross all EU Member States, the legal effects of electronic time stamps are laid down in **Article 41 of eIDAS**.\n\nAn electronic time stamp (qualified or not) shall not be denied legal effect and admissibility as evidence in legal proceedings solely on the grounds that it is in an electronic form or that it does not meet the requirements of the qualified electronic time stamp.\n\nRegarding **qualified electronic time stamps**, they enjoy the presumption of the accuracy of the date and the time it indicates and the integrity of the data to which the date and time are bound, across all EU Member States.\n\n---\n\n### How can I get a qualified electronic time stamp?\n\nQualified time stamps are provided as part of a service, provided by qualified trust service providers (QTSP). QTSP, as an eIDAS legal obligation, are mandatorily listed in the corresponding national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers).\n\nTrusted Lists, and therefore the providers listed in it, can be browsed in a user-friendly way using the [Trusted List Browser](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home).\n\nUsing Trusted List Browser, go to \"[Search by Type of service](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1)\" (top left of the screen):\n\n1. Select \"Qualified time stamp\" and click \"Next\".\n2. Then, select any country you may found appropriate and click \"Search\".\n3. Finally, click on any QTSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website providing more information about this provider and the products it provides.\n\n---\n\n### What is the validation of a qualified electronic signature?\n\nWhen a party needs to rely on signed electronic data (e.g. a signed document), it is very often important that it can verify:\n\n- The integrity of the signed data;\n- The authenticity of the signed data.\n\nThe requirements for the validation of qualified electronic signatures are, in particular, described in **Article 32 of the eIDAS Regulation**. In this context:\n\n- **Integrity** means that no modification has been made to the signed data after it has been signed;\n- **Authenticity** means that the signature is supported by a qualified certificate identifying the signatory, and that only the signatory can produce the signature.\n\nA summary and non-exhaustive overview of the steps involved in the validation process for qualified electronic signature would be:\n\n- The verification of the integrity of the data;\n- The verification of the validity of the certificate;\n- The verification of the qualified status of the certificate; and\n- The verification of the signature was created by a qualified electronic signature creation device.\n\nFinally, as numerous steps are involved in this validation process, the answer to a validation request can take the form of a **validation report** that contains the set of answers to the various verifications and steps involved during the validation process.\n\n---\n\n### How do I validate an electronic signature/seal as qualified?\n\n#### Using DSS Demonstration WebApp\n\nIn order to easily validate on any format of document whether a signature/seal is qualified, you might be interested in the \"Validate a signature\" feature of [DSS Demonstration WebApp](https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/validation). This demo is based on the open-source library Digital Signature Software (DSS). DSS supports the creation and verification of interoperable and secure electronic signatures/seals in line with the eIDAS Regulation. More information is available in the [DSS documentation](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation).\n\n#### Using Adobe Acrobat Reader (for signatures only)\n\nWhen the signed document is a PDF, you can also use the \"Adobe Acrobat Reader\" software. If, via the Signature Panel, the software indicates \"This is a Qualified Electronic Signature according to EU Regulation 910/2014\", you can assume the signature is qualified.\n\n#### Via a qualified trust service\n\nSome qualified trust service providers (QTSP) also offer \"qualified validation service for qualified electronic signature/seal\" services. When using this kind of service, users ensure the validation service follows requirements laid down in eIDAS and benefit therefore of higher legal certainty.\n\nQTSP, as an eIDAS legal obligation, are mandatorily listed in the corresponding national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers). Trusted Lists, and therefore the providers listed in it, can be browsed in a user-friendly way using the [Trusted List Browser](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home).\n\nUsing Trusted List Browser, go to \"[Search by Type of service](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1)\" (top left of the screen):\n\n1. Select \"Qualified validation service for qualified electronic signature\" or \"Qualified validation service for qualified electronic seal\" and click \"Next\".\n2. Then, select any country you may found appropriate and click \"Search\".\n3. Finally, click on any QTSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website.\n\n---\n\n### When validating a qualified certificate, what is the related Trust Anchor?\n\nAs defined by RFC 5280, a **Trust Anchor** is the end point of a certificate validation process.\n\nAs part of the EU [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers), when validating a qualified certificate (i.e. QC for electronic signatures, QC for electronic seals, QC for website authentication), the Trust Anchor is the Service digital identity (Sdi) of a trust service entry (cf. ETSI TS 119 612 v2.1.1). It means that, when validating a certificate, there is no need to chain up to the Root CA of a qualified certificate but only to the related CA/QC issuer entry within the Trusted List.\n\nIn order to extract the certificate chain from a qualified certificate to its issuer, you may find interesting the \"certificate validation\" feature of [DSS Demonstration WebApp](https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/validation). This demo is based on the open-source library Digital Signature Software (DSS). DSS supports the creation and verification of interoperable and secure electronic signatures in line with the eIDAS Regulation. More information is available in the [DSS documentation](https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation).\n\nYou will also find more document information about this certificate validation in the \"Introduction to the Qualified electronic signature (QES) validation algorithm\" [webpage](https://ec.europa.eu/digital-building-blocks/sites/x/H4XXGw).\n\n---\n\n## Glossary\n\n### What does AdES mean?\n\nAdES is the acronym for either an **advanced electronic signature** or an **advanced electronic seal**. It is the second level of electronic signatures/seals defined in eIDAS.\n\n---\n\n### What does QES mean?\n\nQES is the acronym for either **qualified electronic signature** or **qualified electronic seal**. It is the third and most secure level of electronic signature/seal defined in eIDAS.\n\n---\n\n### What does (Q)TSP/(Q)TS mean?\n\nA **trust service provider (TSP)** is a natural or a legal person who provides one or more trust services (TS) either as a qualified or as a non-qualified trust service provider.\n\nA **qualified trust service provider (QTSP)** is a TSP who provides one or more qualified trust services (QTS) and is granted the qualified status by the national supervisory body. The decision of the supervisory body to grant the qualified status is reflected in the corresponding national [Trusted List](https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers). In this respect, QTSPs are mandatorily listed in the corresponding national Trusted List while TSP could be but are not mandatorily listed in these Trusted Lists.\n\nTrusted Lists, and therefore the providers listed in it, can be browsed in a user-friendly way using the [Trusted List Browser](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home).\n\n---\n\n### What does QC mean?\n\nQC stands for a **qualified certificate**. As part of eIDAS, a qualified certificate can either be a:\n\n- Qualified certificate for electronic signature\n- Qualified certificate for electronic seal\n- Qualified certificate for website authentication\n\n---\n\n### What does QSCD mean?\n\nQSCD stands for a **qualified electronic signature/seal creation device**.\n\n---\n\n### What does AdES/QC mean?\n\nAdES/QC is an **advanced electronic signature/seal (AdES) based on a qualified certificate**.\n\n---\n\n## Trusted List Browser\n\n### What is the Trusted List Browser?\n\n[Trusted List Browser](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home) is a publicly available tool provided by the European Commission. It allows the user to browse through the information present in the Member States national Trusted Lists (TLs), as well as in the European Commission central list (named List of Trusted Lists (LOTL)). It provides an intuitive interface that is user-friendly and human-readable.\n\nTrusted List Browser should be taken as a tool to search for Trust Service Providers and the services associated with them that are listed in a Member State national Trusted List. It is not intended to provide sufficient information to be used in a validation process.\n\n---\n\n### What is a Trusted List?\n\nThe eIDAS Regulation introduces the concept of **Trusted List (TL)** in the following statement:\n\n> \"Each Member State shall establish, maintain and publish trusted lists, including information related to the qualified trust service providers for which it is responsible, together with information related to the qualified trust services provided by them.\" (eIDAS article 22.1).\n\nIt may therefore be understood that all qualified trust services (QTSP's) and the qualified trust services (QTS) they provide are mandatorily listed in its national TL, and that this is the main goal the TL's serve. Nevertheless, while not mandatory in eIDAS, Member States can also include in their TL's information related to non-QTSP and non-QTS.\n\nThe information related to the trust services includes information about the status (e.g. granted, withdrawn) and the status history of the trust services in compliance with the applicable requirements and the relevant provisions of the eIDAS Regulation.\n\nIn addition to the legal definition provided by eIDAS, the [Commission Implementing Decision (EU) 2015/1505](https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32015D1505) specifies the technical specifications and formats for Trusted List.\n\n---\n\n### What is the List of Member States Trusted Lists, also named List of Trusted Lists (LOTL)?\n\nThe eIDAS Regulation states that:\n\n> \"The Commission shall make available to the public, through a secure channel, the information referred to in paragraph 3 [i.e. about Member States Trusted Lists] in electronically signed or sealed form suitable for automated processing.\" (eIDAS article 22.4)\n\nIn practice, the European Commission publishes an XML document called the **List of Trusted Lists (LOTL)**, which consists of a compiled list of links (pointers) towards all trusted lists from the Member States, together with the certificates used to sign these trusted lists.\n\nThe primary goals of the publication of the LOTL are to allow access to the trusted lists of all Member States in an easy way and to provide a way to trust and authenticate those lists.\n\nMore information on the LOTL can be found [here](https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home).\n\n---\n\n### Which trust service providers can I find using Trusted List Browser?\n\nUsing the Trusted List Browser allows you to find any Trust Service Provider (TSP) listed in a Member State national Trusted List. This means that you should be able to find any Qualified Trust Service Providers (QTSP's) and the qualified trust services it provides, as it is mandatory for them to be listed in an EU MS national TL.\n\nAny other TSP (i.e. non-qualified TSP) may or may not be found using Trusted List Browser, as they are not required to be listed in a national TL.\n\nPlease keep mind that **finding a TSP using Trusted List Browser does not mean that it is a Qualified TSP**. In order to verify that a TSP corresponds to your needs, you can refer to the tags associated to it.\n\n---\n\n### What is a qualified trust service?\n\nThe eIDAS Regulation aims to deliver a comprehensive cross-border and cross-sector framework for secure, trustworthy and easy-to-use electronic transactions. Qualified trust services are a mean to this end, as their legal significance is recognised at European level. They are subject to strict requirements that consist of:\n\n**a) Issuing qualified certificates for:**\n- Electronic signature\n- Electronic seal\n- Website authentication\n\n**b) Providing qualified validation of:**\n- Qualified electronic signature\n- Qualified electronic seal\n\n**c) Providing qualified preservation of:**\n- Qualified electronic signature\n- Qualified electronic seal\n\n**d) Issuing qualified time stamp**\n\n**e) Providing qualified electronic registered delivery**\n\n---\n\n### What is the difference between non-qualified and qualified trust service providers?\n\nThe eIDAS Regulation defines a qualified trust service provider (QTSP) as \"[…] a natural or a legal person who provides one or more qualified trust services […]\".\n\nAs opposed to non-qualified trust service providers, QTSP's are thus granted the right to deliver one or more qualified trust services after undergoing a strict assessment process.\n\nWhile it is mandatory for QTSP to be listed in an EU Member State Trusted List (TL), member states may decide to include non-qualified trust service providers in their TL.\n\nTrusted List Browser allows the user to search for QTSP by the type of qualified trust services they provide, as well as easily identifying which trust services, qualified or not, are provided by a particular TSP listed on a national TL, using explicit tags.\n\n---\n\n### Why is a qualified trust service provider tagged with non-qualified trust services?\n\nA qualified trust service provider (QTSP) must provide at least one qualified trust service, but may also provide non-qualified trust services. That is the reason why some QTSP may be tagged with qualified and non-qualified trust services in the Trusted List Browser.\n\n---\n\n### What are the tags \"granted\" and \"withdrawn\"?\n\nThese two tags only concern qualified trust services. The right for a Qualified Trust Service Provider (QTSP) to provide a qualified trust service (QTS) is decided by the national Supervisory Body (SB). The decision of the SB to allow the QTSP to provide the QTS is reflected in the associated national Trusted List (TL). This is a field that Trusted List Browser visually represents as a tag under the QTS.\n\n- If the tag under the qualified trust service states **\"Granted\"**, this means that the QTSP has been granted by the SB the right to currently provide the QTS.\n- If the tag under the qualified trust service is **\"Withdrawn\"**, this means that the QTSP was, at one time, given the right to provide this qualified trust service, but this right has been currently withdrawn.\n\nThe history of this status can be found in Trusted List Browser under the banner \"History\", accessible by clicking on a qualified trust service.\n\n---\n\n### What are the tags \"Non-Regulatory\" and \"Undefined\"?\n\nThese two tags only concern non-qualified trust services and have to do with a refinement of their type:\n\n- The tag **\"Undefined\"** is associated with trust services whose type has been defined in the eIDAS Regulation, but for which there is a lack of additional information in the TL to further specify its use.\n- The tag **\"Non-Regulatory\"** on the other hand is associated with trust services whose type has not been defined in the eIDAS Regulation and are country-specific.\n\n---\n\n### What are the tags \"Recognised at national level\" and \"Deprecated at national level\"?\n\nThese two tags only concern non-qualified trust services and have to do with a refinement of their type:\n\n- The tag **\"Recognised at national level\"** means that the trust service to which it refers as well as the relevant TSP have been granted an \"approved\" status, as recognized at national level.\n- The tag **\"Deprecated at national level\"** means that the trust service to which it refers as well as the relevant TSP had their \"approved\" status withdrawn.\n\n---\n\n### I can't find a trust service provider in your Trusted List Browser, why so?\n\nAccording to the eIDAS Regulation, only the Qualified Trust Service Providers (QTSP's) have to be listed in a Trusted List:\n\n> \"Each Member State shall establish, maintain and publish trusted lists, including information related to the qualified trust service providers for which it is responsible, together with information related to the qualified trust services provided by them.\" (eIDAS article 22.1)\n\nAs such, each national Trusted List may or may not include non-qualified TSPs. It is up to the Member State's Supervisory Body to decide which non-qualified TSP will be listed.\n",
  "contentHtml": "<p>Frequently asked questions about <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>, <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span>, and <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> under the eIDAS Regulation.</p>\n<hr>\n<h2 id=\"general-questions\">General Questions</h2>\n<h3 id=\"what-is-an-electronic-signature\">What is an electronic signature?</h3>\n<p>An <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> is a data in electronic form which is attached to or logically associated with other data in electronic form and which is used by the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> to sign, where the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> is a natural person.</p>\n<p>Like its handwritten counterpart in the offline world, an <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> can be used, for instance, to electronically indicate that the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> has written the document, agreed with the content of the document, or that the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> was present as a witness.</p>\n<p>In case you want to seal a document as a legal person (e.g. as a business or organisation), you might be instead interested in an <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span>.</p>\n<hr>\n<h3 id=\"what-is-an-electronic-seal\">What is an electronic seal?</h3>\n<p>An <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> is a data in electronic form, which is attached to or logically associated with other data in electronic form to ensure the latter's origin and integrity, where the <span class=\"term-link\" data-term-id=\"creator-of-a-seal\" tabindex=\"0\">creator of a seal</span> is a legal person (unlike the <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> that is issued by a natural person).</p>\n<p>In this purpose, <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> might serve as evidence that an <span class=\"term-link\" data-term-id=\"electronic-document\" tabindex=\"0\">electronic document</span> was issued by a legal person, ensuring certainty of the document's origin and integrity. Nevertheless, across the European Union, when a transaction requires a <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> from a legal person, a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> from the <span class=\"term-link\" data-term-id=\"authorised-representative\" tabindex=\"0\">authorised representative</span> of the legal person is equally acceptable.</p>\n<hr>\n<h3 id=\"what-is-the-difference-between-an-electronic-signature-and-a-digital-signature\">What is the difference between an electronic signature and a digital signature?</h3>\n<p>An <strong>'<span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>'</strong> is a legal concept that is defined in eIDAS by the following:</p>\n<blockquote>\n<p>\"'<span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>' means data in electronic form which is attached to or logically associated with other data in electronic form and which is used by the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> to sign;\" (eIDAS Article 3.10)</p>\n</blockquote>\n<p>A <strong><span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">digital signature</span></strong>, on the other hand, refers to a mathematical and cryptographic concept that is widely used to provide concrete and practical instances of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>. The definition given by ETSI TR 119 100 is that of data appended to, or a cryptographic transformation of a data unit that allows a <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span> of the data unit to prove the source and integrity of the data unit and protect against forgery e.g. by the <span class=\"term-link\" data-term-id=\"recipient\" tabindex=\"0\">recipient</span>.</p>\n<p>These two concepts should be distinguished, as <strong>all <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> are not necessarily <span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">digital signatures</span></strong>.</p>\n<hr>\n<h3 id=\"what-are-the-levels-simple-advanced-and-qualified-of-electronic-signatures\">What are the levels (simple, advanced and qualified) of electronic signatures?</h3>\n<p>The eIDAS Regulation defines three levels of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>: 'simple' <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>, <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span> and <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>. The requirements of each level are built on the requirements of the level below it, such that a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> meets the most requirements and a 'simple' <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> the least.</p>\n<h4 id=\"simple-electronic-signatures\">'Simple' electronic signatures</h4>\n<p>An <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> is defined as \"data in electronic form which is attached to or logically associated with other data in electronic form and which is used by the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> to sign\". Thus, something as simple as writing your name under an e-mail might constitute an <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>.</p>\n<h4 id=\"advanced-electronic-signatures-ades\">Advanced electronic signatures (AdES)</h4>\n<p>An <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span> is an <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> which is additionally:</p>\n<ul>\n<li>uniquely linked to and capable of identifying the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span>;</li>\n<li>created in a way that allows the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> to retain control;</li>\n<li>linked to the document in a way that any subsequent change of the data is detectable.</li>\n</ul>\n<p>The most commonly used technology able to provide these requirements relies on the use of a public-key infrastructure (PKI), which involves the use of certificates and cryptographic keys.</p>\n<h4 id=\"qualified-electronic-signatures-qes\">Qualified electronic signatures (QES)</h4>\n<p>A <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> is an <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span> which is additionally:</p>\n<ul>\n<li>created by a <span class=\"term-link\" data-term-id=\"qualified-signature-creation-device\" tabindex=\"0\">qualified signature creation device</span> (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>);</li>\n<li>and is based on a <span class=\"term-link\" data-term-id=\"qualified-certificate-for-electronic-signature\" tabindex=\"0\">qualified certificate for electronic signatures</span>.</li>\n</ul>\n<hr>\n<h3 id=\"what-are-the-levels-simple-advanced-and-qualified-of-electronic-seals\">What are the levels (simple, advanced and qualified) of electronic seals?</h3>\n<p>Like the <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>, the eIDAS Regulation defines three levels of <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span>: 'simple' <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span>, <span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seal</span> and <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span>. The requirements of each level are built on the requirements of the level below it, such that a <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> meets the most requirements and a 'simple' <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> the least.</p>\n<p>Nevertheless, levels of <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> don't have the same definitions, requirements, nor legal effects than levels of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>:</p>\n<h4 id=\"simple-electronic-seals\">'Simple' electronic seals</h4>\n<p>An <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> is defined as \"data in electronic form, which is attached to or logically associated with other data in electronic form to ensure the latter's origin and integrity\".</p>\n<h4 id=\"advanced-electronic-seals-ades\">Advanced electronic seals (AdES)</h4>\n<p>An <span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seal</span> is an <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> which is additionally:</p>\n<ul>\n<li>uniquely linked to the creator of the seal;</li>\n<li>capable of identifying the creator of the seal;</li>\n<li>created using <span class=\"term-link\" data-term-id=\"electronic-seal-creation-data\" tabindex=\"0\">electronic seal creation data</span> that the creator of the seal can, with a high level of confidence under its control, use for <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> creation; and</li>\n<li>linked to the data to which it relates in such a way that any subsequent change in the data is detectable.</li>\n</ul>\n<p>The most commonly used technology able to provide these requirements relies on the use of a public-key infrastructure (PKI), which involves the use of certificates and cryptographic keys.</p>\n<h4 id=\"qualified-electronic-seals-qes\">Qualified electronic seals (QES)</h4>\n<p>Similar to a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>, a <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> is an <span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seal</span> which is additionally:</p>\n<ul>\n<li>created by a <span class=\"term-link\" data-term-id=\"qualified-seal-creation-device\" tabindex=\"0\">qualified seal creation device</span> (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>);</li>\n<li>and is based on a <span class=\"term-link\" data-term-id=\"qualified-certificate-for-electronic-seal\" tabindex=\"0\">qualified certificate for electronic seals</span>.</li>\n</ul>\n<hr>\n<h3 id=\"what-is-a-certificate-for-electronic-signatures\">What is a certificate for electronic signatures?</h3>\n<p>When signing a document, a pair of keys might be needed (i.e. when the signature relies on the use of public-key infrastructure), namely a 'public key' and a 'private key'. The public key can be publicly shared while the private key shall be securely stored. Especially, the private key is used by the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> to sign a document while the public key is used by anyone verifying that it is actually the private key of the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> that has been used to sign the document.</p>\n<p>A <strong><span class=\"term-link\" data-term-id=\"certificate-for-electronic-signatures\" tabindex=\"0\">certificate for electronic signatures</span></strong>, issued by a Certificate Authority (CA), is an electronic attestation which links <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> <span class=\"term-link\" data-term-id=\"validation-data\" tabindex=\"0\">validation data</span> to a natural person and confirms at least the name or the pseudonym of that person. This way, the certificate, usually linked to the signed document, can be used to verify the identity of the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> and whether the document has been signed using the corresponding private key.</p>\n<p><strong>Qualified certificates</strong> for <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>, by following stricter requirements laid down in eIDAS, provide, for instance, higher guarantees regarding the identity of the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> and therefore higher legal certainty regarding the created <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>. Especially, qualified certificates are provided by <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> (QTSP) which have been audited as such and granted a qualified status by a national competent authority, as reflected in the national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>.</p>\n<p>Those lists, and therefore QTSPs listed in it, can be browsed in a <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly way using the <a href=\"https://eidas.ec.europa.eu/efda/trust-services/browse/eidas/tls\">Trusted List Browser</a>.</p>\n<p>Usually, providers of qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> deliver the corresponding private key on a <span class=\"term-link\" data-term-id=\"qualified-signature-creation-device\" tabindex=\"0\">qualified signature creation device</span> (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>).</p>\n<hr>\n<h3 id=\"what-is-a-certificate-for-electronic-seals\">What is a certificate for electronic seals?</h3>\n<p>When sealing a document, a pair of keys might be needed (i.e. when the seal relies on the use of public-key infrastructure), namely a 'public key' and a 'private key'. The public key can be publicly shared while the private key shall be securely stored. Especially, the private key is used by the creator of the seal to seal a document while the public key is used by anyone verifying that it is actually the private key of the creator of the seal that has been used to seal the document.</p>\n<p>A <strong><span class=\"term-link\" data-term-id=\"certificate-for-electronic-seals\" tabindex=\"0\">certificate for electronic seals</span></strong>, issued by a Certificate Authority (CA), is an electronic attestation that links <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> <span class=\"term-link\" data-term-id=\"validation-data\" tabindex=\"0\">validation data</span> to a legal person and confirms the name of that person. This way, the certificate, usually linked to the sealed document, can be used to verify the identity of the creator of the seal and whether the document has been sealed using the corresponding private key.</p>\n<p>Like qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>, <strong>qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span></strong>, by following stricter requirements laid down in eIDAS, provide, for instance, higher guarantees regarding the identity of the creator of the seal and therefore higher legal certainty regarding the created <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span>. Especially, qualified certificates are provided by <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> (QTSP) which have been audited as such and granted a qualified status by a national competent authority, as reflected in the national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>.</p>\n<p>Those lists, and therefore QTSPs listed in it, can be browsed in a <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly way using the <a href=\"https://eidas.ec.europa.eu/efda/trust-services/browse/eidas/tls\">Trusted List Browser</a>.</p>\n<p>Usually, providers of qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> deliver the corresponding private key on a <span class=\"term-link\" data-term-id=\"qualified-seal-creation-device\" tabindex=\"0\">qualified seal creation device</span> (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>).</p>\n<hr>\n<h3 id=\"what-is-a-qualified-signatureseal-creation-device-qscd\">What is a qualified signature/seal creation device (QSCD)?</h3>\n<p>Signature/seal creation devices come in many forms to protect the <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>/seal creation data (e.g. private key) of the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span>/creator of the seal, such as smartcards, SIM cards, USB sticks.</p>\n<p>A <strong>qualified signature/seal creation device (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>)</strong>, by following stricter requirements laid down in eIDAS, offers higher guarantees regarding the protection (e.g. mitigating any kind of replication or forgery) of the <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>/seal creation data (such as the private key) and therefore higher legal certainty regarding the created <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span>/seals.</p>\n<p>For example, a smartcard (e.g. ID card), when following specific requirements, can be seen as a <span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span> as, in order to \"unlock\" the <span class=\"term-link\" data-term-id=\"electronic-signature-creation-data\" tabindex=\"0\">electronic signature creation data</span>, the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> shall physically possess the smartcard and know the associated PIN code.</p>\n<p>A <span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span> is not necessarily in the physical possession of the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span>/creator of the seal but can also be <strong>remotely managed</strong> by a <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service provider</span> (QTSP). This kind of <span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span> is known as \"<span class=\"term-link\" data-term-id=\"remote-qscd\" tabindex=\"0\">remote QSCD</span>\". Those <span class=\"term-link\" data-term-id=\"remote-qscd\" tabindex=\"0\">remote QSCD</span> offer an improved <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> experience while maintaining the legal certainty offered by <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span>/seals.</p>\n<hr>\n<h3 id=\"what-are-the-legal-effects-of-an-electronic-signature\">What are the legal effects of an electronic signature?</h3>\n<p>Across all EU Member States, the legal effects of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> are laid down in <strong>Article 25 of eIDAS</strong>.</p>\n<p>An <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> (either simple, advanced or qualified) shall not be denied legal effect and admissibility as evidence in legal proceedings solely on the grounds that it is in an electronic form or that it does not meet the requirements for <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span>.</p>\n<p>Regarding <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span></strong>, they explicitly have the <strong>equivalent legal effect of handwritten signatures</strong> across all EU Member States.</p>\n<hr>\n<h3 id=\"what-are-the-legal-effects-of-an-electronic-seal\">What are the legal effects of an electronic seal?</h3>\n<p>Across all EU Member States, the legal effects of <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> are laid down in <strong>Article 35 of eIDAS</strong>.</p>\n<p>Like an <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>, an <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> shall not be denied legal effect and admissibility as evidence in legal proceedings solely on the grounds that it is in an electronic form or that it does not meet the requirements for <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seals</span>.</p>\n<p>Regarding <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seals</span></strong>, they explicitly enjoy the <strong>presumption of integrity of the data and of correctness of the origin</strong> of that data to which the <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> is linked across all EU Member States.</p>\n<hr>\n<h3 id=\"do-i-need-a-qualified-electronic-signature\">Do I need a qualified electronic signature?</h3>\n<p>While different levels of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> may be appropriate in different contexts, only <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> are explicitly recognized to have the equivalent legal effect of hand-written signatures</strong> all over EU Member States.</p>\n<p>Moreover, as a general rule, if a certain level of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> (e.g. advanced signature) is required, a higher level will probably be accepted (e.g. advanced signature with a qualified certificate, <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>).</p>\n<hr>\n<h3 id=\"do-i-need-a-qualified-electronic-seal\">Do I need a qualified electronic seal?</h3>\n<p>While different levels of <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> may be appropriate in different contexts, only <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seals</span> explicitly enjoy the presumption of integrity of the data and of correctness of the origin</strong> of that data to which the <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> is linked, all over EU Member States.</p>\n<p>Moreover, as a general rule, if a certain level of <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> (e.g. advanced seal) is required, a higher level will probably be accepted (e.g. advanced signature with a qualified seal, <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span>).</p>\n<p>Nevertheless, when a transaction requires a <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> from a legal person, a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> from the <span class=\"term-link\" data-term-id=\"authorised-representative\" tabindex=\"0\">authorised representative</span> of the legal person is equally acceptable.</p>\n<hr>\n<h3 id=\"how-can-i-create-an-advanced-or-qualified-electronic-signature\">How can I create an advanced or qualified electronic signature?</h3>\n<p>In the first place, in order to sign documents as a natural person (in order to seal documents as a legal person, you might be instead interested in <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span>), a <span class=\"term-link\" data-term-id=\"certificate-for-electronic-signatures\" tabindex=\"0\">certificate for electronic signatures</span> is needed. And, using this certificate, <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> can be created. As part of the eIDAS Regulation, these certificates can be purchased from specific providers, named <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">Trust Service Providers</span> (TSP).</p>\n<p><strong>1. Obtain a digital certificate from a TSP</strong></p>\n<p>In the case of an '<span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span>', the certificate can be or not qualified. In the case of a '<span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>', the certificate shall be qualified and the private key related to the certificate shall be stored on a '<span class=\"term-link\" data-term-id=\"qualified-electronic-signature-creation-device\" tabindex=\"0\">qualified electronic signature creation device</span>' (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>).</p>\n<p>As a general rule, if a certain level of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span> (e.g. advanced signature) is required, a higher level will probably be accepted (e.g. advanced signature with a qualified certificate, <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>).</p>\n<p>As laid down in eIDAS, a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> explicitly has the equivalent legal effect of a handwritten signature.</p>\n<p>Providers of qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>, as an eIDAS legal obligation, are mandatorily listed in the corresponding national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>. But providers of non-qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> could be but are not mandatorily listed in these <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>.</p>\n<p><strong>2. Choose your TSP using <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span></strong></p>\n<p>Using <a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">Trusted List Browser</a>, go to \"<a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1\">Search by Type of service</a>\" (top left of the screen).</p>\n<p>Select \"<span class=\"term-link\" data-term-id=\"certificate-for-electronic-signature\" tabindex=\"0\">Certificate for electronic signature</span>\" and/or \"<span class=\"term-link\" data-term-id=\"qualified-certificate-for-electronic-signature\" tabindex=\"0\">Qualified certificate for electronic signature</span>\" and click \"Next\".</p>\n<p>Then, select any country you may found appropriate and click \"Search\".</p>\n<p>Finally, click on any TSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website providing more information about this provider and the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> it provides.</p>\n<p><strong>3. Sign your document</strong></p>\n<p>Once you have a <span class=\"term-link\" data-term-id=\"certificate-for-electronic-signature\" tabindex=\"0\">certificate for electronic signature</span>, you will be able to sign documents. TSPs might offer their own step-by-step process for signing digitally.</p>\n<p>The European Commission also proposes a <a href=\"https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/sign-a-document\">demo of DSS</a>, a tool enabling, among other features, the signature of documents. This demo is based on the open-source library <span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">Digital Signature</span> Software (DSS). DSS supports the creation and verification of interoperable and secure <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> in line with the eIDAS Regulation. More information is available in the <a href=\"https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation\">DSS documentation</a>.</p>\n<hr>\n<h3 id=\"how-can-i-create-an-advanced-or-qualified-electronic-seal\">How can I create an advanced or qualified electronic seal?</h3>\n<p>In the first place, in order to seal documents as a legal person, a <span class=\"term-link\" data-term-id=\"certificate-for-electronic-seals\" tabindex=\"0\">certificate for electronic seals</span> is actually needed. And, using this certificate, <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> can be created. As part of the eIDAS Regulation, these certificates can be purchased from specific providers, named <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">Trust Service Providers</span> (TSP).</p>\n<p><strong>1. Obtain a digital certificate from a TSP</strong></p>\n<p>In the case of an '<span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seal</span>', the certificate can be or not qualified. In the case of a '<span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span>', the certificate shall be qualified and the private key related to the certificate shall be stored on a '<span class=\"term-link\" data-term-id=\"qualified-electronic-seal-creation-device\" tabindex=\"0\">qualified electronic seal creation device</span>' (<span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span>).</p>\n<p>As a general rule, if a certain level of <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seal</span> (e.g. advanced seal) is required, a higher level will probably be accepted (e.g. advanced seal with a qualified certificate, <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span>).</p>\n<p>As laid down in eIDAS, a <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> explicitly enjoys the presumption of integrity of the data and of correctness of the origin of that data to which the <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span> is linked.</p>\n<p>Providers of qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span>, as an eIDAS legal obligation, are mandatorily listed in the corresponding national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>. But providers of non-qualified certificates for <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span> could be but are not mandatorily listed in these <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>.</p>\n<p><strong>2. Choose your TSP using <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span></strong></p>\n<p>Using <a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">Trusted List Browser</a>, go to \"<a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1\">Search by Type of service</a>\" (top left of the screen).</p>\n<p>Select \"<span class=\"term-link\" data-term-id=\"certificate-for-electronic-seal\" tabindex=\"0\">Certificate for electronic seal</span>\" and/or \"<span class=\"term-link\" data-term-id=\"qualified-certificate-for-electronic-seal\" tabindex=\"0\">Qualified certificate for electronic seal</span>\" and click \"Next\".</p>\n<p>Then, select any country you may found appropriate and click \"Search\".</p>\n<p>Finally, click on any TSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website providing more information about this provider and the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> it provides.</p>\n<p><strong>3. Seal your document</strong></p>\n<p>Once you have a <span class=\"term-link\" data-term-id=\"certificate-for-electronic-seal\" tabindex=\"0\">certificate for electronic seal</span>, you will be able to seal documents. TSPs might offer their own step-by-step process for sealing digitally.</p>\n<p>The European Commission also proposes a <a href=\"https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/sign-a-document\">demo of DSS</a>, a tool enabling, among other features, the signature and seal of documents. This demo is based on the open-source library <span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">Digital Signature</span> Software (DSS). DSS supports the creation and verification of interoperable and secure <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>/seals in line with the eIDAS Regulation. More information is available in the <a href=\"https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation\">DSS documentation</a>.</p>\n<hr>\n<h3 id=\"when-signingsealing-a-document-which-format-of-signature-should-i-use\">When signing/sealing a document, which format of signature should I use?</h3>\n<p>Three formats of advanced signature and one format of signature container are specified in the European Telecommunications <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">Standards</span> Institute (ETSI) <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span>, namely:</p>\n<ul>\n<li><strong>XML <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span> (<span class=\"term-link\" data-term-id=\"xades\" tabindex=\"0\">XAdES</span>)</strong>, based on XML signatures;</li>\n<li><strong>PDF <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span> (<span class=\"term-link\" data-term-id=\"pades\" tabindex=\"0\">PAdES</span>)</strong>, based on PDF signatures;</li>\n<li><strong>CMS <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span> (<span class=\"term-link\" data-term-id=\"cades\" tabindex=\"0\">CAdES</span>)</strong>, based on Cryptographic Message Syntax (CMS);</li>\n<li><strong>Associated Signature Container (<span class=\"term-link\" data-term-id=\"asic\" tabindex=\"0\">ASiC</span>)</strong> based on ZIP format and supporting <span class=\"term-link\" data-term-id=\"xades\" tabindex=\"0\">XAdES</span> and <span class=\"term-link\" data-term-id=\"cades\" tabindex=\"0\">CAdES</span> signature formats.</li>\n</ul>\n<p>Especially, following <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=OJ%3AJOL_2015_235_R_0006\">CID 2015/1506</a>, these formats shall be recognised by European <span class=\"term-link\" data-term-id=\"public-sector-body\" tabindex=\"0\">public sector bodies</span>.</p>\n<p><span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">Advanced electronic signatures</span> and <span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seals</span> being similar from the technical point of view, the <span class=\"term-link\" data-term-id=\"standard\" tabindex=\"0\">standards</span> for formats of <span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signatures</span> apply <em>mutatis mutandis</em> to formats for <span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seals</span>.</p>\n<p><strong>When signing/sealing a single document</strong>, the format of signature to choose typically depends on the format of the document to sign:</p>\n<ul>\n<li><strong>XML documents</strong> are suggested to be signed/sealed using <span class=\"term-link\" data-term-id=\"xades\" tabindex=\"0\">XAdES</span> signature format (either with enveloped or enveloping packaging);</li>\n<li><strong>PDF documents</strong> are suggested to be signed/sealed using <span class=\"term-link\" data-term-id=\"pades\" tabindex=\"0\">PAdES</span> signature format;</li>\n<li><strong>Binary files</strong> are suggested to be signed/sealed with <span class=\"term-link\" data-term-id=\"xades\" tabindex=\"0\">XAdES</span> or <span class=\"term-link\" data-term-id=\"cades\" tabindex=\"0\">CAdES</span> signature formats (with enveloping packaging).</li>\n</ul>\n<p><strong>When signing/sealing multiple documents</strong>, it is suggested to use <span class=\"term-link\" data-term-id=\"asic\" tabindex=\"0\">ASiC</span> containers.</p>\n<p>Above suggestions are intended for basic usage of the signature/seal of documents. Other formats of signatures might be more appropriate in other specific contexts.</p>\n<hr>\n<h3 id=\"what-is-an-electronic-time-stamp-and-do-i-need-one\">What is an electronic time stamp, and do I need one?</h3>\n<p>An <strong><span class=\"term-link\" data-term-id=\"electronic-time-stamp\" tabindex=\"0\">electronic time stamp</span></strong> is a data in electronic form which binds other data in electronic form to a particular time establishing evidence that the latter data existed at that time.</p>\n<p>For example, a <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> can use an <span class=\"term-link\" data-term-id=\"electronic-time-stamp\" tabindex=\"0\">electronic time stamp</span> to bind a signed document to a particular date and time and prove in the future that the signed document existed at this particular date and time.</p>\n<p>As part of eIDAS, a time stamp can be qualified. Following stricter requirements laid down in eIDAS, a <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-time-stamp\" tabindex=\"0\">qualified electronic time stamp</span></strong> enjoys the presumption of the accuracy of the date and the time it indicates and the integrity of the data (e.g. signed document) to which the date and time are bound.</p>\n<hr>\n<h3 id=\"what-are-the-legal-effects-of-an-electronic-time-stamp\">What are the legal effects of an electronic time stamp?</h3>\n<p>Across all EU Member States, the legal effects of <span class=\"term-link\" data-term-id=\"electronic-time-stamp\" tabindex=\"0\">electronic time stamps</span> are laid down in <strong>Article 41 of eIDAS</strong>.</p>\n<p>An <span class=\"term-link\" data-term-id=\"electronic-time-stamp\" tabindex=\"0\">electronic time stamp</span> (qualified or not) shall not be denied legal effect and admissibility as evidence in legal proceedings solely on the grounds that it is in an electronic form or that it does not meet the requirements of the <span class=\"term-link\" data-term-id=\"qualified-electronic-time-stamp\" tabindex=\"0\">qualified electronic time stamp</span>.</p>\n<p>Regarding <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-time-stamp\" tabindex=\"0\">qualified electronic time stamps</span></strong>, they enjoy the presumption of the accuracy of the date and the time it indicates and the integrity of the data to which the date and time are bound, across all EU Member States.</p>\n<hr>\n<h3 id=\"how-can-i-get-a-qualified-electronic-time-stamp\">How can I get a qualified electronic time stamp?</h3>\n<p>Qualified time stamps are provided as part of a service, provided by <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> (QTSP). QTSP, as an eIDAS legal obligation, are mandatorily listed in the corresponding national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>.</p>\n<p><span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>, and therefore the providers listed in it, can be browsed in a <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly way using the <a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">Trusted List Browser</a>.</p>\n<p>Using <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span>, go to \"<a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1\">Search by Type of service</a>\" (top left of the screen):</p>\n<ol>\n<li>Select \"Qualified time stamp\" and click \"Next\".</li>\n<li>Then, select any country you may found appropriate and click \"Search\".</li>\n<li>Finally, click on any QTSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website providing more information about this provider and the <span class=\"term-link\" data-term-id=\"product\" tabindex=\"0\">products</span> it provides.</li>\n</ol>\n<hr>\n<h3 id=\"what-is-the-validation-of-a-qualified-electronic-signature\">What is the validation of a qualified electronic signature?</h3>\n<p>When a party needs to rely on signed electronic data (e.g. a signed document), it is very often important that it can verify:</p>\n<ul>\n<li>The integrity of the signed data;</li>\n<li>The authenticity of the signed data.</li>\n</ul>\n<p>The requirements for the <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> of <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signatures</span> are, in particular, described in <strong>Article 32 of the eIDAS Regulation</strong>. In this context:</p>\n<ul>\n<li><strong>Integrity</strong> means that no modification has been made to the signed data after it has been signed;</li>\n<li><strong>Authenticity</strong> means that the signature is supported by a qualified certificate identifying the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span>, and that only the <span class=\"term-link\" data-term-id=\"signatory\" tabindex=\"0\">signatory</span> can produce the signature.</li>\n</ul>\n<p>A summary and non-exhaustive overview of the steps involved in the <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> process for <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span> would be:</p>\n<ul>\n<li>The verification of the integrity of the data;</li>\n<li>The verification of the validity of the certificate;</li>\n<li>The verification of the qualified status of the certificate; and</li>\n<li>The verification of the signature was created by a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature-creation-device\" tabindex=\"0\">qualified electronic signature creation device</span>.</li>\n</ul>\n<p>Finally, as numerous steps are involved in this <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> process, the answer to a <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> request can take the form of a <strong><span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> report</strong> that contains the set of answers to the various verifications and steps involved during the <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> process.</p>\n<hr>\n<h3 id=\"how-do-i-validate-an-electronic-signatureseal-as-qualified\">How do I validate an electronic signature/seal as qualified?</h3>\n<h4 id=\"using-dss-demonstration-webapp\">Using DSS Demonstration WebApp</h4>\n<p>In order to easily validate on any format of document whether a signature/seal is qualified, you might be interested in the \"Validate a signature\" feature of <a href=\"https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/validation\">DSS Demonstration WebApp</a>. This demo is based on the open-source library <span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">Digital Signature</span> Software (DSS). DSS supports the creation and verification of interoperable and secure <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>/seals in line with the eIDAS Regulation. More information is available in the <a href=\"https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation\">DSS documentation</a>.</p>\n<h4 id=\"using-adobe-acrobat-reader-for-signatures-only\">Using Adobe Acrobat Reader (for signatures only)</h4>\n<p>When the signed document is a PDF, you can also use the \"Adobe Acrobat Reader\" software. If, via the Signature Panel, the software indicates \"This is a <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">Qualified Electronic Signature</span> according to EU Regulation 910/2014\", you can assume the signature is qualified.</p>\n<h4 id=\"via-a-qualified-trust-service\">Via a qualified trust service</h4>\n<p>Some <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> (QTSP) also offer \"qualified <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> service for <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>/seal\" services. When using this kind of service, <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">users</span> ensure the <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> service follows requirements laid down in eIDAS and benefit therefore of higher legal certainty.</p>\n<p>QTSP, as an eIDAS legal obligation, are mandatorily listed in the corresponding national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>. <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>, and therefore the providers listed in it, can be browsed in a <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly way using the <a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">Trusted List Browser</a>.</p>\n<p>Using <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span>, go to \"<a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/search/type/1\">Search by Type of service</a>\" (top left of the screen):</p>\n<ol>\n<li>Select \"Qualified <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> service for <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>\" or \"Qualified <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> service for <span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span>\" and click \"Next\".</li>\n<li>Then, select any country you may found appropriate and click \"Search\".</li>\n<li>Finally, click on any QTSP you may found appropriate and, via the \"Electronic address\" multi-part field of the \"Detailed information\", you will find a link to a website.</li>\n</ol>\n<hr>\n<h3 id=\"when-validating-a-qualified-certificate-what-is-the-related-trust-anchor\">When validating a qualified certificate, what is the related Trust Anchor?</h3>\n<p>As defined by RFC 5280, a <strong><span class=\"term-link\" data-term-id=\"trust-anchor\" tabindex=\"0\">Trust Anchor</span></strong> is the end point of a certificate <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> process.</p>\n<p>As part of the EU <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>, when validating a qualified certificate (i.e. <span class=\"term-link\" data-term-id=\"qc\" tabindex=\"0\">QC</span> for <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>, <span class=\"term-link\" data-term-id=\"qc\" tabindex=\"0\">QC</span> for <span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">electronic seals</span>, <span class=\"term-link\" data-term-id=\"qc\" tabindex=\"0\">QC</span> for website <span class=\"term-link\" data-term-id=\"authentication\" tabindex=\"0\">authentication</span>), the <span class=\"term-link\" data-term-id=\"trust-anchor\" tabindex=\"0\">Trust Anchor</span> is the Service digital identity (Sdi) of a <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust service</span> entry (cf. ETSI TS 119 612 v2.1.1). It means that, when validating a certificate, there is no need to chain up to the Root CA of a qualified certificate but only to the related CA/<span class=\"term-link\" data-term-id=\"qc\" tabindex=\"0\">QC</span> issuer entry within the <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span>.</p>\n<p>In order to extract the certificate chain from a qualified certificate to its issuer, you may find interesting the \"certificate <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span>\" feature of <a href=\"https://ec.europa.eu/digital-building-blocks/DSS/webapp-demo/validation\">DSS Demonstration WebApp</a>. This demo is based on the open-source library <span class=\"term-link\" data-term-id=\"digital-signature\" tabindex=\"0\">Digital Signature</span> Software (DSS). DSS supports the creation and verification of interoperable and secure <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span> in line with the eIDAS Regulation. More information is available in the <a href=\"https://ec.europa.eu/digital-building-blocks/sites/display/DIGITAL/Digital+Signature+Service+-++DSS#DigitalSignatureServiceDSS-Documentation\">DSS documentation</a>.</p>\n<p>You will also find more document information about this certificate <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> in the \"Introduction to the <span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">Qualified electronic signature</span> (<span class=\"term-link\" data-term-id=\"qes\" tabindex=\"0\">QES</span>) <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> algorithm\" <a href=\"https://ec.europa.eu/digital-building-blocks/sites/x/H4XXGw\">webpage</a>.</p>\n<hr>\n<h2 id=\"glossary\">Glossary</h2>\n<h3 id=\"what-does-ades-mean\">What does AdES mean?</h3>\n<p><span class=\"term-link\" data-term-id=\"ades\" tabindex=\"0\">AdES</span> is the acronym for either an <strong><span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span></strong> or an <strong><span class=\"term-link\" data-term-id=\"advanced-electronic-seal\" tabindex=\"0\">advanced electronic seal</span></strong>. It is the second level of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signatures</span>/seals defined in eIDAS.</p>\n<hr>\n<h3 id=\"what-does-qes-mean\">What does QES mean?</h3>\n<p><span class=\"term-link\" data-term-id=\"qes\" tabindex=\"0\">QES</span> is the acronym for either <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span></strong> or <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">qualified electronic seal</span></strong>. It is the third and most secure level of <span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">electronic signature</span>/seal defined in eIDAS.</p>\n<hr>\n<h3 id=\"what-does-qtspqts-mean\">What does (Q)TSP/(Q)TS mean?</h3>\n<p>A <strong><span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">trust service provider</span> (TSP)</strong> is a natural or a legal person who provides one or more <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> (TS) either as a qualified or as a non-<span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service provider</span>.</p>\n<p>A <strong><span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service provider</span> (QTSP)</strong> is a TSP who provides one or more <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> (QTS) and is granted the qualified status by the national supervisory body. The decision of the supervisory body to grant the qualified status is reflected in the corresponding national <a href=\"https://ec.europa.eu/digital-single-market/en/eu-trusted-lists-trust-service-providers\">Trusted List</a>. In this respect, QTSPs are mandatorily listed in the corresponding national <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span> while TSP could be but are not mandatorily listed in these <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>.</p>\n<p><span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>, and therefore the providers listed in it, can be browsed in a <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly way using the <a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">Trusted List Browser</a>.</p>\n<hr>\n<h3 id=\"what-does-qc-mean\">What does QC mean?</h3>\n<p><span class=\"term-link\" data-term-id=\"qc\" tabindex=\"0\">QC</span> stands for a <strong>qualified certificate</strong>. As part of eIDAS, a qualified certificate can either be a:</p>\n<ul>\n<li><span class=\"term-link\" data-term-id=\"qualified-certificate-for-electronic-signature\" tabindex=\"0\">Qualified certificate for electronic signature</span></li>\n<li><span class=\"term-link\" data-term-id=\"qualified-certificate-for-electronic-seal\" tabindex=\"0\">Qualified certificate for electronic seal</span></li>\n<li><span class=\"term-link\" data-term-id=\"qualified-certificate-for-website-authentication\" tabindex=\"0\">Qualified certificate for website authentication</span></li>\n</ul>\n<hr>\n<h3 id=\"what-does-qscd-mean\">What does QSCD mean?</h3>\n<p><span class=\"term-link\" data-term-id=\"qscd\" tabindex=\"0\">QSCD</span> stands for a <strong><span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">qualified electronic signature</span>/seal creation device</strong>.</p>\n<hr>\n<h3 id=\"what-does-adesqc-mean\">What does AdES/QC mean?</h3>\n<p><span class=\"term-link\" data-term-id=\"ades-qc\" tabindex=\"0\">AdES/QC</span> is an <strong><span class=\"term-link\" data-term-id=\"advanced-electronic-signature\" tabindex=\"0\">advanced electronic signature</span>/seal (<span class=\"term-link\" data-term-id=\"ades\" tabindex=\"0\">AdES</span>) based on a qualified certificate</strong>.</p>\n<hr>\n<h2 id=\"trusted-list-browser\">Trusted List Browser</h2>\n<h3 id=\"what-is-the-trusted-list-browser\">What is the Trusted List Browser?</h3>\n<p><a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">Trusted List Browser</a> is a publicly available tool provided by the European Commission. It allows the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> to browse through the information present in the Member States national <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span> (TLs), as well as in the European Commission central list (named <span class=\"term-link\" data-term-id=\"list-of-trusted-lists\" tabindex=\"0\">List of Trusted Lists</span> (<span class=\"term-link\" data-term-id=\"lotl\" tabindex=\"0\">LOTL</span>)). It provides an intuitive interface that is <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span>-friendly and human-readable.</p>\n<p><span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span> should be taken as a tool to search for <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">Trust Service Providers</span> and the services associated with them that are listed in a Member State national <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span>. It is not intended to provide sufficient information to be used in a <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> process.</p>\n<hr>\n<h3 id=\"what-is-a-trusted-list\">What is a Trusted List?</h3>\n<p>The eIDAS Regulation introduces the concept of <strong><span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span> (TL)</strong> in the following statement:</p>\n<blockquote>\n<p>\"Each Member State shall establish, maintain and publish <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">trusted lists</span>, including information related to the <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> for which it is responsible, together with information related to the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> provided by them.\" (eIDAS article 22.1).</p>\n</blockquote>\n<p>It may therefore be understood that all <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> (QTSP's) and the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> (QTS) they provide are mandatorily listed in its national TL, and that this is the main goal the TL's serve. Nevertheless, while not mandatory in eIDAS, Member States can also include in their TL's information related to non-QTSP and non-QTS.</p>\n<p>The information related to the <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> includes information about the status (e.g. granted, withdrawn) and the status history of the <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> in compliance with the applicable requirements and the relevant provisions of the eIDAS Regulation.</p>\n<p>In addition to the legal definition provided by eIDAS, the <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32015D1505\">Commission Implementing Decision (EU) 2015/1505</a> specifies the <span class=\"term-link\" data-term-id=\"technical-specification\" tabindex=\"0\">technical specifications</span> and formats for <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span>.</p>\n<hr>\n<h3 id=\"what-is-the-list-of-member-states-trusted-lists-also-named-list-of-trusted-lists-lotl\">What is the List of Member States Trusted Lists, also named List of Trusted Lists (LOTL)?</h3>\n<p>The eIDAS Regulation states that:</p>\n<blockquote>\n<p>\"The Commission shall make available to the public, through a secure channel, the information referred to in paragraph 3 [i.e. about Member States <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted Lists</span>] in electronically signed or sealed form suitable for automated <span class=\"term-link\" data-term-id=\"processing\" tabindex=\"0\">processing</span>.\" (eIDAS article 22.4)</p>\n</blockquote>\n<p>In practice, the European Commission publishes an XML document called the <strong><span class=\"term-link\" data-term-id=\"list-of-trusted-lists\" tabindex=\"0\">List of Trusted Lists</span> (<span class=\"term-link\" data-term-id=\"lotl\" tabindex=\"0\">LOTL</span>)</strong>, which consists of a compiled list of links (pointers) towards all <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">trusted lists</span> from the Member States, together with the certificates used to sign these <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">trusted lists</span>.</p>\n<p>The primary goals of the publication of the <span class=\"term-link\" data-term-id=\"lotl\" tabindex=\"0\">LOTL</span> are to allow access to the <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">trusted lists</span> of all Member States in an easy way and to provide a way to trust and authenticate those lists.</p>\n<p>More information on the <span class=\"term-link\" data-term-id=\"lotl\" tabindex=\"0\">LOTL</span> can be found <a href=\"https://eidas.ec.europa.eu/efda/tl-browser/#/screen/home\">here</a>.</p>\n<hr>\n<h3 id=\"which-trust-service-providers-can-i-find-using-trusted-list-browser\">Which trust service providers can I find using Trusted List Browser?</h3>\n<p>Using the <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span> allows you to find any <span class=\"term-link\" data-term-id=\"trust-service-provider\" tabindex=\"0\">Trust Service Provider</span> (TSP) listed in a Member State national <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span>. This means that you should be able to find any <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">Qualified Trust Service Providers</span> (QTSP's) and the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> it provides, as it is mandatory for them to be listed in an EU MS national TL.</p>\n<p>Any other TSP (i.e. non-qualified TSP) may or may not be found using <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span>, as they are not required to be listed in a national TL.</p>\n<p>Please keep mind that <strong>finding a TSP using <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span> does not mean that it is a Qualified TSP</strong>. In order to verify that a TSP corresponds to your needs, you can refer to the tags associated to it.</p>\n<hr>\n<h3 id=\"what-is-a-qualified-trust-service\">What is a qualified trust service?</h3>\n<p>The eIDAS Regulation aims to deliver a comprehensive cross-border and cross-sector framework for secure, trustworthy and easy-to-use electronic transactions. <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">Qualified trust services</span> are a mean to this end, as their legal significance is recognised at European level. They are subject to strict requirements that consist of:</p>\n<p><strong>a) Issuing qualified certificates for:</strong></p>\n<ul>\n<li><span class=\"term-link\" data-term-id=\"electronic-signature\" tabindex=\"0\">Electronic signature</span></li>\n<li><span class=\"term-link\" data-term-id=\"electronic-seal\" tabindex=\"0\">Electronic seal</span></li>\n<li>Website <span class=\"term-link\" data-term-id=\"authentication\" tabindex=\"0\">authentication</span></li>\n</ul>\n<p><strong>b) Providing qualified <span class=\"term-link\" data-term-id=\"validation\" tabindex=\"0\">validation</span> of:</strong></p>\n<ul>\n<li><span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">Qualified electronic signature</span></li>\n<li><span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">Qualified electronic seal</span></li>\n</ul>\n<p><strong>c) Providing qualified preservation of:</strong></p>\n<ul>\n<li><span class=\"term-link\" data-term-id=\"qualified-electronic-signature\" tabindex=\"0\">Qualified electronic signature</span></li>\n<li><span class=\"term-link\" data-term-id=\"qualified-electronic-seal\" tabindex=\"0\">Qualified electronic seal</span></li>\n</ul>\n<p><strong>d) Issuing qualified time stamp</strong></p>\n<p><strong>e) Providing qualified electronic registered delivery</strong></p>\n<hr>\n<h3 id=\"what-is-the-difference-between-non-qualified-and-qualified-trust-service-providers\">What is the difference between non-qualified and qualified trust service providers?</h3>\n<p>The eIDAS Regulation defines a <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service provider</span> (QTSP) as \"[…] a natural or a legal person who provides one or more <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> […]\".</p>\n<p>As opposed to non-<span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span>, QTSP's are thus granted the right to deliver one or more <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> after undergoing a strict assessment process.</p>\n<p>While it is mandatory for QTSP to be listed in an EU Member State <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span> (TL), member states may decide to include non-<span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> in their TL.</p>\n<p><span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span> allows the <span class=\"term-link\" data-term-id=\"user\" tabindex=\"0\">user</span> to search for QTSP by the type of <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> they provide, as well as easily identifying which <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span>, qualified or not, are provided by a particular TSP listed on a national TL, using explicit tags.</p>\n<hr>\n<h3 id=\"why-is-a-qualified-trust-service-provider-tagged-with-non-qualified-trust-services\">Why is a qualified trust service provider tagged with non-qualified trust services?</h3>\n<p>A <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service provider</span> (QTSP) must provide at least one <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span>, but may also provide non-<span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span>. That is the reason why some QTSP may be tagged with qualified and non-<span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> in the <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span>.</p>\n<hr>\n<h3 id=\"what-are-the-tags-granted-and-withdrawn\">What are the tags \"granted\" and \"withdrawn\"?</h3>\n<p>These two tags only concern <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span>. The right for a <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">Qualified Trust Service Provider</span> (QTSP) to provide a <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span> (QTS) is decided by the national Supervisory Body (SB). The decision of the SB to allow the QTSP to provide the QTS is reflected in the associated national <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span> (TL). This is a field that <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span> visually represents as a tag under the QTS.</p>\n<ul>\n<li>If the tag under the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span> states <strong>\"Granted\"</strong>, this means that the QTSP has been granted by the SB the right to currently provide the QTS.</li>\n<li>If the tag under the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span> is <strong>\"Withdrawn\"</strong>, this means that the QTSP was, at one time, given the right to provide this <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span>, but this right has been currently withdrawn.</li>\n</ul>\n<p>The history of this status can be found in <span class=\"term-link\" data-term-id=\"trusted-list-browser\" tabindex=\"0\">Trusted List Browser</span> under the banner \"History\", accessible by clicking on a <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust service</span>.</p>\n<hr>\n<h3 id=\"what-are-the-tags-non-regulatory-and-undefined\">What are the tags \"Non-Regulatory\" and \"Undefined\"?</h3>\n<p>These two tags only concern non-<span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> and have to do with a refinement of their type:</p>\n<ul>\n<li>The tag <strong>\"Undefined\"</strong> is associated with <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> whose type has been defined in the eIDAS Regulation, but for which there is a lack of additional information in the TL to further specify its use.</li>\n<li>The tag <strong>\"Non-Regulatory\"</strong> on the other hand is associated with <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust services</span> whose type has not been defined in the eIDAS Regulation and are country-specific.</li>\n</ul>\n<hr>\n<h3 id=\"what-are-the-tags-recognised-at-national-level-and-deprecated-at-national-level\">What are the tags \"Recognised at national level\" and \"Deprecated at national level\"?</h3>\n<p>These two tags only concern non-<span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> and have to do with a refinement of their type:</p>\n<ul>\n<li>The tag <strong>\"Recognised at national level\"</strong> means that the <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust service</span> to which it refers as well as the relevant TSP have been granted an \"approved\" status, as recognized at national level.</li>\n<li>The tag <strong>\"Deprecated at national level\"</strong> means that the <span class=\"term-link\" data-term-id=\"trust-service\" tabindex=\"0\">trust service</span> to which it refers as well as the relevant TSP had their \"approved\" status withdrawn.</li>\n</ul>\n<hr>\n<h3 id=\"i-cant-find-a-trust-service-provider-in-your-trusted-list-browser-why-so\">I can't find a trust service provider in your Trusted List Browser, why so?</h3>\n<p>According to the eIDAS Regulation, only the <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">Qualified Trust Service Providers</span> (QTSP's) have to be listed in a <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span>:</p>\n<blockquote>\n<p>\"Each Member State shall establish, maintain and publish <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">trusted lists</span>, including information related to the <span class=\"term-link\" data-term-id=\"qualified-trust-service-provider\" tabindex=\"0\">qualified trust service providers</span> for which it is responsible, together with information related to the <span class=\"term-link\" data-term-id=\"qualified-trust-service\" tabindex=\"0\">qualified trust services</span> provided by them.\" (eIDAS article 22.1)</p>\n</blockquote>\n<p>As such, each national <span class=\"term-link\" data-term-id=\"trusted-list\" tabindex=\"0\">Trusted List</span> may or may not include non-qualified TSPs. It is up to the Member State's Supervisory Body to decide which non-qualified TSP will be listed.</p>",
  "wordCount": 5788,
  "lastProcessed": "2026-01-21T16:36:32.491Z",
  "preambleInjected": false
}